{"title": "Bridging Screen Readers and Voice Assistants for Enhanced Eyes-Free Web Search", "authors": ["Alexandra Vtyurina\n,", "Adam Fourney\n,", "Meredith Ringel Morris\n,", "Leah Findlater\n,", "Ryen W. White"], "publication": "WWW '19: The World Wide Web Conference", "abstract": "ABSTRACT\nPeople with visual impairments often rely on screen readers when interacting with computer systems. Increasingly, these individuals also make extensive use of voice-based virtual assistants (VAs). We conducted a survey of 53 people who are legally blind to identify the strengths and weaknesses of both technologies, as well as the unmet opportunities at their intersection. We learned that virtual assistants are convenient and accessible, but lack the ability to deeply engage with content (e.g., read beyond the first few sentences of Wikipedia), and the ability to get a quick overview of the landscape (list alternative search results & suggestions). In contrast, screen readers allow for deep engagement with content (when content is accessible), and provide fine-grained navigation & control, but at the cost of increased complexity, and reduced walk-up-and-use convenience. In this demonstration, we showcase VERSE, a system that combines the positive aspects of VAs and screen readers, and allows other devices (e.g., smart watches) to serve as optional input accelerators. Together, these features allow people with visual impairments to deeply engage with web content through voice interaction.", "references": ["Ali Abdolrahmani, Ravi Kuber, and Stacy Branham. 2018. “Siri Talks at You”: An Empirical Investigation of Voice Activated Personal Assistant (VAPA) Usage by Individuals Who are Blind. In Proceedings of the 20th International ACM SIGACCESS Conference on Computers and Accessibility. ACM, 249-258.", "Jonathan Lazar, Jinjuan Heidi Feng, and Harry Hochheiser. 2017. Research methods in human-computer interaction. Morgan Kaufmann.", "Ewa Luger and Abigail Sellen. 2016. Like having a really bad PA: the gulf between user expectation and experience of conversational agents. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. ACM, 5286-5297.", "", "", "", "", ""]}, {"title": "Incorporating System-Level Objectives into Recommender Systems", "authors": ["Himan Abdollahpouri"], "publication": "WWW '19: Companion Proceedings of The 2019 World Wide Web Conference", "abstract": "ABSTRACT\nOne of the most essential parts of any recommender system is personalization– how acceptable the recommendations are from the user’s perspective. However, in many real-world applications, there are other stakeholders whose needs and interests should be taken into account. In this work, we define the problem of multistakeholder recommendation and we focus on finding algorithms for a special case where the recommender system itself is also a stakeholder. In addition, we will explore the idea of incremental incorporation of system-level objectives into recommender systems over time to tackle the existing problems in the optimization techniques which only look for optimizing the individual users’ lists.", "references": ["Himan Abdollahpouri. 2019. Popularity Bias in Ranking and Recommendation. In In AAAI/ACM Conference on AI, Ethics, and Society (AIES’19) January 27–28, 2019, Honolulu, HI, USA. ACM.", "Himan Abdollahpouri, Robin Burke, and Bamshad Mobasher. 2017. Controlling Popularity Bias in Learning to Rank Recommendation. In Proceedings of the 11th ACM conference on Recommender systems.", "Himan Abdollahpouri, Robin Burke, and Bamshad Mobasher. 2017. Recommender Systems as Multistakeholder Environments. In Proceedings of the 25th Conference on User Modeling, Adaptation and Personalization (UMAP’17). Bratislava, Slovakia, To appear.", "", "", "", "", "", "", "", "", "", "", "", "", "Himan Abdollahpouri. 2019. Popularity Bias in Ranking and Recommendation. In In AAAI/ACM Conference on AI, Ethics, and Society (AIES’19) January 27–28, 2019, Honolulu, HI, USA. ACM.", "Himan Abdollahpouri, Robin Burke, and Bamshad Mobasher. 2017. Controlling Popularity Bias in Learning to Rank Recommendation. In Proceedings of the 11th ACM conference on Recommender systems.", "", "", "", "", "", "", "", "", "", "", "", "", ""]}, {"title": "Exploring Video Game Searches on the Web", "authors": ["Behrooz Mansouri\n,", "Mohammad Sadegh Zahedi\n,", "Ricardo Campos\n,", "Mojgan Farhoodi"], "publication": "WWW '19: Companion Proceedings of The 2019 World Wide Web Conference", "abstract": "ABSTRACT\nAs video games are developing fast, many users issue queries related to video games in a daily fashion. While there were a few attempts to understand their behavior, little is known on how the video game-related searches are done. Digesting and analyzing this search behavior may thus be faced as an important contribution for search engines to provide better results and search services for their users. To overcome this lack of knowledge and to gain more insight into how video game searches are done, we analyze in this paper, a number of game search queries submitted to a general search engine named Parsijoo. The analysis conducted was performed on top of 372,508 game search records extracted from the query logs within 253,516 different search sessions. Different aspects of video game searches are studied, including, their temporal distribution, game version specification, popular game categories, popular game platforms, game search sessions and clicked pages. Overall, the experimental analysis on video game searches shows that the current retrieval methods used by traditional search engines cannot be applied for game searches, thus, different retrieval and search services should be considered for these searches in the future.", "references": ["Bai, X., Ordentlich, E., Zhang, Y., Feng, A., Ratnaparkhi, A., Somvanshi, R., & Tjahjadi, A. (2018). Scalable Query N-Gram Embedding for Improving Matching and Relevance in Sponsored Search. In Proceedings of the 24th ACM SIGKDD International Conference on Knowledge Discovery & Data Mining (pp. 52-61). ACM.", "Beitzel, S. M., Jensen, E. C., Chowdhury, A., Frieder, O., & Grossman, D. (2007). Temporal analysis of a very large topically categorized web query log. Journal of the American Society for Information Science and Technology, 58(2), 166-178.", "Bendersky, M., & Croft, W. B. (2009). Analysis of long queries in a large scale search log. In Proceedings of the 2009 workshop on Web Search Click Data (pp. 8-14). ACM.", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "Bai, X., Ordentlich, E., Zhang, Y., Feng, A., Ratnaparkhi, A., Somvanshi, R., & Tjahjadi, A. (2018). Scalable Query N-Gram Embedding for Improving Matching and Relevance in Sponsored Search. In Proceedings of the 24th ACM SIGKDD International Conference on Knowledge Discovery & Data Mining (pp. 52-61). ACM.", "Beitzel, S. M., Jensen, E. C., Chowdhury, A., Frieder, O., & Grossman, D. (2007). Temporal analysis of a very large topically categorized web query log. Journal of the American Society for Information Science and Technology, 58(2), 166-178.", "Bendersky, M., & Croft, W. B. (2009). Analysis of long queries in a large scale search log. In Proceedings of the 2009 workshop on Web Search Click Data (pp. 8-14). ACM.", "Broder, A. Z., Carmel, D., Herscovici, M., Soffer, A., & Zien, J. (2003). Efficient query evaluation using a two-level retrieval process. In Proceedings of the twelfth international conference on Information and knowledge management (pp. 426-434). ACM.", "Campos, R. N. T. (2013). Disambiguating implicit temporal queries for temporal information retrieval applications.", "Dong, A., Chang, Y., Zheng, Z., Mishne, G., Bai, J., Zhang, R., ... & Diaz, F. (2010). Towards recency ranking in web search. In Proceedings of the third ACM international conference on Web search and data mining (pp. 11-20). ACM.", "", "", "", "", "", "", "", "", "", "", "", ""]}, {"title": "Preliminary Investigation of Alleviating User Cold-Start Problem in E-commerce with Deep Cross-Domain Recommender System", "authors": ["Hanxin Wang\n,", "Daichi Amagata\n,", "Takuya Maekawa\n,", "Takahiro Hara\n,", "Hao Niu\n,", "Kei Yonekawa\n,", "Mori Kurokawa"], "publication": "WWW '19: Companion Proceedings of The 2019 World Wide Web Conference", "abstract": "ABSTRACT\nMany current applications use recommender systems to predict user preferences, aiming at improving user experience and increasing the amount of sales and the usage time that users spent on the application. However, it is not an easy task to recommend items to new users accurately because of the user cold-start problem, which means that recommendation performance will degrade on users with little interaction, particularly for latent users who have never used the service before. In this work, we combine an online shopping domain with information from an ad platform, and then apply deep learning to build a cross-domain recommender system based on shared users of these two domains, to alleviate the user cold-start problem. Experimental results show the effectiveness of our deep cross-domain recommender system on handling user cold-start problem. By our framework, it is possible to recommend products to users of other domain through ad distribution in a more accurate level, and to increase sales amount of online shopping.", "references": ["Paul Covington, Jay Adams, and Emre Sargin. 2016. Deep Neural Networks for YouTube Recommendations. In RecSys. 191–198.", "Xavier Glorot and Yoshua Bengio. 2010. Understanding the difficulty of training deep feedforward neural networks. In AISTATS. 249–256.", "Xavier Glorot, Antoine Bordes, and Yoshua Bengio. 2011. Deep sparse rectifier neural networks. In AISTATS. 315–323.", "Xiangnan He, Lizi Liao, Hanwang Zhang, Liqiang Nie, Xia Hu, and Tat-Seng Chua. 2017. Neural collaborative filtering. In WWW. 173–182.", "Xiangnan He, Hanwang Zhang, Min-Yen Kan, and Tat-Seng Chua. 2016. Fast matrix factorization for online recommendation with implicit feedback. In SIGIR. 549–558.", "Guangneng Hu, Yu Zhang, and Qiang Yang. 2018. CoNet: Collaborative Cross Networks for Cross-Domain Recommendation. In CIKM. 667–676.", "Yifan Hu, Yehuda Koren, and Chris Volinsky. 2008. Collaborative filtering for implicit feedback datasets. In ICDM. 263–272.", "Sergey Ioffe and Christian Szegedy. 2015. Batch normalization: Accelerating deep network training by reducing internal covariate shift. arXiv:1502.03167 (2015).", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", ""]}, {"title": "Reference Product Search", "authors": ["Chu Wang\n,", "Lei Tang\n,", "Shujun Bian\n,", "Da Zhang\n,", "Zuohua Zhang\n,", "Yongning Wu"], "publication": "WWW '19: Companion Proceedings of The 2019 World Wide Web Conference", "abstract": "ABSTRACT\nFor a product of interest, we propose a search method to surface a set of reference products. The reference products can be used as candidates to support downstream modeling tasks and business applications. The search method consists of product representation learning and fingerprint-type vector searching. The product catalog information is transformed into a high-quality embedding of low dimensions via a novel attention auto-encoder neural network, and the embedding is further coupled with a binary encoding vector for fast retrieval. We conduct extensive experiments to evaluate the proposed method, and compare it with peer services to demonstrate its advantage in terms of search return rate and precision.", "references": ["David W Aha, Dennis Kibler, and Marc K Albert. 1991. Instance-based learning algorithms. Machine learning6, 1 (1991), 37–66.", "Christine M Anderson-Cook. 2005. Practical genetic algorithms.", "Alex Auvolat, Sarath Chandar, Pascal Vincent, Hugo Larochelle, and Yoshua Bengio. 2015. Clustering is efficient for approximate maximum inner product search. arXiv:1507.05910 (2015).", "Yoram Bachrach, Yehuda Finkelstein, Ran Gilad-Bachrach, Liran Katzir, Noam Koenigstein, Nir Nice, and Ulrich Paquet. 2014. Speeding up the xbox recommender system using a euclidean transformation for inner-product spaces. In Proceedings of the 8th ACM Conference on Recommender systems. ACM, 257–264.", "Yoshua Bengio, Aaron Courville, and Pascal Vincent. 2013. Representation learning: A review and new perspectives. IEEE transactions on pattern analysis and machine intelligence35, 8(2013), 1798–1828.", "Leonid Boytsov and Bilegsaikhan Naidan. 2013. Engineering efficient and effective non-metric space library. In International Conference on Similarity Search and Applications. Springer, 280–293.", "Daniel Cer, Yinfei Yang, Sheng-yi Kong, Nan Hua, Nicole Limtiaco, Rhomni St John, Noah Constant, Mario Guajardo-Cespedes, Steve Yuan, Chris Tar, 2018. Universal sentence encoder. arXiv:1803.11175 (2018).", "Jia Deng, Wei Dong, Richard Socher, Li-Jia Li, Kai Li, and Li Fei-Fei. 2009. Imagenet: A large-scale hierarchical image database. In Computer Vision and Pattern Recognition, 2009. CVPR 2009. IEEE Conference on. Ieee, 248–255.", "Jacob Devlin, Ming-Wei Chang, Kenton Lee, and Kristina Toutanova. 2018. Bert: Pre-training of deep bidirectional transformers for language understanding. arXiv:1810.04805 (2018).", "Bernhardsson Erik. 2016. Approximate Nearest Neigbors OnYeah (Annoy). https://github.com/spotify/annoy.", "Yunchao Gong, Svetlana Lazebnik, Albert Gordo, and Florent Perronnin. 2013. Iterative quantization: A procrustean approach to learning binary codes for large-scale image retrieval. IEEE Transactions on Pattern Analysis and Machine Intelligence35, 12(2013), 2916–2929.", "Clinton Gormley and Zachary Tong. 2015. Elasticsearch: The Definitive Guide: A Distributed Real-Time Search and Analytics Engine. ” O’Reilly Media, Inc.”.", "Kaiming He, Xiangyu Zhang, Shaoqing Ren, and Jian Sun. 2016. Deep residual learning for image recognition. In Proceedings of the IEEE conference on computer vision and pattern recognition. 770–778.", "Gisli R Hjaltason and Hanan Samet. 2003. Index-driven similarity search in metric spaces (survey article). ACM Transactions on Database Systems (TODS)28, 4 (2003), 517–580.", "Herve Jegou, Matthijs Douze, and Cordelia Schmid. 2011. Product quantization for nearest neighbor search. IEEE transactions on pattern analysis and machine intelligence33, 1(2011), 117–128.", "Armand Joulin, Edouard Grave, Piotr Bojanowski, and Tomas Mikolov. 2016. Bag of tricks for efficient text classification. arXiv:1607.01759 (2016).", "Noam Koenigstein, Parikshit Ram, and Yuval Shavitt. 2012. Efficient retrieval of recommendations in a matrix factorization framework. In International conference on Information and knowledge management. ACM, 535–544.", "Quoc Le and Tomas Mikolov. 2014. Distributed representations of sentences and documents. In International Conference on Machine Learning. 1188–1196.", "Greg Linden, Brent Smith, and Jeremy York. 2003. Amazon. com recommendations: Item-to-item collaborative filtering. IEEE Internet computing1(2003), 76–80.", "Yury A Malkov and Dmitry A Yashunin. 2018. Efficient and robust approximate nearest neighbor search using hierarchical navigable small world graphs. IEEE transactions on pattern analysis and machine intelligence (2018).", "Marius Muja and David G Lowe. 2014. Scalable nearest neighbor algorithms for high dimensional data. IEEE Transactions on Pattern Analysis & Machine Intelligence11 (2014), 2227–2240.", "Bilegsaikhan Naidan, Leonid Boytsov, Malkov Yury, Novak David, and Frederickson Ben. 2016. Non-Metric Space Library (NMSLIB). https://github.com/nmslib/nmslib.", "Ruslan Salakhutdinov and Geoffrey Hinton. 2009. Semantic hashing. International Journal of Approximate Reasoning50, 7 (2009), 969–978.", "Hinrich Schütze, Christopher D Manning, and Prabhakar Raghavan. 2008. Introduction to information retrieval. Vol. 39. Cambridge University Press.", "Thomas Seidl and Hans-Peter Kriegel. 1998. Optimal multi-step k-nearest neighbor search. In ACM Sigmod Record, Vol. 27. ACM, 154–165.", "Anshumali Shrivastava and Ping Li. 2014. Asymmetric LSH (ALSH) for sublinear time maximum inner product search (MIPS). In Advances in Neural Information Processing Systems. 2321–2329.", "Karen Simonyan and Andrew Zisserman. 2014. Very deep convolutional networks for large-scale image recognition. arXiv:1409.1556 (2014).", "David Smiley, Eric Pugh, Kranti Parisa, and Matt Mitchell. 2015. Apache Solr enterprise search server. Packt Publishing Ltd.", "Ashish Vaswani, Noam Shazeer, Niki Parmar, Jakob Uszkoreit, Llion Jones, Aidan N Gomez, Łukasz Kaiser, and Illia Polosukhin. 2017. Attention is all you need. In Advances in Neural Information Processing Systems. 5998–6008.", "Sudheendra Vijayanarasimhan, Jonathon Shlens, Rajat Monga, and Jay Yagnik. 2014. Deep networks with large output spaces. arXiv:1412.7479 (2014).", "Pascal Vincent, Hugo Larochelle, Yoshua Bengio, and Pierre-Antoine Manzagol. 2008. Extracting and composing robust features with denoising autoencoders. In Proceedings of the 25th international conference on Machine learning. ACM, 1096–1103.", "Pascal Vincent, Hugo Larochelle, Isabelle Lajoie, Yoshua Bengio, and Pierre-Antoine Manzagol. 2010. Stacked denoising autoencoders: Learning useful representations in a deep network with a local denoising criterion. Journal of machine learning research11, Dec (2010), 3371–3408.", "Jingdong Wang, Heng Tao Shen, Jingkuan Song, and Jianqiu Ji. 2014. Hashing for similarity search: A survey. arXiv:1408.2927 (2014).", "Jason Weston, Samy Bengio, and Nicolas Usunier. {n. d.}. Wsabie: Scaling up to large vocabulary image annotation.", "D Randall Wilson and Tony R Martinez. 2000. Reduction techniques for instance-based learning algorithms. Machine learning38, 3 (2000), 257–286.", "Rongkai Xia, Yan Pan, Hanjiang Lai, Cong Liu, and Shuicheng Yan. 2014. Supervised hashing for image retrieval via image representation learning."]}, {"title": "Neural Product Retrieval at Walmart.com", "authors": ["Alessandro Magnani\n,", "Feng Liu\n,", "Min Xie\n,", "Somnath Banerjee"], "publication": "WWW '19: Companion Proceedings of The 2019 World Wide Web Conference", "abstract": "ABSTRACT\nFor an E-commerce website like Walmart.com, search is one of the most critical channel for engaging customer. Most existing works on search are composed of two steps, a retrieval step which obtains the candidate set of matching items, and a re-rank step which focuses on fine-tuning the ranking of candidate items. Inspired by latest works in the domain of neural information retrieval (NIR), we discuss in this work our exploration of various product retrieval models which are trained on search log data. We discuss a set of lessons learned in our empirical result section, and these results can be applied to any product search engine which aims at learning a good product retrieval model based on search log data.", "references": ["2019. Apache Lucene. http://lucene.apache.org.", "Martín Abadi, Paul Barham, Jianmin Chen, Zhifeng Chen, Andy Davis, Jeffrey Dean, Matthieu Devin, Sanjay Ghemawat, Geoffrey Irving, Michael Isard, Manjunath Kudlur, Josh Levenberg, Rajat Monga, Sherry Moore, Derek Gordon Murray, Benoit Steiner, Paul A. Tucker, Vijay Vasudevan, Pete Warden, Martin Wicke, Yuan Yu, and Xiaoqiang Zheng. 2016. TensorFlow: A System for Large-Scale Machine Learning. In 12th USENIX Symposium on Operating Systems Design and Implementation, OSDI 2016, Savannah, GA, USA, November 2-4, 2016.265–283.", "Piotr Bojanowski, Edouard Grave, Armand Joulin, and Tomas Mikolov. 2017. Enriching Word Vectors with Subword Information. TACL5(2017), 135–146.", "Eliot Brenner, Jun Zhao, Aliasgar Kutiyanawala, and Zheng Yan. 2018. End-to-End Neural Ranking for eCommerce Product Search: an application of task models and textual embeddings. In eCom.", "Daniel Cer, Yinfei Yang, Sheng-yi Kong, Nan Hua, Nicole Limtiaco, Rhomni St. John, Noah Constant, Mario Guajardo-Cespedes, Steve Yuan, Chris Tar, Yun-Hsuan Sung, Brian Strope, and Ray Kurzweil. 2018. Universal Sentence Encoder. CoRRabs/1803.11175(2018).", "Aleksandr Chuklin, Ilya Markov, and Maarten de Rijke. 2015. Click Models for Web Search. Morgan & Claypool Publishers.", "Jacob Devlin, Ming-Wei Chang, Kenton Lee, and Kristina Toutanova. 2018. BERT: Pre-training of Deep Bidirectional Transformers for Language Understanding. CoRRabs/1810.04805(2018).", "Huizhong Duan, ChengXiang Zhai, Jinxing Cheng, and Abhishek Gattani. 2013. Supporting Keyword Search in Product Database: A Probabilistic Approach. PVLDB6, 14 (2013), 1786–1797.", "Susan T. Dumais. 2016. Personalized Search: Potential and Pitfalls. In Proceedings of the 25th ACM International Conference on Information and Knowledge Management, CIKM 2016, Indianapolis, IN, USA, October 24-28, 2016. 689.", "Christophe Van Gysel, Maarten de Rijke, and Evangelos Kanoulas. 2018. Mix’n Match: Integrating Text Matching and Product Substitutability within Product Search. In CIKM.", "Po-Sen Huang, Xiaodong He, Jianfeng Gao, Li Deng, Alex Acero, and Larry P. Heck. 2013. Learning deep structured semantic models for web search using clickthrough data. In 22nd ACM International Conference on Information and Knowledge Management, CIKM’13, San Francisco, CA, USA, October 27 - November 1, 2013. 2333–2338.", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", ""]}, {"title": "Exploration of Product Search Intents via Clustering of Query Clusters", "authors": ["Omar Alonso\n,", "Vasileios Kandylas\n,", "Serge-Eric Tremblay"], "publication": "WWW '19: Companion Proceedings of The 2019 World Wide Web Conference", "abstract": "ABSTRACT\nWe describe a system that organizes search results in the context of an exploratory product search session where the user is researching goods. Compared to existing approaches that use predefined categories to filter results by attributes, we organize information needs based on queries instead of documents. The idea is to organize queries around the same topic and produce a hierarchical representation of intents that describe information about a product from different perspectives. We present a prototype implementation using a real-world data set of 24M queries.", "references": ["Ricardo A. Baeza-Yates and Alessandro Tiberi. 2007. Extracting semantic relations from query logs. In Proc. of SIGKDD. 76–85.", "Ilaria Bordino, Mounia Lalmas, Yelena Mejova, and Olivier Van Laere. 2016. Beyond Entities: Promoting Explorative Search With Bundles. Inf. Retr. Journal 19, 5 (2016), 447–486.", "Claudio Carpineto, Stanislaw Osinski, Giovanni Romano, and Dawid Weiss. 2009. A survey of Web clustering engines. ACM Comput. Surv. 41, 3 (2009), 17:1–17:38.", "Marti A. Hearst. 2009. Search User Interfaces(1st ed.). Cambridge University Press.", "Beibei Li, Anindya Ghose, and Panagiotis G. Ipeirotis. 2011. A Demo Search Engine for Products. In Proc. of WWW. 233–236.", "Gary Marchionini. 2006. Exploratory Search: From Finding to Understanding. Commun. ACM 49, 4 (2006), 41–46.", "M. E. J. Newman. 2006. Modularity and community structure in networks. 103, 23 (2006), 8577–8582.", "Thibault Sellam, Martin Hentschel, Vasilis Kandylas, and Omar Alonso. 2016. e#: Sharper Expertise Detection from Microblogs. In Proc. of EDBT. 563–572.", "Daria Sorokina and Erick Cantu-Paz. 2016. Amazon Search: The Joy of Ranking Products. In Proc. of SIGIR. 459–460."]}, {"title": "On the Relation Between Products’ Relevance and Customers’ Satisfaction in Voice Shopping", "authors": ["David Carmel"], "publication": "WWW '19: Companion Proceedings of The 2019 World Wide Web Conference", "abstract": "ABSTRACT\nIn this talk we consider the domain of voice shopping in Alexa, Amazon’s voice assistant. In this domain, search scenarios are integral part of the shopping sessions, where users seek for a product to buy, or for some information about a product. The fact that in voice search, both the input and output are spoken, involves many challenges in automatic speech recognition, natural language understanding, question answering, and new user experiences. We will elaborate on customers’ behavior in voice shopping, where we have observed an interesting and surprising phenomenon that many customers purchase or engage with irrelevant search results. The term “irrelevance” may mislead, since a relevant item is typically interpreted as “anything that satisfies the user needs”. Thus, the title of this work may look as an oxymoron – the purchase of a product is a strong signal of relevance to the customer. In the context of this work we take a simplified approach. We mark product items as relevant or irrelevant to the user query based on the relevance judgments of several human annotators. However, even in the context of objective relevance judgments, it is still surprising that so many customers engage with irrelevant results. We will analyze this phenomenon and demonstrate its significance. We will offer several hypotheses as to the reasons behind customers’ purchase and engagement with irrelevant results, including customers’ personal preferences, trendiness of the products and their relatedness to the query, the query intent and the product price.", "references": []}, {"title": "Searching News Articles Using an Event Knowledge Graph Leveraged by Wikidata", "authors": ["Charlotte Rudnik\n,", "Thibault Ehrhart\n,", "Olivier Ferret\n,", "Denis Teyssou\n,", "Raphael Troncy\n,", "Xavier Tannier"], "publication": "WWW '19: Companion Proceedings of The 2019 World Wide Web Conference", "abstract": "ABSTRACT\nNews agencies produce thousands of multimedia stories describing events happening in the world that are either scheduled such as sports competitions, political summits and elections, or breaking events such as military conflicts, terrorist attacks, natural disasters, etc. When writing up those stories, journalists refer to contextual background and to compare with past similar events. However, searching for precise facts described in stories is hard. In this paper, we propose a general method that leverages the Wikidata knowledge base to produce semantic annotations of news articles. Next, we describe a semantic search engine that supports both keyword based search in news articles and structured data search providing filters for properties belonging to specific event schemas that are automatically inferred.", "references": ["Razvan Bunescu and Marius Paşca. 2006. Using Encyclopedic Knowledge for Named entity Disambiguation. In 11th Conference of the European Chapter of the Association for Computational Linguistics (EACL).", "Simon Gottschalk and Elena Demidova. 2018. EventKG: A Multilingual Event-Centric Temporal Knowledge Graph. In Extended Semantic Web Conference (ESWC).", "J. Hoffart, F. M. Suchanek, K. Berberich, and G. Weikum. 2013. YAGO2: A Spatially and Temporally Enhanced Knowledge Base from Wikipedia. Artificial Intelligence, special issue on Wikipedia and Semi-Structured Resources (2013).", "Ji Young Lee and Franck Dernoncourt. 2016. Sequential Short-Text Classification with Recurrent and Convolutional Neural Networks. In Conference of the North American Chapter of the Association for Computational Linguistics: Human Language Technologies. San Diego, California, 515–520.", "Jens Lehmann, Robert Isele, Max Jakob, Anja Jentzsch, Dimitris Kontokostas, Pablo N. Mendes, Sebastian Hellmann, Mohamed Morsey, Patrick van Kleef, Sören Auer, and Christian Bizer. 2013. DBpedia - A Large-scale, Multilingual Knowledge Base Extracted from Wikipedia. Semantic Web Journal(2013).", "Lijun Lyu and Besnik Fetahu. 2018. Real-time Event-based News Suggestion for Wikipedia Pages from News Streams. In Wiki Workshop. Lyon, France, 1793–1799.", "Rada Mihalcea and Andras Csomai. 2007. Wikify!: Linking Documents to Encyclopedic Knowledge. In 16th ACM Conference on Conference on Information and Knowledge Management (CIKM). Lisbon, Portugal, 233–242.", "Tomas Mikolov, Ilya Sutskever, Kai Chen, Greg S Corrado, and Jeff Dean. 2013. Distributed Representations of Words and Phrases and their Compositionality. In Advances in Neural Information Processing Systems (NIPS). 3111–3119.", "Arunav Mishra. 2014. Linking Today’s Wikipedia and News from the Past. In 7th ACM Workshop on Ph.D Students on Information and Knowledge Management (PIKM). Shanghai, China, 1–8.", "Arunav Mishra and Klaus Berberich. 2016. Leveraging Semantic Annotations to Link Wikipedia and News Archives. In 38th European Conference on Information Retrieval (ECIR). Padua, Italy, 30–42.", "Julien Plu, Giuseppe Rizzo, and Raphael Troncy. 2019. ADEL: ADaptable Entity Linking. Semantic Web Journal(2019).", "Kevin Reschke, Martin Jankowiak, Mihai Surdeanu, Christopher Manning, and Daniel Jurafsky. 2014. Event Extraction Using Distant Supervision. In 9th International Conference on Language Resources and Evaluation (LREC). Reykjavik, Iceland.", "Mitja Trampuš and Blaz Novak. 2012. The Internals Of An Aggregated Web News Feed. In Conference on Data Mining and Data Warehouses (SiKDD).", "Giang Binh Tran and Mohammad Alrifai. 2014. Indexing and Analyzing Wikipedia’s Current Events Portal, the Daily News Summaries by the Crowd. In 23rd International Conference on World Wide Web (WWW), Demo Track. Seoul, Korea, 511–516.", "Raphaël Troncy. 2008. Bringing the IPTC News Architecture into the Semantic Web. In 7th International Semantic Web Conference (ISWC). Karlsruhe, Germany, 483–498.", "Willem Robert van Hage, Véronique Malaisé, Roxane Segers, Laura Hollink, and Guus Schreiber. 2011. Design and use of the Simple Event Model (SEM). Journal of Web Semantics 9, 2 (2011), 128–136.", "Denny Vrandečić and Markus Krötzsch. 2014. Wikidata: A Free Collaborative Knowledgebase. Commun. ACM 57, 10 (2014), 78–85."]}, {"title": "Enabling Automatic Discovery and Querying of Web APIs at Web Scale using Linked Data Standards", "authors": ["Franck Michel\n,", "Catherine Faron-Zucker\n,", "Olivier Corby\n,", "Fabien Gandon"], "publication": "WWW '19: Companion Proceedings of The 2019 World Wide Web Conference", "abstract": "ABSTRACT\nTo help in making sense of the ever-increasing number of data sources available on the Web, in this article we tackle the problem of enabling automatic discovery and querying of data sources at Web scale. To pursue this goal, we suggest to (1) provision rich descriptions of data sources and query services thereof, (2) leverage the power of Web search engines to discover data sources, and (3) rely on simple, well-adopted standards that come with extensive tooling. We apply these principles to the concrete case of SPARQL micro-services that aim at querying Web APIs using SPARQL. The proposed solution leverages SPARQL Service Description, SHACL, DCAT, VoID, Schema.org and Hydra to express a rich functional description that allows a software agent to decide whether a micro-service can help in carrying out a certain task. This description can be dynamically transformed into a Web page embedding rich markup data. This Web page is both a human-friendly documentation and a machine-readable description that makes it possible for humans and machines alike to discover and invoke SPARQL micro-services at Web scale, as if they were just another data source. We report on a prototype implementation that is available on-line for test purposes, and that can be effectively discovered using Google’s Dataset Search engine.", "references": ["Keith Alexander, Richard Cyganiak, Michael Hausenblas, and Jun Zhao. 2011. Describing Linked Datasets with the VoID Vocabulary. W3C Recommendation (2011).", "Mohamed Ben Ellefi, Zohra Bellahsene, John G. Breslin, Elena Demidova, Stefan Dietze, Julian Szymański, and Konstantin Todorov. 2018. RDF Dataset Profiling – a Survey of Features, Methods, Vocabularies and Applications. Semantic Web – Interoperability, Usability, Applicability 9, 5(2018), 677–705.", "Tim Berners-Lee and Dan Connolly. 2011. Notation3 (N3): A Readable RDF Syntax. W3C Team Submission (March 2011).", "Mark Burstein, Jerry Hobbs, Ora Lassila, Drew McDermott, Sheila McIlraith, Srini Narayanan, Massimo Paolucci, Bijan Parsia, Terry Payne, Evren Sirin, Naveen Srinivasan, and Katia Sycara. 2004. OWL-S: Semantic Markup for Web Services. W3C Member Submission(2004).", "Olivier Corby and Catherine Faron-Zucker. 2015. STTL: A SPARQL-Based Transformation Language for RDF. In 11th International Conference on Web Information Systems and Technologies (ISWC). Lison, Portugal.", "Olivier Corby, Catherine Faron-Zucker, and Fabien Gandon. 2017. LDScript: A Linked Data Script Language. In Proceedings of the 16th International Semantic Web Conference (ISWC). Springer, Vienna, Austria, 208–224.", "Olivier Corby and Catherine Faron Faron-Zucker. 2010. The KGRAM Abstract Machine for Knowledge Graph Querying. In Proceedings of the International Conference on Web Intelligence and Intelligent Agent Technology (WI-IAT). IEEE, 338–341.", "Joel Farrell and Holger Lausen (Eds.). 2007. Semantic Annotations for WSDL and XML Schema. W3C Recommendation (2007).", "Florian Fischer and Barry Norton. 2009. MicroWSMO v2 – Defining the Second Version of MicroWSMO as a Systematic Approach for Rich Tagging. Technical Report.", "Karthik Gomadam, Ajith Ranabahu, and Amit Sheth. 2010. SA-REST: Semantic Annotation of Web Resources. W3C Member Submission(2010).", "Alejandra Gonzalez Beltran, Dave Browning, Simon Cox, and Peter Winstanley. 2019. Data Catalog Vocabulary (DCAT) - revised edition. W3C Editor’s Draft 01 February 2019(2019). https://w3c.github.io/dxwg/dcat/Accessed: 2019-02-01.", "R. V. Guha, Dan Brickley, and Steve MacBeth. 2015. Schema.Org: Evolution of Structured Data on the Web. ACM Queue - Strutured Data 13, 9 (2015), 10:10–10:37.", "Marc Hadley. 2009. Web Application Description Language. W3C Member Submission(2009).", "Steve Harris and Andy Seaborne. 2013. SPARQL 1.1 Query Language. W3C Recommendation (2013). http://www.w3.org/TR/2013/REC-sparql11-query-20130321/", "Holger Knublauch. 2013. SPIN - SPARQL Syntax. W3C Member Submission(2013).", "Holger Knublauch and Dimitris Kontokostas (Eds.). 2017. Shapes Constraint Language (SHACL). W3C Recommendation (2017).", "Jacek Kopecky, Karthik Gomadam, and Tomas Vitvar. 2008. hRESTS: An HTML Microformat for Describing RESTful Web Services. In Proceedings of the IEEE/WIC/ACM International Conference on Web Intelligence (WI-IAT). 619–625.", "Markus Lanthaler and Christian Gütl. 2011. A Semantic Description Language for RESTful Data Services to Combat Semaphobia. In Proceedings of the IEEE International Conference on Digital Ecosystems and Technologies. 47–53.", "Markus Lanthaler and Christian Gütl. 2013. Hydra: A Vocabulary for Hypermedia-Driven Web APIs. In Proceedings of the 6th Workshop on Linked Data on the Web (LDOW2013). CEUR-WS.", "Moussa Lo and Fabien Gandon. 2007. Semantic Web Services in Corporate Memories. In Proceedings of the Second International Conference on Internet and Web Applications and Services.", "Fadi Maali, John Erickson, and Phil Archer. 2014. Data Catalog Vocabulary (DCAT). W3C Recommendation (Jan. 2014).", "Franck Michel, Catherine Faron-Zucker, and Fabien Gandon. 2018. SPARQL Micro-Services: Lightweight Integration of Web APIs and Linked Data. In Proceedings of the Linked Data on the Web Workshop (LDOW2018), Vol. 2073. CEUR, Lyon, France, 10.", "Franck Michel, Catherine Zucker, Olivier Gargominy, and Fabien Gandon. 2018. Integration of Web APIs and Linked Data Using SPARQL Micro-Services—Application to Biodiversity Use Cases. Information 9, 12 (Dec. 2018), 310.", "Sam Newman. 2015. Building Microservices. O’Reilly Media.", "Cesare Pautasso, Olaf Zimmermann, and Frank Leymann. 2008. RESTful Web Services vs. “Big” Web Services: Making the Right Architectural Decision. In Proceedings of the 17th International World Wide Web Conference (WWW2008). Beijnig, China, 805–814.", "Emmanuel Pietriga, Hande Gözükan, Caroline Appert, Marie Destandau, Šejla Čebirić, François Goasdoué, and Ioana Manolescu. 2018. Browsing Linked Data Catalogs with LODAtlas. In Proceedings of the 17th International Semantic Web Conference (ISWC). Monterey, USA, 17.", "Mike Ralphson and Ivan Goncharov. 2017. WADG0001 WebAPI type extension. Draft Community Group Report(2017). https://webapi-discovery.github.io/rfcs/rfc0001.html", "Andy Seaborne. 2013. SPARQL 1.1 Query Results JSON Format. W3C Recommendation (2013).", "Diego Serrano, Eleni Stroulia, Diana Lau, and Tinny Ng. 2017. Linked REST APIs: A Middleware for Semantic REST API Integration. In Proceedings of the IEEE International Conference on Web Services (ICWS). IEEE, Honolulu, HI, USA, 138–145.", "Manu Sporny, Dave Longly, Gregg Kellog, Markus Lanthaler, and Niklas Lindström. 2014. JSON-LD 1.0. A JSON-based Serialization for Linked Data. W3C Recommendation (2014). https://www.w3.org/TR/2014/REC-json-ld-20140116/", "Pierre-Yves Vandenbussche, Jürgen Umbrich, Luca Matteis, Aidan Hogan, and Carlos Buil-Aranda. 2017. SPARQLES: Monitoring Public SPARQL Endpoints. Semantic Web 8, 6 (Aug. 2017), 1049–1065.", "Ruben Verborgh, Thomas Steiner, Davy Van Deursen, Jos De Roo, Rik Van de Walle, and Joaquim Gabarro Vallés. 2011. Description and Interaction of RESTful Services for Automatic Discovery and Execution. In Proceedings of the International Workshop on Advanced Future Multimedia Services. Future Technology Research Association International (FTRA), Jeju, South Korea.", "Gregory Tood Williams (Ed.). 2013. SPARQL 1.1 Service Description. W3C Recommendation (2013).", "Semih Yumusak, Erdogan Dogdu, Halife Kodaz, Andreas Kamilaris, and Pierre-Yves Vandenbussche. 2017. SpEnD: Linked Data SPARQL Endpoints Discovery Using Search Engines. IEICE Transactions on Information and Systems E100.D, 4(2017), 758–767."]}, {"title": "WWW’19 Tutorial on Explainable Recommendation and Search", "authors": ["Yongfeng Zhang\n,", "Jiaxin Mao\n,", "Qingyao Ai"], "publication": "WWW '19: Companion Proceedings of The 2019 World Wide Web Conference", "abstract": "ABSTRACT\nExplainable recommendation and search attempt to develop models or methods that not only generate high-quality recommendation or search results, but also intuitive explanations of the results for users or system designers, where the explanations can be either post-hoc or directly come from an explainable model. Explainable recommendation and search can help to improve the system transparency, persuasiveness, trustworthiness, and effectiveness. This is even more important in personalized search and recommendation scenarios, where users would like to know why a particular product, web page, news report, or friend suggestion exists in his or her own search and recommendation lists. The tutorial focuses on the research and application of explainable recommendation and search algorithms, as well as their application in real-world systems such as search engine, e-commerce and social networks. The tutorial aims at introducing and communicating explainable recommendation and search methods to the community, as well as gathering researchers and practitioners interested in this research direction for discussions, idea communications, and research promotions.", "references": ["Qingyao Ai, Vahid Azizi, 2018. Learning heterogeneous knowledge base embeddings for explainable recommendation. Algorithms 11, 9 (2018), 137.", "Xu Chen, Yongfeng Zhang, and Zheng Qin. 2019. Dynamic Explainable Recommendation based on Neural Attentive Models. AAAI (2019).", "David Gunning. 2017. Explainable artificial intelligence (xai). Defense Advanced Research Projects Agency (DARPA), nd Web (2017).", "Julian McAuley and Jure Leskovec. 2013. Hidden factors and hidden topics: understanding rating dimensions with review text. In RecSys. 165–172.", "Jaspreet Singh and Avishek Anand. 2019. EXS: Explainable Search Using Local Model Agnostic Interpretability. In WSDM. 770–773.", "Xiting Wang, Yiru Chen, Jie Yang, Le Wu, Zhengtao Wu, and Xing Xie. 2018. A Reinforcement Learning Framework for Explainable Recommendation. In 2018 IEEE International Conference on Data Mining (ICDM). IEEE, 587–596.", "Xiang Wang, Xiangnan He, Fuli Feng, Liqiang Nie, and Tat-Seng Chua. 2018. Tem: Tree-enhanced embedding model for explainable recommendation. In WWW.", "Yongfeng Zhang and Xu Chen. 2018. Explainable recommendation: A survey and new perspectives. arXiv preprint arXiv:1804.11192(2018).", "Yongfeng Zhang, Guokun Lai, Min Zhang, Yi Zhang, Yiqun Liu, and Shaoping Ma. 2014. Explicit factor models for explainable recommendation based on phrase-level sentiment analysis. In SIGIR. 83–92.", "Yongfeng Zhang, Yi Zhang, and Min Zhang. 2018. SIGIR 2018 Workshop on ExplainAble Recommendation and Search (EARS 2018). In SIGIR.", "Yongfeng Zhang, Yi Zhang, and Min Zhang. 2019. Report on EARS’18: 1st International Workshop on ExplainAble Recommendation and Search. In ACM SIGIR Forum, Vol. 52. ACM, 125–131."]}, {"title": "CPR for SSDs", "authors": ["Bryan S. Kim\n,", "Eunji Lee\n,", "Sungjin Lee\n,", "Sang Lyul Min"], "publication": "HotOS '19: Proceedings of the Workshop on Hot Topics in Operating Systems", "abstract": "ABSTRACT\nModern storage systems are built upon the assumption that the capacity of a storage device does not change. This capacity-invariant interface forces a flash-based storage device to trade performance for reliability when, in fact, it can maintain both if a graceful reduction in capacity were to be allowed. We argue that relaxing the fixed capacity abstraction of the storage device allows for a better capacity-performance-reliability (CPR) tradeoff. We then outline existing device-internal mechanisms for building a capacity-variant flash device, and describe the necessary changes in the storage stack.", "references": ["2012. SMART Storage Systems XceedIOPS2 200GB eMLC Enterprise SSD Review. http://www.thessdreview.com/. The SSD Review.", "2014. ONFI 4.0. http://www.onfi.org/specifications/. Open NAND Flash Interface Specification 4.0.", "2015. SSD Endurance. What Does It Mean To You? https://itpeernetwork.intel.com/ssd-endurance-what-does-it-mean-to-you/. Intel.", "2017. Comparing Wear Figures on SSDs. https://thessdguy.com/comparing-wear-figures-on-ssds/. The SSD Guy.", "2017. Solving Latency Challenges with NVM Express SSDs at Scale. https://www.flashmemorysummit.com/English/Collaterals/Proceedings/2017/20170809_SIT6_Petersen.pdf. Flash Memory Summit.", "2018. Dell Solid State Drive FAQ with Servers and Storage. https://www.dell.com/support/article/sln156240/. Dell.", "Remzi H. Arpaci-Dusseau and Andrea C. Arpaci-Dusseau. 2001. Fail-Stutter Fault Tolerance. In Proceedings of HotOS-VIII: 8th Workshop on Hot Topics in Operating Systems, May 20-23, 2001, Elmau/Oberbayern, Germany. 33--38.", "Mahesh Balakrishnan, Asim Kadav, Vijayan Prabhakaran, and Dahlia Malkhi. 2010. Differential RAID: Rethinking RAID for SSD Reliability. In European Conference on Computer Systems, Proceedings of the 5th European conference on Computer systems, EuroSys 2010, Paris, France, April 13-16, 2010. 15--26.", "Yu Cai, Saugata Ghose, Erich F. Haratsch, Yixin Luo, and Onur Mutlu. 2017. Error Characterization, Mitigation, and Recovery in Flash-Memory-Based Solid-State Drives. Proc. IEEE 105, 9 (2017), 1666--1704.", "Yu Cai, Erich F. Haratsch, Onur Mutlu, and Ken Mai. 2013. Threshold voltage distribution in MLC NAND flash memory: characterization, analysis, and modeling. In Design, Automation and Test in Europe, DATE 13, Grenoble, France, March 18-22, 2013. 1285--1290.", "Yu Cai, Yixin Luo, Saugata Ghose, and Onur Mutlu. 2015. Read Disturb Errors in MLC NAND Flash Memory: Characterization, Mitigation, and Recovery. In 45th Annual IEEE/IFIP International Conference on Dependable Systems and Networks, DSN 2015, Rio de Janeiro, Brazil, June 22-25, 2015. 438--449.", "Yu Cai, Yixin Luo, Erich F. Haratsch, Ken Mai, and Onur Mutlu. 2015. Data retention in MLC NAND flash memory: Characterization, optimization, and recovery. In 21st IEEE International Symposium on High Performance Computer Architecture, HPCA 2015, Burlingame, CA, USA, February 7-11, 2015. 551--563.", "Yu Cai, Gulay Yalcin, Onur Mutlu, Erich F. Haratsch, Adrián Cristal, Osman S. Ünsal, and Ken Mai. 2012. Flash correct-and-refresh: Retention-aware error management for increased flash memory lifetime. In 30th International IEEE Conference on Computer Design, ICCD 2012, Montreal, QC, Canada, September 30-Oct. 3, 2012. 94--101.", "Li-Pin Chang. 2007. On efficient wear leveling for large-scale flash-memory storage systems. In Proceedings of the 2007 ACM Symposium on Applied Computing (SAC), Seoul, Korea, March 11-15, 2007. 1126--1130.", "Feng Chen, Tian Luo, and Xiaodong Zhang. 2011. CAFTL: A Content-Aware Flash Translation Layer Enhancing the Lifespan of Flash Memory based Solid State Drives. In 9th USENIX Conference on File and Storage Technologies, San Jose, CA, USA, February 15-17, 2011. 77--90.", "Timothy E. Denehy, Andrea C. Arpaci-Dusseau, and Remzi H. Arpaci-Dusseau. 2002. Bridging the Information Gap in Storage Protocol Stacks. In Proceedings of the General Track: 2002 USENIX Annual Technical Conference, June 10-15, 2002, Monterey, California, USA. 177--190.", "Peter Desnoyers. 2012. Analytic modeling of SSD write performance. In The 5th Annual International Systems and Storage Conference, SYSTOR '12, Haifa, Israel, June 4-6, 2012. 14.", "Robert G. Gallager. 1962. Low-density parity-check codes. IRE Trans. Information Theory 8, 1 (1962), 21--28.", "Haryadi S. Gunawi, Riza O. Suminto, Russell Sears, Casey Golliher, Swaminathan Sundararaman, Xing Lin, Tim Emami, Weiguang Sheng, Nematollah Bidokhti, Caitie McCaffrey, Gary Grider, Parks M. Fields, Kevin Harms, Robert B. Ross, Andree Jacobson, Robert Ricci, Kirk Webb, Peter Alvaro, H. Birali Runesha, Mingzhe Hao, and Huaicheng Li. 2018. Fail-Slow at Scale: Evidence of Hardware Performance Faults in Large Production Systems. In 16th USENIX Conference on File and Storage Technologies, FAST 2018, Oakland, CA, USA, February 12-15, 2018. 1--14.", "Aayush Gupta, Raghav Pisolkar, Bhuvan Urgaonkar, and Anand Sivasubramaniam. 2011. Leveraging Value Locality in Optimizing NAND Flash-based SSDs. In 9th USENIX Conference on File and Storage Technologies, San Jose, CA, USA, February 15-17, 2011. 91--103.", "Keonsoo Ha, Jaeyong Jeong, and Jihong Kim. 2016. An Integrated Approach for Managing Read Disturbs in High-Density NAND Flash Memory. IEEE Trans. on CAD of Integrated Circuits and Systems 35, 7 (2016), 1079--1091.", "Mingzhe Hao, Gokul Soundararajan, Deepak R. Kenchammana-Hosekote, Andrew A. Chien, and Haryadi S. Gunawi. 2016. The Tail at Store: A Revelation from Millions of Hours of Disk and SSD Deployments. In 14th USENIX Conference on File and Storage Technologies, FAST 2016, Santa Clara, CA, USA, February 22-25, 2016. 263--276.", "Jun He, Duy Nguyen, Andrea C. Arpaci-Dusseau, and Remzi H. Arpaci-Dusseau. 2015. Reducing File System Tail Latencies with Chopper. In Proceedings of the 13th USENIX Conference on File and Storage Technologies, FAST 2015, Santa Clara, CA, USA, February 16-19, 2015. 119--133.", "Xiao-Yu Hu, Evangelos Eleftheriou, Robert Haas, Ilias Iliadis, and Roman Pletka. 2009. Write amplification analysis in flash-based solid state drives. In Proceedings of of SYSTOR 2009: The Israeli Experimental Systems Conference 2009, Haifa, Israel, May 4-6, 2009. 10.", "Soojun Im and Dongkun Shin. 2011. Flash-Aware RAID Techniques for Dependable and High-Performance Flash Memory SSD. IEEE Trans. Computers 60, 1 (2011), 80--92.", "Jaeyong Jeong, Sangwook Shane Hahn, Sungjin Lee, and Jihong Kim. 2014. Lifetime improvement of NAND flash-based storage systems using dynamic program and erase scaling. In Proceedings of the 12th USENIX conference on File and Storage Technologies, FAST 2014, Santa Clara, CA, USA, February 17-20, 2014. 61--74.", "Nikolaus Jeremic, Gero Mühl, Anselm Busse, and Jan Richling. 2011. The Pitfalls of Deploying Solid-State Drive RAIDs. In Proceedings of of SYSTOR 2011: The 4th Annual Haifa Experimental Systems Conference, Haifa, Israel, May 30-June 1, 2011. 14.", "Bryan S. Kim. 2018. Utilitarian Performance Isolation in Shared SSDs. In 10th USENIX Workshop on Hot Topics in Storage and File Systems, HotStorage 2018, Boston, MA, USA, July 9-10, 2018.", "Bryan S. Kim, Jongmoo Choi, and Sang Lyul Min. 2019. Design Tradeoffs for SSD Reliability. In 17th USENIX Conference on File and Storage Technologies, FAST 2019, February 25-28, 2019, Boston, MA, USA. 281--294.", "Jonghwa Kim, Choonghyun Lee, Sang Yup Lee, Ikjoon Son, Jongmoo Choi, Sungroh Yoon, Hu-ung Lee, Sooyong Kang, Youjip Won, and Jaehyuk Cha. 2012. Deduplication in SSDs: Model and quantitative analysis. In IEEE 28th Symposium on Mass Storage Systems and Technologies, MSST 2012, April 16-20, 2012, Asilomar Conference Grounds, Pacific Grove, CA, USA. 1--12.", "Jaeho Kim, Donghee Lee, and Sam H. Noh. 2015. Towards SLO Complying SSDs Through OPS Isolation. In Proceedings of the 13th USENIX Conference on File and Storage Technologies, FAST 2015, Santa Clara, CA, USA, February 16-19, 2015. 183--189.", "Jaeho Kim, Eunjae Lee, Jongmoo Choi, Donghee Lee, and Sam H. Noh. 2016. Chip-Level RAID with Flexible Stripe Size and Parity Placement for Enhanced SSD Reliability. IEEE Trans. Computers 65, 4 (2016), 1116--1130.", "Elie Krevat, Joseph Tucek, and Gregory R. Ganger. 2011. Disks Are Like Snowflakes: No Two Are Alike. In 13th Workshop on Hot Topics in Operating Systems, HotOS XIII, Napa, California, USA, May 9-11, 2011.", "Sungjin Lee, Keonsoo Ha, Kangwon Zhang, Jihong Kim, and Junghwan Kim. 2009. FlexFS: A Flexible Flash File System for MLC NAND Flash Memory. In 2009 USENIX Annual Technical Conference, San Diego, CA, USA, June 14-19, 2009.", "Sungjin Lee, Taejin Kim, Kyungho Kim, and Jihong Kim. 2012. Lifetime management of flash-based SSDs using recovery-aware dynamic throttling. In Proceedings of the 10th USENIX conference on File and Storage Technologies, FAST 2012, San Jose, CA, USA, February 14-17, 2012. 26.", "Sehwan Lee, Bitna Lee, Kern Koh, and Hyokyung Bahn. 2011. A lifespan-aware reliability scheme for RAID-based flash storage. In 2011 ACM Symposium on Applied Computing (SAC), TaiChung, Taiwan, March 21-24, 2011. 374--379.", "Sungjin Lee, Jihoon Park, Kermin Fleming, Arvind, and Jihong Kim. 2011. Improving performance and lifetime of solid-state drives using hardware-accelerated compression. IEEE Trans. Consumer Electronics 57, 4 (2011), 1732--1739.", "Yangsup Lee, Sanghyuk Jung, and Yong Ho Song. 2009. FRA: a flash-aware redundancy array of flash storage devices. In 7th International Conference on Hardware/Software Codesign and System Synthesis, CODES+ISSS 2009, Grenoble, France, October 11-16, 2009. 163--172.", "Shu Lin and Daniel J Costello. 2004. Error Control Coding. Prentice-Hall, Inc.", "Ren-Shuo Liu, Chia-Lin Yang, and Wei Wu. 2012. Optimizing NAND flash-based SSDs via retention relaxation. In Proceedings of the 10th USENIX conference on File and Storage Technologies, FAST 2012, San Jose, CA, USA, February 14-17, 2012. 11.", "Yixin Luo, Saugata Ghose, Yu Cai, Erich F. Haratsch, and Onur Mutlu. 2018. HeatWatch: Improving 3D NAND Flash Memory Device Reliability by Exploiting Self-Recovery and Temperature Awareness. In IEEE International Symposium on High Performance Computer Architecture, HPCA 2018, Vienna, Austria, February 24-28, 2018. 504--517.", "Ao Ma, Fred Douglis, Guanlin Lu, Darren Sawyer, Surendar Chandra, and Windsor W. Hsu. 2015. RAIDShield: Characterizing, Monitoring, and Proactively Protecting Against Disk Failures. In Proceedings of the 13th USENIX Conference on File and Storage Technologies, FAST 2015, Santa Clara, CA, USA, February 16-19, 2015. 241--256.", "Justin Meza, Qiang Wu, Sanjeev Kumar, and Onur Mutlu. 2015. A Large-Scale Study of Flash Memory Failures in the Field. In 2015 ACM SIGMETRICS International Conference on Measurement and Modeling of Computer Systems, Portland, OR, USA, June 15-19, 2015. 177--190.", "Neal Mielke, Hanmant P. Belgal, Albert Fazio, Qingru Meng, and Nick Righos. 2006. Recovery Effects in the Distributed Cycling of Flash Memories. In 44th IEEE International Reliability Physics Symposium, IRPS'06 San Jose, CA, USA, March 26-30, 2006.", "Neal R. Mielke, Robert E. Frickey, Ivan Kalastirsky, Minyan Quan, Dmitry Ustinov, and Venkatesh J. Vasudevan. 2017. Reliability of Solid-State Drives Based on NAND Flash Memory. Proc. IEEE 105, 9 (2017), 1725--1750.", "Sangwhan Moon and A. L. Narasimha Reddy. 2016. Does RAID Improve Lifetime of SSD Arrays? TOS 12, 3 (2016), 11:1--11:29.", "Iyswarya Narayanan, Di Wang, Myeongjae Jeon, Bikash Sharma, Laura Caulfield, Anand Sivasubramaniam, Ben Cutler, Jie Liu, Badriddine M. Khessib, and Kushagra Vaid. 2016. SSD Failures in Datacenters: What? When? and Why?. In 9th ACM International on Systems and Storage Conference, SYSTOR 2016, Haifa, Israel, June 6-8, 2016. 7:1--7:11.", "Yongseok Oh, Jongmoo Choi, Donghee Lee, and Sam H. Noh. 2012. Caching less for better performance: balancing cache size and update cost of flash memory cache in hybrid storage systems. In Proceedings of the 10th USENIX conference on File and Storage Technologies, FAST 2012, San Jose, CA, USA, February 14-17, 2012. 25.", "Heejin Park, Jaeho Kim, Jongmoo Choi, Donghee Lee, and Sam H. Noh. 2015. Incremental redundancy to reduce data retention errors in flash-based SSDs. In IEEE 31st Symposium on Mass Storage Systems and Technologies, MSST 2015, Santa Clara, CA, USA, May 30-June 5, 2015. 1--13.", "Youngjo Park and Jin-Soo Kim. 2011. zFTL: power-efficient data compression support for NAND flash-based consumer electronics devices. IEEE Trans. Consumer Electronics 57, 3 (2011), 1148--1156.", "David A. Patterson, Garth A. Gibson, and Randy H. Katz. 1988. A Case for Redundant Arrays of Inexpensive Disks (RAID). In 1988 ACM SIGMOD International Conference on Management of Data, Chicago, Illinois, USA, June 1-3, 1988. 109--116.", "Vijayan Prabhakaran, Lakshmi N. Bairavasundaram, Nitin Agrawal, Haryadi S. Gunawi, Andrea C. Arpaci-Dusseau, and Remzi H. Arpaci-Dusseau. 2005. IRON file systems. In Proceedings of the 20th ACM Symposium on Operating Systems Principles 2005, SOSP 2005, Brighton, UK, October 23-26, 2005. 206--220.", "Adrian Sampson, Jacob Nelson, Karin Strauss, and Luis Ceze. 2013. Approximate storage in solid-state memories. In The 46th Annual IEEE/ACM International Symposium on Microarchitecture, MICRO-46, Davis, CA, USA, December 7-11, 2013. 25--36.", "Fred B. Schneider. 1990. Implementing Fault-Tolerant Services Using the State Machine Approach: A Tutorial. ACM Comput. Surv. 22, 4 (1990), 299--319.", "Bianca Schroeder, Raghav Lagisetty, and Arif Merchant. 2016. Flash Reliability in Production: The Expected and the Unexpected. In 14th USENIX Conference on File and Storage Technologies, FAST 2016, Santa Clara, CA, USA, February 22-25, 2016. 67--80.", "Thomas J. E. Schwarz, Qin Xin, Ethan L. Miller, Darrell D. E. Long, Andy Hospodor, and Spencer W. Ng. 2004. Disk Scrubbing in Large Archival Storage Systems. In 12th International Workshop on Modeling, Analysis, and Simulation of Computer and Telecommunication Systems (MASCOTS 2004), 4-8 October 2004, Vollendam, The Netherlands. 409--418.", "Muthian Sivathanu, Vijayan Prabhakaran, Andrea C. Arpaci-Dusseau, and Remzi H. Arpaci-Dusseau. 2004. Improving Storage System Availability with D-GRAID. In Proceedings of the FAST '04 Conference on File and Storage Technologies, March 31-April 2, 2004, Grand Hyatt Hotel, San Francisco, California, USA. 15--30.", "Xiang Song, Jian Yang, and Haibo Chen. 2014. Architecting Flash-based Solid-State Drive for High-performance I/O Virtualization. Computer Architecture Letters 13, 2 (2014), 61--64.", "Ellis Herbert Wilson, Myoungsoo Jung, and Mahmut T. Kandemir. 2014. ZombieNAND: Resurrecting Dead NAND Flash for Improved SSD Longevity. In IEEE 22nd International Symposium on Modelling, Analysis & Simulation of Computer and Telecommunication Systems, MASCOTS 2014, Paris, France, September 9-11, 2014. 229--238.", "Qi Wu, Guiqiang Dong, and Tong Zhang. 2011. Exploiting Heat-Accelerated Flash Memory Wear-Out Recovery to Enable Self-Healing SSDs. In 3rd USENIX Workshop on Hot Topics in Storage and File Systems, HotStorage '11, Portland, OR, USA, June 14, 2011.", "Ming-Chang Yang, Yuan-Hao Chang, Tei-Wei Kuo, and Fu-Hsin Chen. 2016. Reducing Data Migration Overheads of Flash Wear Leveling in a Progressive Way. IEEE Trans. VLSI Syst. 24, 5 (2016), 1808--1820.", "Aviad Zuck, Sivan Toledo, Dmitry Sotnikov, and Danny Harnik. 2014. Compression and SSDs: Where and How?. In 2nd Workshop on Interactions of NVM/Flash with Operating Systems and Workloads, INFLOW '14, Broomfield, CO, USA, October 5, 2014."]}, {"title": "Evaluating systematic transactional data enrichment and reuse", "authors": ["Jim Hahn"], "publication": "AIDR '19: Proceedings of the Conference on Artificial Intelligence for Data Discovery and Reuse", "abstract": "ABSTRACT\nA library account-based recommender system was developed using machine learning processing over transactional data of 383,828 check-outs sourced from a large multi-unit research library. The machine learning process utilized the FP-growth algorithm [13] over the subject metadata associated with physical items that were checked-out together in the library. The purpose of this paper is to evaluate the results of systematic transactional data reuse in machine learning. The analysis herein contains a large-scale network visualization of 180,441 subject association rules and corresponding node metrics.", "references": ["Mathieu Bastian, Sebastien Heymann, and Mathieu Jacomy. 2009. Gephi: An Open Source Software for Exploring and Manipulating Networks. (2009). http://www.aaai.org/ocs/index.php/ICWSM/09/paper/view/154", "Katy Börner. 2012. Network science: theory, tools, and practice. In Leadership in science and technology: A reference handbook, Vol. 2, W. Bainbridge (Ed.). Sage Publications, Inc., Thousand Oaks, CA, 49--58.", "Katy Börner, Soma Sanyal, and Alessandro Vespignani. 2007. Network science. Annual Review of Information Science and Technology 41, 1 (2007), 537--607.", "Ulrik Brandes. 2001. A faster algorithm for betweenness centrality. The Journal of Mathematical Sociology 25, 2 (2001), 163--177.", "Andrei Broder, Ravi Kumar, Farzin Maghoul, Prabhakar Raghavan, Sridhar Rajagopalan, Raymie Stata, Andrew Tomkins, and Janet Wiener. 2000. Graph Structure in the Web. Comput. Netw. 33, 1-6 (June 2000), 309--320.", "Luca Cagliero, Paolo Garza, Mohammad Reza Kavoosifar, and Elena Baralis. 2018. Discovering cross-topic collaborations among researchers by exploiting weighted association rules. Scientometrics 116, 2 (01 Aug 2018), 1273--1301.", "Samuelle Carlson and Ben Anderson. 2007. What Are Data? The Many Kinds of Data and Their Implications for Data Re-Use. Journal of Computer-Mediated Communication 12, 2 (01 2007), 635--651.", "Virginia Eubanks. 2019. Automating Inequality: how high-tech tools profile, police, and punish the poor. Picador.", "Harriett E. Green, Kirk Hess, and Richard Hislop. 2012. Incorporating circulation data in relevancy rankings for search algorithms in library collections. In 2012 IEEE 8th International Conference on E-Science. 1--6.", "Jim Hahn. 2019. Frequent pattern subject transactions from the University of Illinois Library (2016 - 2018).", "Jim Hahn and Courtney McDonald. 2018. Account-based recommenders in open discovery environments. Digital Library Perspectives 34, 1 (2018), 70--76.", "Mark Hall, Eibe Frank, Geoffrey Holmes, Bernhard Pfahringer, Peter Reutemann, and Ian H. Witten. 2009. The WEKA Data Mining Software: An Update. SIGKDD Explor. Newsl. 11, 1 (Nov. 2009), 10--18.", "Jiawei Han, Jian Pei, Yiwen Yin, and Runying Mao. 2004. Mining frequent patterns without candidate generation: A frequent-pattern tree approach. Data Mining and Knowledge Discovery 8, 1 (1 1 2004), 53--87.", "Amy E. Holder. 2018. Network Science: The Hidden Field behind Machine Learning, Economics and Genetics That You've (Probably) Never Heard of - An Interview with Dr. Aaron Clauset [Part 1]. https://neo4j.com/blog/network-science-hidden-field-dr-aaron-clauset-part-1/. (Accessed on 05/23/2019).", "Kansuke Ikehara and Aaron Clauset. 2017. Characterizing the structural diversity of complex networks across domains. arXiv e-prints (Oct. 2017). arXiv:1710.11304 https://arxiv.org/abs/1710.11304", "Jon M. Kleinberg. 1999. Authoritative Sources in a Hyperlinked Environment. J. ACM 46, 5 (Sept. 1999), 604--632.", "Safiya Umoja Noble. 2018. Algorithms of oppression: data discrimination in the age of Google. New York University Press.", "Cathy O'Neil. 2018. Weapons of math destruction: how big data increases inequality and threatens democracy. Penguin Books.", "Paola Ricaurte. 2019. Data Epistemologies, The Coloniality of Power, and Resistance. Television & New Media 20, 4 (2019), 350--365.", "Cynthia Rudin, Caroline Wang, and Beau Coker. 2018. The age of secrecy and unfairness in recidivism prediction. arXiv preprint arXiv:1811.00731 (2018).", "Elaine Svenonius. 2000. LCSH: Semantics, Syntax and Specificity. Cataloging & Classification Quarterly 29, 1-2 (2000), 17--30.", "Robert Tarjan. 1972. Depth-First Search and Linear Graph Algorithms. SIAM J. Comput. 1, 2 (1972), 146--160.", "Rachel Thomas. 2016. Please Don't Say \"It used to be called big data and now it's called deep learning\" - fast.ai. https://www.fast.ai/2016/11/17/not-all-the-same/.", "Concepción S. Wilson. 1999. Informetrics. Annual Review of Information Science and Technology 43, 1 (1999), 107--247."]}, {"title": "CiteSeerX: 20 years of service to scholarly big data", "authors": ["Jian Wu\n,", "Kunho Kim\n,", "C. Lee Giles"], "publication": "AIDR '19: Proceedings of the Conference on Artificial Intelligence for Data Discovery and Reuse", "abstract": "ABSTRACT\nWe overview CiteSeerX, the pioneer digital library search engine, that has been serving academic communities for more than 20 years (first released in 1998), from three perspectives. The system perspective summarizes its architecture evolution in three phases over the past 20 years. The data perspective describes how CiteSeerX has created searchable scholarly big datasets and made them freely available for multiple purposes. In order to be scalable and effective, AI technologies are employed in all essential modules. To effectively train these models, a sufficient amount of data has been labeled, which can then be reused for training future models. Finally, we discuss the future of CiteSeerX. Our ongoing work is to make CiteSeerX more sustainable. To this end, we are working to ingest all open access scholarly papers, estimated to be 30-40 million. Part of the plan is to discover dataset mentions and metadata in scholarly articles and make them more accessible via search interfaces. Users will have more opportunities to explore and trace datasets that can be reused and discover other datasets for new research projects. We summarize what was learned to make a similar system more sustainable and useful.", "references": ["Rabah A. Al-Zaidy and C. Lee Giles. 2017. A Machine Learning Approach for Semantic Structuring of Scientific Charts in Scholarly Documents (AAAI'17). 4644--4649. http://aaai.org/ocs/index.php/IAAI/IAAI17/paper/view/14275", "Cornelia Caragea, Florin Adrian Bulgarov, Andreea Godea, and Sujatha Das Gollapalli. 2014. Citation-Enhanced Keyphrase Extraction from Research Papers: A Supervised Approach (EMNLP'14). 1435--1446. http://aclweb.org/anthology/D/D14/D14-1150.pdf", "Cornelia Caragea, Jian Wu, Sujatha Das Gollapalli, and C. Lee Giles. 2016. Document Type Classification in Online Digital Libraries (AAAI'16). 3997--4002. http://www.aaai.org/ocs/index.php/IAAI/IAAI16/paper/view/12343", "Christopher Clark and Santosh Kumar Divvala. 2016. PDFFigures 2.0: Mining Figures from Research Papers (JCDL'16). 143--152.", "Isaac Councill, C Lee Giles, and Min-Yen Kan. 2008. ParsCit: an Open-source CRF Reference String Parsing Package (LREC'08).", "I. G. Councill, C. L. Giles, E. Di Iorio, M. Gori, M. Maggini, and A. Pucci. [n.d.]. Towards Next Generation Citeseer: A Flexible Architecture for Digital Library Deployment (ECDL'06). 111--122.", "Martin Ester, Hans-Peter Kriegel, Jörg Sander, and Xiaowei Xu. 2016. A Density-Based Algorithm for Discovering Clusters in Large Spatial Databases with Noise (KDD'96). 226--231. http://www.aaai.org/Library/KDD/1996/kdd96-037.php", "C. Lee Giles, Kurt D. Bollacker, and Steve Lawrence. 1998. CiteSeer: An Automatic Citation Indexing System (JCDL'98). 89--98.", "Hui Han, C. Lee Giles, Eren Manavoglu, Hongyuan Zha, Zhenyue Zhang, and Edward A. Fox. 2003. Automatic document metadata extraction using support vector machines (JCDL '03). 37--48. http://dl.acm.org/citation.cfm?id=827140.827146", "Hui Han, C. Lee Giles, Hongyuan Zha, Cheng Li, and Kostas Tsioutsiouliklis. [n.d.]. Two supervised learning approaches for name disambiguation in author citations (JCDL'04). 296--305.", "Jian Huang, Seyda Ertekin, and C. Lee Giles. 2006. Efficient Name Disambiguation for Large-Scale Databases (PKDD'06). 536--544.", "Madian Khabsa and C. Lee Giles. 2015. Chemical entity extraction using CRF and an ensemble of extractors. Journal of Cheminformatics 7, 1 (2015), S12.", "Madian Khabsa, Pucktada Treeratpituk, and C. Lee Giles. 2015. Online Person Name Disambiguation with Constraints (JCDL'15). 37--46.", "PederOlesen Larsen and Markus von Ins. 2010. The rate of growth in scientific publication and the decline in coverage provided by Science Citation Index. Scientometrics 84, 3 (2010), 575--603.", "Mario Lipinski, Kevin Yao, Corinna Breitinger, Joeran Beel, and Bela Gipp. 2013. Evaluation of Header Metadata Extraction Approaches and Tools for Scientific PDF Documents (JCDL'13). 385--386.", "Ying Liu, Prasenjit Mitra, and C. Lee Giles. 2008. Identifying table boundaries in digital documents via sparse line detection (CIKM'08). 1311--1320.", "Patrice Lopez. 2009. GROBID: Combining Automatic Bibliographic Data Recognition and Term Extraction for Scholarship Publications (ECDL'09). 473--474. http://dl.acm.org/citation.cfm?id=1812799.1812875", "Athar Sefid, Jian Wu, Allen C. Ge, Jing Zhao, Lu Liu, Cornelia Caragea, Prasenjit Mitra, and C. Lee Giles. 2019. Cleansing Noisy and Heterogeneous Metadata for Record Linking Across Scholarly Big Datasets (IAAI'19).", "Yang Song, Jian Huang, Isaac G. Councill, Jia Li, and C. Lee Giles. 2007. Generative models for name disambiguation (WWW'07). 1163--1164.", "Pradeep B. Teregowda, Isaac G. Councill, R. Juan Pablo Fernández, Madian Khabsa, Shuyi Zheng, and C. Lee Giles. 2010. SeerSuite: Developing a Scalable and Reliable Application Framework for Building Digital Libraries by Crawling the Web (WebApps'10). 14--14. http://dl.acm.org/citation.cfm?id=1863166.1863180", "Pucktada Treeratpituk and C. Lee Giles. 2009. Disambiguating authors in academic publications using random forests (JCDL'09). 39--48.", "Suppawong Tuarob, Sumit Bhatia, Prasenjit Mitra, and C. Lee Giles. 2013. Automatic Detection of Pseudocodes in Scholarly Documents Using Machine Learning (ICDAR'13). 738--742.", "Kyle Williams, Jian Wu, Sagnik Ray Choudhury, Madian Khabsa, and C. Lee Giles. [n.d.]. Scholarly big data information extraction and integration in the CiteSeerX digital library (ICDEW'14). 68--73.", "Jian Wu, Sagnik Ray Choudhury, Agnese Chiatti, Chen Liang, and C. Lee Giles. 2017. HESDK: A Hybrid Approach to Extracting Scientific Domain Knowledge Entities (JCDL'17). 241--244.", "Jian Wu, Bharath Kandimalla, Shaurya Rohatgi, Athar Sefid, Jianyu Mao, and C. Lee Giles. 2018. CiteSeerX-2018: A Cleansed Multidisciplinary Scholarly Big Dataset (BigData'18). 5465--5467.", "Jian Wu, Athar Sefid, Allen C. Ge, and C. Lee Giles. 2017. A Supervised Learning Approach To Entity Matching Between Scholarly Big Datasets (K-CAP'17). Article 42, 4 pages.", "Jian Wu, Pradeep B. Teregowda, Kyle Williams, Madian Khabsa, Douglas Jordan, Eric Treece, Zhaohui Wu, and C. Lee Giles. 2014. Migrating a Digital Library to a Private Cloud (IC2E'14).", "Jian Wu, Kyle Williams, Hung-Hsuan Chen, Madian Khabsa, Cornelia Caragea, Alexander Ororbia, Douglas Jordan, and C. Lee Giles. 2014. CiteSeerX: AI in a Digital Library Search Engine (IAAI'14). 2930--2937. http://www.aaai.org/ocs/index.php/IAAI/IAAI14/paper/view/8607", "Baichuan Zhang and Mohammad Al Hasan. 2017. Name Disambiguation in Anonymized Graphs using Network Embedding (CIKM'17). 1239--1248.", "Wei Zhong and Richard Zanibbi. 2019. Structural Similarity Search for Formulas Using Leaf-Root Paths in Operator Subtrees (ECIR'19). 116--129."]}, {"title": "Cross-Modal Entity Resolution Based on Co-Attentional Generative Adversarial Network", "authors": ["Guojun Lv\n,", "Jianjun Cao\n,", "Qibin Zheng\n,", "Chen Chang"], "publication": "ICMSSP 2019: Proceedings of the 2019 4th International Conference on Multimedia Systems and Signal Processing", "abstract": "ABSTRACT\nCross-modal entity resolution aims to find semantically similar items from objects of different modalities(e.g. image and text). The core way to solve the problem is to construct a shared space where multi-modal examples can be represented uniformly. In this paper, we propose a novel Co-Attentional Generative Adversarial Network(CAGAN) method for solving cross-modal entity resolution, which seeks an effective space based on co-attention mechanism and adversarial learning. The generative adversarial network that we design contains two parts, Generator and Discriminator, the generator aims to generate a shared space through intra-modal loss and inter-modal loss, while discriminator is a classifier which tries to discriminate the modalities based on the generated representation. In order to eliminate the imbalance of information between modalities, generate more consistent representation and accelerate the convergence speed of the network, co-attention mechanism is introduced into the network. Experimental results performed on two cross-modal datasets demonstrated the outstanding performance of the proposed method for cross-modal entity resolution.", "references": ["Peng, Y. X., Huang, X., and Zhao, Y. Z. 2017. An overview of crossmedia retrieval: concepts, methodologies, benchmarks and challenges. IEEE Trans. on Circuits and Systems for Video Technology.", "Rasiwasia, N., Pereira, J.C., Coviello, E., Doyle, G., Lanckriet, G., Levy, R., Vasconcelos, N. 2010. A new approach to cross-modal multimedia retrieval. In: Proc. of ACM. Int'l Conf. on Multimedia. Florence, Italy: 251--260.", "Gong, Y., Ke, Q., Isard, M., Lazebnik, S. 2014. A multi-view embedding space for modeling inernet images, tags, and their semantics. Internet Journal of Computer Vision. 106(2): 210--233", "Wang, L., Sun, W., Zhao, Z., and Su, F. 2017. Modeling intra- and inter-pair correlation via heterogeneous high-order preserving for cross-modal retrieval. Signal Processing, 131: 249--260.", "Ou, M., Cui, P., Wang, F., Wang, J., Zhu, W., and Yang, S. 2013. Comparing apples to oranges: a scalable solution with heterogeneous hashing. In: Proc. of ACM. Int'l Conf. on Knowledge Discovery and Data Mining.", "Lin, Z., Ding, G., Han, J., and Wang, J. 2016. Cross-view retrieval via probability-based semantics-preserving hashing. IEEE Trans. on Cybernetics. 47(12): 4342--4355.", "Fan, H., Chen, H.H. 2018. Research progress of cross-modal retrieval based on hash methods. Data Communication. 184(3): 43--49.", "Blei, D.M., Jordan, M.I. 2003. Modeling annotated data. In: Proc. of ACM SIGIR, Int'l Conf. on Research and Development in Informaion Retrieval. ACM, 127--134.", "Putthividhy, D., Attias, H.T., Nagarajan, S.S. 2010. Topic regression multi-modal latent dirichlet allocation for image annotation. In: Proc. of IEEE, Int'l Conf. on Computer Vision and Pattern Recognition. 3408--3415.", "Zheng, Y., Zhang, Y.J., Larochelle, H. 2014. Topic modeling of multimodal data: an autoregressive approach. In: Proc. of IEEE, Int'l Conf. on Computer Vision and Pattern Recognition. 1370--1377.", "Andrew, G., Arora, R., Bilmes, J.A., Livescu, K. 2013. Deep canonical correlation analysis. In: Proc. of ICML, Int'l Conf. on Machine Learning.", "Peng, Y., Huang, X., and Qi, J. 2016. Cross-media shared representation by hierarchical learning with multiple deep networks. Int'l Conf. on artificial intelligence. 3846--3853.", "Wei, Y.C., Zhang, Y., Lu, C.Y., Wei, S.K., Liu, L.Q., Zhu, Z.F., Yan, S.C. 2017. Cross-modal retrieval with CNN visual features: a new baseline. IEEE Trans. on Cybernetics, 47(2): 449--460.", "Wang, B.K., Yang, Y., Xu, X., Hanjalic, A., Shen, H.T. 2017. Adversarial cross-modal retrieval. In: Proc. of 25th ACM. Int'l Conf. on Multimedia. Bucharest Romania.", "Yu, J., Lu, Y.H., Qin, Z.C., Liu, Y.B., Tan, J.L., Guo, L., Zhang, W.F. 2018. Modeling text with graph convolutional network for cross-modal information retrieval. Advances in Multimedia Information Processing: PCM.", "Goodfellow, I.J., Pouget-Abadie, J., Mirza, M., Xu, B., Warde-Farley, D., Ozair, S., Courville, A., Bengio, Y. 2014. Generative Adversarial Nets. Int'l Conf. on Neural Information Processing Systems MIT Press.", "Hu, L., Kan M., Shan, S., Chen, X. 2018. Duplex Generative Adversarial Network for Unsupervised Domain Adaptation. IEEE/CVF Conference on Computer Vision and Pattern Recognition.", "Lu, Y., Yu, J., Liu, Y., Tan, J., Guo, L., Zhang, W. 2018. Fine-Grained Correlation Learning with Stacked Co-attention Networks for Cross-Modal Information Retrieval. Lecture Notes in Computer Science, 213--225.", "Peng, Y., Qi, J., and Yuan, Y. 2018. Modality-specific Cross-modal Similarity Measurement with Recurrent Attention Network. IEEE Trans. on Image Processing. 1--1.", "Wang, S., Chen, Y., Zhuo, J., Huang, Q., Tian, Q. 2018. Joint Global and Co-Attentive Representation Learning for Image-Sentence Retrieval. In: Proc. of ACM. Int'l Conf. on Multimedia. Seoul, Korea, October, 22--26.", "Kim, Y. 2014. Convolutional neural networks for sentence classification. ArXiv preprint arXiv:1408.5885.", "Zhai, X., Peng, Y., and Xiao, J. 2012. Cross-modality correlation propagation for cross-media retrieval. In: Proc. of IEEE. Int'l Conf. on Acoustics, Speech and Signal Processing (ICASSP), 2337--2340.", "Zhai, X., Peng, Y., and Xiao, J. 2014. Learning cross-media joint representation with sparse and semisupervised regularization. IEEE Trans. on Circuits and Systems for Video Technology. 24: 965--978.", "Zhai, X., Peng, Y., and Xiao, J. 2012. Effective heterogeneous similarity measure with nearest neighbors for cross-media retrieval. Int'l Conf. on MultiMedia Modeling (MMM), 313--322.", "Kingma, D., Ba, J. 2014. Adam: a method for stochastic optimization. Computer Science."]}, {"title": "An Index with Caching Mechanism for Real-time Processing System", "authors": ["Shiming Sun\n,", "Yuanhe Tang\n,", "Fu zhou"], "publication": "ICBDC 2019: Proceedings of the 2019 4th International Conference on Big Data and Computing", "abstract": "ABSTRACT\nReal-time processing mode is becoming a mainstream technology in many domains. For example, real-time monitoring system can effectively improve the power engineering or the efficiency of the transport sector. On behalf of a data structure to accelerate retrieval, indexing plays a vital role in data processing. That is because a well-designed index can reduce the time complexity of retrieval from O(n) to O(log n) or even O(1). Generally speaking, index, such as B-tree and R-tree, are designed for the speed of data retrieval rather than data update. To keep the real-time data, a large number of data updating tasks need to be performed in real-time processing system. However, the update speed of these indexes cannot meet the requirement of real-time processing system. In this paper, we present a caching mechanism before the updates of the index. In particular, we change the mode of index's update from one-by-one to batch operation by maintaining an inserting cache and a deleting cache. Our experiments show that this caching mechanism can effectively improve the index update speed by using the data of power grid system, while it has little impact on the speed of index retrieval.", "references": ["J. K. Uhlmann. Satisfying general proximity/similarity queries with metric trees. Inf. Process. Lett., 1991.", "P. N. Yianilos. Data structures and algorithms for nearest neighbor search in general metric spaces. In SODA, 1993.", "P. Ciaccia, M. Patella, and P. Zezula. M-tree: An efficient access method for similarity search in metric spaces. In VLDB, pages 426--435, 1997.", "T. Bozkaya and Z. M. Özsoyoglu. Indexing large metric spaces for similarity search queries. TODS, 24(3):361--404, 1999.", "S. T. Leutenegger, M. Lopez, J. Edgington, et al. Str: A simple and efficient algorithm for r-tree packing. In ICDE, pages 497--506, 1997.", "A. Guttman. R-trees: A dynamic index structure for spatial searching. In SIGMOD, pages 47--57, 1984", "Tao Y, Papadias D. Efficient historical R-trees. In?Proc, of the 13th Int'l Conf. on Scientific and Statistical Database Management (SSDBM 2001). IEEE, 2001. 223--232.", "Nascimento MA, Silva JRO. Towards historical R-trees?In?Proc. Of the '98 ACM Symp. on Applied Computing. ACM Press, 1998. 235--240.", "Theodorakis Y, Vazirgiannis M, Sellis T. Spatio-Temporal indexing for large multimedia applications. On Multimedia Computing and Systems. IEEE, 1996. 441--448.", "Guttman A. R-Trees: A dynamic index structure for spatial searching. ACM SIGMOD Record, 1984, 14(2): 47--57.", "Zhu Q' Gong J, Zhang Y. An efficient 3D R-tree spatial index method for virtual geographic environments. ISPRS Journal of Photogrammetry & Remote Sensing, 2007, 62(3): 217--224"]}, {"title": "Knowledge Graph based Learning Guidance for Cybersecurity Hands-on Labs", "authors": ["Yuli Deng\n,", "Duo Lu\n,", "Dijiang Huang\n,", "Chun-Jen Chung\n,", "Fanjie Lin"], "publication": "CompEd '19: Proceedings of the ACM Conference on Global Computing Education", "abstract": "ABSTRACT\nHands-on practice is a critical component of cybersecurity education. Most of the existing hands-on exercises or labs materials are usually managed in a problem-centric fashion, while it lacks a coherent way to manage existing labs and provide productive lab exercising plans for cybersecurity learners. With the advantages of big data and natural language processing (NLP) technologies, constructing a large knowledge graph and mining concepts from unstructured text becomes possible, which motivated us to construct a machine learning based lab exercising plan for cybersecurity education. In the research presented by this paper, we have constructed a knowledge graph in the cybersecurity domain using NLP technologies including machine learning based word embedding and hyperlink-based concept mining. We then utilized the knowledge graph during the regular learning process based on the following approaches: 1. We constructed a web-based front-end to visualize the knowledge graph, which allows students to browse and search cybersecurity-related concepts and the corresponding interdependence relations; 2. We created a personalized knowledge graph for each student based on their learning progress and status; 3. We built a personalized lab recommendation system by suggesting more relevant labs based on students' past learning history to maximize their learning outcomes. To measure the effectiveness of the proposed solution, we have conducted a use case study and collected survey data from a graduate-level cybersecurity class. Our study shows that, by leveraging the knowledge graph for the cybersecurity area study, students tend to benefit more and show more interests in cybersecurity area.", "references": ["ACM. 2017. Cybersecurity Curricular Guidelines. https://cybered.hosting.acm.org/wp/", "Yuli Deng, Dijiang Huang, and Chun-Jen Chung. 2017. ThoTh Lab: A Personalized Learning Framework for CS Hands-on Projects. In Proceedings of the 2017 ACM SIGCSE Technical Symposium on Computer Science Education. ACM, 706--706.", "Yuli Deng, Duo Lu, Chun-Jen Cheng, Dijiang Huang, and Zhen Zeng. 2018. Personalized Learning in a Virtual Hands-on Lab Platform for Computer Science Education. In 2018 IEEE Frontiers in Education Conference (FIE) .", "Wikimedia Foundation. 2018. Wikimedia Downloads. https://dumps.wikimedia.org/", "Evgeniy Gabrilovich. 2002. The WordSimilarity-353 Test Collection. http://www.cs.technion.ac.il/ gabr/resources/data/wordsim353/", "Gregory Grefenstette and Lawrence Muchemi. 2016. Determining the Characteristic Vocabulary for a Specialized Dictionary using Word2vec and a Directed Crawler. arXiv preprint arXiv:1605.09564 (2016).", "Farzaneh Mahdisoltani, Joanna Biega, and Fabian M Suchanek. 2013. Yago3: A knowledge base from multilingual wikipedias. In CIDR .", "Tomas Mikolov, Kai Chen, Greg Corrado, and Jeffrey Dean. 2013a. Efficient estimation of word representations in vector space. arXiv preprint arXiv:1301.3781 (2013).", "Tomas Mikolov, Ilya Sutskever, Kai Chen, Greg S Corrado, and Jeff Dean. 2013b. Distributed representations of words and phrases and their compositionality. In Advances in neural information processing systems. 3111--3119.", "George A. Miller. 1995. WordNet: A Lexical Database for English. Commun. ACM, Vol. 38, 11 (Nov. 1995), 39--41.", "David Milne and Ian H Witten. 2008. Learning to link with wikipedia. In Proceedings of the 17th ACM conference on Information and knowledge management. ACM, 509--518.", "Maximilian Nickel, Kevin Murphy, Volker Tresp, and Evgeniy Gabrilovich. 2016. A review of relational machine learning for knowledge graphs. Proc. IEEE, Vol. 104, 1 (2016), 11--33.", "NIETP. 2018. CAE REQUIREMENTS AND RESOURCES. https://www.iad.gov/NIETP/CAERequirements.cfm", "NIST. 2018. NICE Cybersecurity Workforce Framework. https://www.nist.gov/itl/applied-cybersecurity/nice/", "F Nyffenegger. 2009. WikiMindMap.", "Leo Obrst, Penny Chase, and Richard Markeloff. 2012. Developing an Ontology of the Cyber Security Domain. In STIDS .", "Herbert Rubenstein and John B. Goodenough. 1965. Contextual Correlates of Synonymy. Commun. ACM, Vol. 8, 10 (Oct. 1965), 627--633.", "Robert Speer, Joshua Chin, and Catherine Havasi. 2017. ConceptNet 5.5: An Open Multilingual Graph of General Knowledge.. In AAAI. 4444--4451.", "Syracuse University. 2018. SEED Labs. http://www.cis.syr.edu/ wedu/seed/labs.html .", "Chen-Tse Tsai and Dan Roth. 2016. Cross-lingual wikification using multilingual embeddings. In Proceedings of the 2016 Conference of the North American Chapter of the Association for Computational Linguistics: Human Language Technologies. 589--598.", "L. Xu, D. Huang, and W. Tsai. 2014. Cloud-Based Virtual Laboratory for Network Security Education. IEEE Transactions on Education, Vol. 57, 3 (Aug 2014), 145--150.", "Zhen Zeng, Yuli Deng, I-Han Hsiao, and Dijiang Huang. 2018. Understanding Students' Engagement behavior in Virtual Hands-on Lab: Findings from a Computer Network Security Course. In 2018 IEEE Frontiers in Education Conference (FIE) ."]}, {"title": "Does Diversity Affect User Satisfaction in Image Search", "authors": ["Zhijing Wu\n,", "Ke Zhou\n,", "Yiqun Liu\n,", "Min Zhang\n,", "Shaoping Ma"], "publication": "ACM Transactions on Information Systems", "abstract": "Abstract\nDiversity has been taken into consideration by existing Web image search engines in ranking search results. However, there is no thorough investigation of how diversity affects user satisfaction in image search. In this article, we address the following questions: (1) How do different factors, such as content and visual presentations, affect users’ perception of diversity? (2) How does search result diversity affect user satisfaction with different search intents? To answer those questions, we conduct a set of laboratory user studies to collect users’ perceived diversity annotations and search satisfaction. We find that the existence of nearly duplicated image results has the largest impact on users’ perceived diversity, followed by the similarity in content and visual presentations. Besides these findings, we also investigate the relationship between diversity and satisfaction in image search. Specifically, we find that users’ preference for diversity varies across different search intents. When users want to collect information or save images for further usage (the Locate search tasks), more diversified result lists lead to higher satisfaction levels. The insights may help commercial image search engines to design better result ranking strategies and evaluation metrics.", "references": ["Rakesh Agrawal, Sreenivas Gollapudi, Alan Halverson, and Samuel Ieong. 2009. Diversifying search results. In Proceedings of the 2nd ACM International Conference on Web Search and Data Mining (WSDM’09). ACM, New York, NY, 5--14.", "Paul André, Edward Cutrell, Desney S. Tan, and Greg Smith. 2009. Designing novel image search interfaces by understanding unique characteristics and usage. In Proceedings of the IFIP Conference on Human-Computer Interaction. Springer, 340--353.", "Tevfik Aytekin and Mahmut Özge Karakaya. 2014. Clustering-based diversity improvement in top-N recommendation. J. Intell. Inf. Syst. 42, 1 (01 Feb. 2014), 1--18.", "Andrei Broder. 2002. A taxonomy of web search. SIGIR Forum 36, 2 (Sep. 2002), 3--10.", "Jaime Carbonell and Jade Goldstein. 1998. The use of MMR, diversity-based reranking for reordering documents and producing summaries. In Proceedings of the 21st Annual International ACM SIGIR Conference on Research and Development in Information Retrieval (SIGIR’98). ACM, New York, NY, 335--336.", "Gal Chechik, Varun Sharma, Uri Shalit, and Samy Bengio. 2010. Large scale online learning of image similarity through ranking. J. Mach. Learn. Res. 11 (Mar. 2010), 1109--1135. http://dl.acm.org/citation.cfm?id&equals;1756006.1756042", "Harr Chen and David R. Karger. 2006. Less is more: Probabilistic models for retrieving fewer relevant documents. In Proceedings of the 29th Annual International ACM SIGIR Conference on Research and Development in Information Retrieval (SIGIR’06). ACM, New York, NY, 429--436.", "Ye Chen, Ke Zhou, Yiqun Liu, Min Zhang, and Shaoping Ma. 2017. Meta-evaluation of online and offline web search evaluation metrics. In Proceedings of the 40th International ACM SIGIR Conference on Research and Development in Information Retrieval (SIGIR’17). ACM, New York, NY, 15--24.", "Navneet Dalal and Bill Triggs. 2005. Histograms of oriented gradients for human detection. In Proceedings of the IEEE Computer Society Conference on Computer Vision and Pattern Recognition (CVPR’05). 886--893.", "Atish Das Sarma, Sreenivas Gollapudi, and Samuel Ieong. 2008. Bypass rates: Reducing query abandonment using negative inferences. In Proceedings of the 14th ACM SIGKDD International Conference on Knowledge Discovery and Data Mining (KDD’08). ACM, New York, NY, 177--185.", "Thomas Deselaers, Tobias Gass, Philippe Dreuw, and Hermann Ney. 2009. Jointly optimising relevance and diversity in image retrieval. In Proceedings of the ACM International Conference on Image and Video Retrieval (CIVR’09). ACM, New York, NY, Article 39, 8 pages.", "J. L. Fleiss. 1971. Measuring nominal scale agreement among many raters. Psychol. Bull. 76, 5 (1971), 378--382.", "Steve Fox, Kuldeep Karnawat, Mark Mydland, Susan Dumais, and Thomas White. 2005. Evaluating implicit measures to improve web search. ACM Trans. Inf. Syst. 23, 2 (Apr. 2005), 147--168.", "Matthieu Guillaumin, Thomas Mensink, Jakob Verbeek, and Cordelia Schmid. 2010. TagProp: Discriminative metric learning in nearest neighbor models for image auto-annotation. In Proceedings of the IEEE International Conference on Computer Vision. 309--316.", "Qi Guo, Dmitry Lagun, and Eugene Agichtein. 2012. Predicting web search success with fine-grained interaction data. In Proceedings of the 21st ACM International Conference on Information and Knowledge Management (CIKM’12). ACM, New York, NY, 2050--2054.", "Jonathon S. Hare and Paul H. Lewis. 2013. Explicit diversification of image search. In Proceedings of the 3rd ACM Conference on International Conference on Multimedia Retrieval (ICMR’13). ACM, New York, NY, 295--296.", "Ahmed Hassan, Rosie Jones, and Kristina Lisa Klinkner. 2010. Beyond DCG: User behavior as a predictor of a successful search. In Proceedings of the 3rd ACM International Conference on Web Search and Data Mining (WSDM’10). ACM, New York, NY, 221--230.", "Ahmed Hassan, Xiaolin Shi, Nick Craswell, and Bill Ramsey. 2013. Beyond clicks: Query reformulation as a predictor of search satisfaction. In Proceedings of the 22nd ACM International Conference on Conference on Information 8 Knowledge Management (CIKM’13). ACM, New York, NY, 2019--2028.", "Bernard J. Jansen. 2008. Searching for digital images on the web. J. Doc. 64, 1 (2008), 81--101.", "Bernard J. Jansen, Amanda Spink, Judy Bateman, and Tefko Saracevic. 1998. Real life information retrieval: A study of user queries on the web. SIGIR Forum 32, 1 (Apr. 1998), 5--17.", "Diane Kelly. 2009. Methods for evaluating interactive information retrieval systems with users. Found. Trends Inf. Retriev. 3, 1--2 (2009), 1--224.", "Youngho Kim, Ahmed Hassan, Ryen W. White, and Imed Zitouni. 2014. Comparing client and server dwell time estimates for click-level satisfaction prediction. In Proceedings of the 37th International ACM SIGIR Conference on Research 8 Development in Information Retrieval (SIGIR’14). ACM, New York, NY, 895--898.", "Dmitry Lagun, Chih-Hung Hsieh, Dale Webster, and Vidhya Navalpakkam. 2014. Towards better measurement of attention and satisfaction in mobile search. In Proceedings of the 37th International ACM SIGIR Conference on Research 8 Development in Information Retrieval (SIGIR’14). ACM, New York, NY, 113--122.", "J. Richard Landis and Gary G Koch. 1977. The measurement of observer agreement for categorical data. Biometrics 33, 1 (1977), 159--174.", "Monica Lestari Paramita, Mark Sanderson, and Paul Clough. 2010. Diversity in photo retrieval: Overview of the ImageCLEFPhoto task 2009. In Multilingual Information Access Evaluation II. Multimedia Experiments, Carol Peters, Barbara Caputo, Julio Gonzalo, Gareth J. F. Jones, Jayashree Kalpathy-Cramer, Henning Müller, and Theodora Tsikrika (Eds.). Springer, 45--59.", "Yiqun Liu, Ye Chen, Jinhui Tang, Jiashen Sun, Min Zhang, Shaoping Ma, and Xuan Zhu. 2015. Different users, different opinions: Predicting search satisfaction with mouse movement information. In Proceedings of the 38th International ACM SIGIR Conference on Research and Development in Information Retrieval (SIGIR’15). ACM, New York, NY, 493--502.", "David G. Lowe. 2004. Distinctive Image Features from Scale-Invariant Keypoints. Kluwer Academic Publishers. 91--110 pages.", "Mathias Lux, Christoph Kofler, and Oge Marques. 2010. A classification scheme for user intentions in image search. In Proceedings of the CHI’10 Extended Abstracts on Human Factors in Computing Systems (CHI EA’10). ACM, New York, NY, 3913--3918.", "Rishabh Mehrotra, Imed Zitouni, Ahmed Hassan Awadallah, Ahmed El Kholy, and Madian Khabsa. 2017. User interaction sequences for search satisfaction prediction. In Proceedings of the 40th International ACM SIGIR Conference on Research and Development in Information Retrieval (SIGIR’17). ACM, New York, NY, 165--174.", "Neil O’Hare, Paloma de Juan, Rossano Schifanella, Yunlong He, Dawei Yin, and Yi Chang. 2016. Leveraging user interaction signals for web image search. In Proceedings of the 39th International ACM SIGIR Conference on Research and Development in Information Retrieval (SIGIR’16). ACM, New York, NY, 559--568.", "Richard L. Oliver. 1997. Satisfaction: A behavioral perspective on the consumer. Asia Pac. J. Manage. 2, 2 (1997), 285--286.", "Jaimie Y. Park, Neil O’Hare, Rossano Schifanella, Alejandro Jaimes, and Chin-Wan Chung. 2015. A large-scale study of user image search behavior on the web. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI’15). ACM, New York, NY, 985--994.", "Hsiao-Tieh Pu. 2005. A comparative analysis of web image and textual queries. Online Inf. Rev. 29, 5 (2005), 457--467.", "X. Qian, D. Lu, Y. Wang, L. Zhu, Y. Y. Tang, and M. Wang. 2017. Image re-ranking based on topic diversity. IEEE Trans. Image Process. PP, 99 (2017), 1--1.", "Filip Radlinski, Paul N. Bennett, Ben Carterette, and Thorsten Joachims. 2009. Redundancy, diversity and interdependent document relevance. SIGIR Forum 43, 2 (Dec. 2009), 46--52.", "Filip Radlinski and Susan Dumais. 2006. Improving personalized web search using result diversification. In Proceedings of the 29th Annual International ACM SIGIR Conference on Research and Development in Information Retrieval (SIGIR’06). ACM, New York, NY, 691--692.", "Vidyadhar Rao, Prateek Jain, and C. V. Jawahar. 2016. Diverse yet efficient retrieval using locality sensitive hashing. In Proceedings of the 2016 ACM on International Conference on Multimedia Retrieval (ICMR’16). ACM, New York, NY, 189--196.", "D. M. Russell, D. Tang, M. Kellar, and R. Jeffries. 2009. Task behaviors during web search: The difficulty of assigning labels. In Proceedings of the Hawaii International Conference on System Sciences. 1--5.", "Rodrygo L. T. Santos, Craig Macdonald, and Iadh Ounis. 2010. Exploiting query reformulations for web search result diversification. In Proceedings of the 19th International Conference on World Wide Web (WWW’10). ACM, New York, NY, 881--890.", "Rodrygo L. T. Santos, Craig Macdonald, and Iadh Ounis. 2010. Selectively diversifying web search results. In Proceedings of the 19th ACM International Conference on Information and Knowledge Management (CIKM’10). ACM, New York, NY, 1179--1188.", "Rodrygo L. T. Santos, Craig Macdonald, and Iadh Ounis. 2011. Intent-aware search result diversification. In Proceedings of the 34th International ACM SIGIR Conference on Research and Development in Information Retrieval (SIGIR’11). ACM, New York, NY, 595--604.", "Craig Silverstein, Hannes Marais, Monika Henzinger, and Michael Moricz. 1999. Analysis of a very large web search engine query log. SIGIR Forum 33, 1 (Sep. 1999), 6--12.", "C. R. Snyder and S. J. Lopez. 2009. The Oxford Handbook of Positive Psychology. Oxford library of psychology.", "Eleftherios Spyromitros-Xioufis, Symeon Papadopoulos, Alexandru Lucian Ginsca, Adrian Popescu, Yiannis Kompatsiaris, and Ioannis Vlahavas. 2015. Improving diversity in image search via supervised relevance scoring. In Proceedings of the 5th ACM on International Conference on Multimedia Retrieval (ICMR’15). ACM, New York, NY, 323--330.", "Louise T. Su. 1992. Evaluation measures for interactive information retrieval. Inf. Process. Manage. 28, 4 (1992), 503--516.", "Benjamin W. Tatler and Benjamin T. Vincent. 2009. The prominence of behavioural biases in eye guidance. Vis. Cogn. 17, 6--7 (2009), 1029--1054.", "Hanghang Tong, Jingrui He, Zhen Wen, Ravi Konuru, and Ching-Yung Lin. 2011. Diversified ranking on large graphs: An optimization viewpoint. In Proceedings of the 17th ACM SIGKDD International Conference on Knowledge Discovery and Data Mining (KDD’11). ACM, New York, NY, 1028--1036.", "Geoffrey Underwood and Tom Foulsham. 2006. Visual saliency and semantic incongruency influence eye movements when inspecting pictures. Quart. J. Exp. Psychol. 59, 11 (2006), 1931--1949.", "Reinier H. van Leuken, Lluis Garcia, Ximena Olivares, and Roelof van Zwol. 2009. Visual diversification of image search results. In Proceedings of the 18th International Conference on World Wide Web (WWW’09). ACM, New York, NY, 341--350.", "Bin Wang, Zhiwei Li, Mingjing Li, and Wei Ying Ma. 2006. Large-scale duplicate detection for web image search. In Proceedings of the IEEE International Conference on Multimedia and Expo (ICME’06). 353--356.", "Gang Wang, Derek Hoiem, and David Forsyth. 2010. Learning image similarity from flickr groups using stochastic intersection kernel MAchines. In Proceedings of the IEEE International Conference on Computer Vision. 428--435.", "Hongning Wang, Yang Song, Ming-Wei Chang, Xiaodong He, Ahmed Hassan, and Ryen W. White. 2014. Modeling action-level satisfaction for search task satisfaction prediction. In Proceedings of the 37th International ACM SIGIR Conference on Research 8 Development in Information Retrieval (SIGIR’14). ACM, New York, NY, 123--132.", "Zhijing Wu, Xiaohui Xie, Yiqun Liu, Min Zhang, and Shaoping Ma. 2017. A study of user image search behavior based on log analysis. In Proceedings of the China Conference on Information Retrieval. Springer, 69--80.", "Xiaohui Xie, Yiqun Liu, Maarten de Rijke, Jiyin He, Min Zhang, and Shaoping Ma. 2018. Why people search for images using web search engines. In Proceedings of the 11th ACM International Conference on Web Search and Data Mining (WSDM’18). ACM, New York, NY, 655--663.", "Xiaohui Xie, Yiqun Liu, Xiaochuan Wang, Meng Wang, Zhijing Wu, Yingying Wu, Min Zhang, and Shaoping Ma. 2017. Investigating examination behavior of image search users. In Proceedings of the 40th International ACM SIGIR Conference on Research and Development in Information Retrieval (SIGIR’17). ACM, New York, NY, 275--284.", "Yan Yan, Gaowen Liu, Sen Wang, Jian Zhang, and Kai Zheng. 2014. Graph-based clustering and ranking for diversified image search. Multimedia Syst. 23, 1 (2014), 41--52.", "Fan Zhang, Ke Zhou, Yunqiu Shao, Cheng Luo, Min Zhang, and Shaoping Ma. 2018. How well do offline and online evaluation metrics measure user satisfaction in web image search? In Proceedings of the 41st International ACM SIGIR Conference on Research 8 Development in Information Retrieval (SIGIR’18). ACM, New York, NY, 615--624.", "Yimeng Zhang, Zhaoyin Jia, and Tsuhan Chen. 2011. Image retrieval with geometry-preserving visual phrases. In Computer Vision and Pattern Recognition. 809--816."]}, {"title": "Curation Technologies for Cultural Heritage Archives: Analysing and transforming a heterogeneous data set into an interactive curation workbench", "authors": ["Georg Rehm\n,", "Martin Lee\n,", "Julián Moreno-Schneider\n,", "Peter Bourgonje"], "publication": "DATeCH2019: Proceedings of the 3rd International Conference on Digital Access to Textual Cultural Heritage", "abstract": "ABSTRACT\nWe present a platform that enables the semantic analysis, enrichment, visualisation and presentation of a document collection in a way that enables human users to intuitively interact and explore the collection, in short, a curation platform or workbench. The data set used is the result of a research project, carried out by scholars from South Korea, in which official German government documents on the German re-unification were collected, intellectually curated, analysed, interpreted and published in multiple volumes. The documents we worked with are mostly in German, a small subset, mostly summaries, is in Korean. This paper describes the original research project that generated the data set and focuses upon a description of the platform and Natural Language Processing (NLP) pipeline adapted and extended for this project (e. g., OCR was added). Our key objective is to develop an interactive curation workbench that enables users to interact with the data set in several different ways that go beyond the current version of the published document collection as a set of PDF documents that are available online. The paper concludes with suggestions regarding the improvement of the platform and future work.", "references": ["Apache. 2010. OpenNLP. http://opennlp.apache.org", "Esther Asef, Cosima Wagner, and Martin Lee. 2019. Workshop Report Non-Latin Scripts in Multilingual Environments: Research Data and Digital Humanities in Area Studies. https://blogs.fu-berlin.de/bibliotheken/2019/01/18/workshop-nls2018/.", "Mathias Bank and Martin Schierle. 2012. A Survey of Text Mining Architectures and the UIMA Standard.. In Proceedings of the Language Resources and Evaluation Conference 2012 (LREC 2012), Nicoletta Calzolari, Khalid Choukri, Thierry Declerck, Mehmet Ugur Dogan, Bente Maegaard, Joseph Mariani, Jan Odijk, and Stelios Piperidis (Eds.). European Language Resources Association (ELRA), 3479--3486. http://dblp.uni-trier.de/db/conf/lrec/lrec2012.html#BankS12", "Peter Bourgonje, Julian Moreno-Schneider, Jan Nehring, Georg Rehm, Felix Sasaki, and Ankit Srivastava. 2016. Towards a Platform for Curation Technologies: Enriching Text Collections with a Semantic-Web Layer. In The Semantic Web (Lecture Notes in Computer Science), Harald Sack, Giuseppe Rizzo, Nadine Steinmetz, Dunja Mladenia, Sören Auer, and Christoph Lange (Eds.). Springer, 65--68. ESWC 2016 Satellite Events. Heraklion, Crete, Greece, 2016 Revised Selected Papers.", "Steve Cassidy, Dominique Estival, Timothy Jones, Denis Burnham, and Jared Burghold. 2014. The Alveo Virtual Laboratory: A Web Based Repository API. In Proceedings of the Ninth International Conference on Language Resources and Evaluation, LREC 2014, Reykjavik, Iceland, May 26-31, 2014., Nicoletta Calzolari, Khalid Choukri, Thierry Declerck, Hrafn Loftsson, Bente Maegaard, Joseph Mariani, Asunción Moreno, Jan Odijk, and Stelios Piperidis (Eds.). European Language Resources Association (ELRA), 1--7. http://www.lrec-conf.org/proceedings/lrec2014/summaries/628.html", "Jeong-Won Cha, Jeen-Pyo Hong, and Chang-Uk Shin. 2017. Espresso: Korean Part of Speech Tagger. https://doi.org/10.5281/zenodo.884606", "Euisok Chung, Yi-Gyu Hwang, and Myung-Gil Jang. 2003. Korean named entity recognition using HMM and CoTraining model. In Proceedings of the Sixth International Workshop on Information Retrieval with Asian Languages, 2003, Sappro, Japan, July 7, 2003. 161--167. https://dl.acm.org/citation.cfm?id=1118956", "CLARIN-D/SfS-Uni. Tübingen. 2012. WebLicht: Web-Based Linguistic Chaining Tool. Online. Date Accessed: 18 Jan 2019. URL https://weblicht.sfs.unituebingen.de/.", "Hamish Cunningham, Diana Maynard, Kalina Bontcheva, Valentin Tablan, Niraj Aswani, Ian Roberts, Genevieve Gorrell, Adam Funk, Angus Roberts, Danica Damljanovic, Thomas Heitz, Mark A. Greenwood, Horacio Saggion, Johann Petrak, Yaoyong Li, and Wim Peters. 2011. Text Processing with GATE (Version 6). http://tinyurl.com/gatebook", "Victor de Boer, Johan Oomen, Oana Inel, Lora Aroyo, Elco van Staveren, Werner Helmich, and Dennis de Beurs. 2015. DIVE into the event-based browsing of linked historical media. Journal of Web Semantics 35 (2015), 152--158. https://doi.org/10.1016/j.websem.2015.06.003 Semantic Web Challenge 2014.", "Richard Eckart de Castilho, Éva Mújdricza-Maydt, Seid Muhie Yimam, Silvana Hartmann, Iryna Gurevych, Anette Frank, and Chris Biemann. 2016. A Web-based Tool for the Integrated Annotation of Semantic and Syntactic Structures. In Proceedings of the Workshop on Language Technology Resources and Tools for Digital Humanities (LT4DH) at COLING 2016. 76--84. http://tubiblio.ulb.tu-darmstadt.de/97939/", "David Ferrucci and Adam Lally. 2004. UIMA: An Architectural Approach to Unstructured Information Processing in the Corporate Research Environment. Nat. Lang. Eng. 10, 3-4 (Sept. 2004), 327--348. https://doi.org/10.1017/S1351324904003523", "Mark Hall, Eibe Frank, Geoffrey Holmes, Bernhard Pfahringer, Peter Reutemann, and Ian H. Witten. 2009. The WEKA data mining software: an update. SIGKDD Explorations 11, 1 (2009), 10--18.", "Sebastian Hellmann, Jens Lehmann, Sören Auer, and Martin Brümmer. 2013. Integrating NLP using Linked Data. In 12th International Semantic Web Conference. 21-25 October.", "Erhard Hinrichs, Marie Hinrichs, and Thomas Zastrow. 2010. WebLicht: Web-Based LRT Services for German. In Proceedings of the ACL 2010 System Demonstrations. 25--29. http://www.aclweb.org/anthology/P10-4005", "Erhard Hinrichs and Steven Krauwer. 2014. The CLARIN Research Infrastructure: Resources and Tools for e-Humanities Scholars. Proceedings of the Ninth International Conference on Language Resources and Evaluation (LREC-2014) (May 2014), 1525--1531. http://dspace.library.uu.nl/handle/1874/307981", "Nancy Ide, James Pustejovsky, Christopher Cieri, Eric Nyberg, Denise Dipersio, Chunqi Shi, Keith Suderman, Marc Verhagen, Di Wang, and Jonathan Wright. 2016. The Language Application Grid. In Revised Selected Papers of the Second International Workshop on Worldwide Language Service Infrastructure - Volume 9442 (WLSI 2015). Springer-Verlag New York, Inc., New York, NY, USA, 51--70. https://doi.org/10.1007/978-3-319-31468-6_4", "Park Jungyeul. 2017. Berkeley parser model for Korean: Sejong treebank Berkeley parser model for Korean: Sejong treebank. https://doi.org/10.5281/zenodo.891267", "Clemens Neudecker and Georg Rehm. 2016. Digitale Kuratierungstechnologien für Bibliotheken. Zeitschrift für Bibliothekskultur 027.7 4, 2 (November 2016). http://0277.ch/ojs/index.php/cdrs_0277/article/view/158", "Joel Nothman, Nicky Ringland, Will Radford, Tara Murphy, and James R. Curran. 2013. Learning multilingual named entity recognition from Wikipedia. Artificial Intelligence 194 (2013), 151--175. https://doi.org/10.1016/j.artint.2012.03.006 Artificial Intelligence, Wikipedia and Semi-Structured Resources.", "Jungyeul Park. 2017. JHE Korean-English evaluation data. https://doi.org/10.5281/zenodo.891295", "Jungyeul Park. 2017. MaltParser model for Korean: Sejong treebank. https://doi.org/10.5281/zenodo.891273", "Antonis Lempesis Mark Greenwood Petr Knoth Richard Eckart de Castilho Stavros Sachtouris Byron Georgantopoulos Stefania Martziou Lucas Anastasiou Katerina Gkirtzou Natalia Manola Penny Labropoulou, Dimitris Galanis and Stelios Piperidis. 2018. OpenMinTeD: A Platform Facilitating Text Mining of Scholarly Content. In Proceedings of the Eleventh International Conference on Language Resources and Evaluation (LREC 2018) (7-12). European Language Resources Association (ELRA), Paris, France.", "Matic Perovsek, Janez Kranjc, Tomaz Erjavec, Bojan Cestnik, and Nada Lavrac. 2016. TextFlows: A visual programming platform for text mining and natural language processing. Sci. Comput. Program. 121 (2016), 128--152.", "Georg Rehm and Felix Sasaki. 2016. Digital Curation Technologies. In Special Issue of the Baltic Journal of Modern Computing (Vol. 4, No. 2) - Proceedings of the 19th Annual Conference of the European Association for Machine Translation (EAMT 2016). Riga, Latvia, 399.", "Georg Rehm, Julián Moreno Schneider, Peter Bourgonje, Ankit Srivastava, Rolf Fricke, Jan Thomsen, Jing He, Joachim Quantz, Armin Berger, Luca König, Sören Räuchle, Jens Gerth, and David Wabnitz. 2018. Different Types of Automated and Semi-Automated Semantic Storytelling: Curation Technologies for Different Sectors. In Language Technologies for the Challenges of the Digital Age: 27th International Conference, GSCL 2017, Berlin, Germany, September 13-14, 2017, Proceedings (Lecture Notes in Artificial Intelligence (LNAI)), Georg Rehm and Thierry Declerck (Eds.). Gesellschaft für Sprachtechnologie und Computerlinguistik e.V., Springer, Cham, Switzerland, 232--247. 13/14 September 2017.", "Georg Rehm, Julian Moreno Schneider, Peter Bourgonje, Ankit Srivastava, Jan Nehring, Armin Berger, Luca König, Sören Räuchle, and Jens Gerth. 2017. Event Detection and Semantic Storytelling: Generating a Travelogue from a large Collection of Personal Letters. In Proceedings of the Events and Stories in the News Workshop, Tommaso Caselli, Ben Miller, Marieke van Erp, Piek Vossen, Martha Palmer, Eduard Hovy, and Teruko Mitamura (Eds.). Association for Computational Linguistics, Vancouver, Canada, 42--51. Co-located with ACL 2017.", "Julian Moreno Schneider and Georg Rehm. 2018. Towards a Workflow Manager for Curation Technologies in the Legal Domain. In Proceedings of the LREC 2018 Workshop on Language Resources and Technologies for the Legal Knowledge Graph, Georg Rehm, Víctor Rodríguez-Doncel, and Julian Moreno Schneider (Eds.). Miyazaki, Japan, 30--35. 12 May 2018.", "Ray Smith and Google Inc. 2007. An overview of the Tesseract OCR Engine. In Proc. 9th IEEE Intl. Conf. on Document Analysis and Recognition (ICDAR. 629--633.", "Bo-Hyun Yun. 2007. HMM-Based Korean Named Entity Recognition for Information Extraction. In Knowledge Science, Engineering and Management, Zili Zhang and Jörg Siekmann (Eds.). Springer Berlin Heidelberg, Berlin, Heidelberg, 526--531.", "Amir Zeldes, Anke Lüdeling, Julia Ritz, and Christian Chiarcos. 2009. ANNIS: a search tool for multi-layer annotated corpora. In Proceedings of Corpus Linguistics. https://doi.org/10.18452/13437"]}, {"title": "Detecting Articles in a Digitized Finnish Historical Newspaper Collection 1771-1929: Early Results Using the PIVAJ Software", "authors": ["Kimmo Kettunen\n,", "Teemu Ruokolainen\n,", "Erno Liukkonen\n,", "Pierrick Tranouez\n,", "Daniel Antelme\n,", "Thierry Paquet"], "publication": "DATeCH2019: Proceedings of the 3rd International Conference on Digital Access to Textual Cultural Heritage", "abstract": "ABSTRACT\nThis paper describes first large scale article detection and extraction efforts on the Finnish Digi1 newspaper material of the National Library of Finland (NLF) using data of one newspaper, Uusi Suometar 1869-1898. The historical digital newspaper archive environment of the NLF is based on commercial docWorks2 software. The software is capable of article detection and extraction, but our material does not seem to behave well in the system in this respect. Therefore, we have been in search of an alternative article segmentation system and have now focused our efforts on the PIVAJ machine learning based platform developed at the LITIS laboratory of University of Rouen Normandy [11--13, 16, 17].\nAs training and evaluation data for PIVAJ we chose one newspaper, Uusi Suometar. We established a data set that contains 56 issues of the newspaper from years 1869-1898 with 4 pages each, i.e. 224 pages in total. Given the selected set of 56 issues, our first data annotation and experiment phase consisted of annotating a subset of 28 issues (112 pages) and conducting preliminary experiments. After the preliminary annotation and experimentation resulting in a consistent practice, we fixed the annotation of the first 28 issues accordingly. Subsequently, we annotated the remaining 28 issues. We then divided the annotated set into training and evaluation sets of 168 and 56 pages. We trained PIVAJ successfully and evaluated the results using the layout evaluation software developed by PRImA research laboratory of University of Salford [6].\nThe results of our experiments show that PIVAJ achieves success rates of 67.9, 76.1, and 92.2 for the whole data set of 56 pages with three different evaluation scenarios introduced in [6]. On the whole, the results seem reasonable considering the varying layouts of the different issues of Uusi Suometar along the time scale of the data.", "references": ["A. Antonacopoulos, C. Clausner, C. Papadopoulos, S. Pletschacher (2011). Historical Document Layout Analysis Competition. Proceedings of the 11th International Conference on Document Analysis and Recognition (ICDAR2011), Beijing, China, September 2011, 1516--1520.", "A. Antonacopoulos, C. Clausner, C. Papadopoulos, S. Pletschacher (2013). ICDAR2013 Competition on Historical Newspaper Layout Analysis -- HNLA2013. DOI: 10.1109/ICDAR.2013.293", "A. Antonacopoulos, C. Clausner, C. Papadopoulos, S. Pletschacher (2015). ICDAR2015 Competition on Recognition of Documents with Complex Layouts -- RDCL2015. DOI: 10.1109/ICDAR.2015.7333941.", "P. Barlas, S. Adam, C. Chatelain, T. Paquet (2014). A typed and Handwritten text block segmentation system for heterogenous and complex documents. http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.800.4721&rep=rep1&type=pdf", "F. Buhr, B. Neumann (2014). Evaluation of Retrieval Performance in Historical Newspaper Archives comparing Page-level and Article-level Granularity. https://kogs-www.informatik.uni-hamburg.de/publikationen/pub-buhr/Newspaper-Retrieval.pdf", "C. Clausner, S. Pletshacher, A. Antonacopoulos (2011). Scenario Driven In-Depth Performance Evaluation of Document Layout Analysis Methods. 2011 International Conference on Document Analysis and Recognition (ICDAR). DOI: 10.1109/ICDAR.2011.282", "C. Clausner, A. Antonacopoulos, S. Pletschacher (2017). ICDAR2017 Competition on Recognition of Documents with Complex Layouts -- RDCL2017. https://ieeexplore.ieee.org/document/8270160", "A. Dengel, F. Shafait (2014). Analysis of the Logical Layout of Documents. In Doerman, D., Tombre, K. (eds.) Handbook of Document Image Processing and Recognition, 177--222. Springer. DOI 10.1007/978-0-85729-859-1", "S. Eskenazi, P. Gomez-Krämer, J.-M. Ogier (2017). A Comprehensive survey of mostly textual document segmentation algorithms since 2008. Pattern Recognition 64, 1--14.", "N. Fuhr, G. Tsakonass, T. Aalberg, M. Agosti, P. Hansen, S. Kapidakis, C.-P. Klas, L. Kovács, M. Landoni, A. Micsik, C. Papatheodorou, C. Peters, I. Sølvberg (2007). Evaluation of digital libraries. International Journal on Digital Libraries 8(1), 21--38.", "D. Hebert, T. Palfray, T. Nicolas, P. Tranouez, T. Paquet (2014). Automatic article extraction in old Newspapers Digitized Collections. In Proceeding DATeCH '14 Proceedings of the First International Conference on Digital Access to Textual Cultural Heritage, 3--8. http://dl.acm.org/citation.cfm?id=2595195", "D. Hebert, T. Palfray, T. Nicolas, P. Tranouez, T. Paquet (2014). PIVAJ: displaying and augmenting digitized newspapers on the Web Experimental feedback from the \"Journal de Rouen\" Collection. In Proceeding DATeCH '14 Proceedings of the First International Conference on Digital Access to Textual Cultural Heritage, 173--178. http://dl.acm.org/citation.cfm?id=2595217", "D. Hebert, T. Paquet, T. Nicolas (2011). Continuous CRF with multi-scale quantization feature functions Application to structure extraction in old newspapers. 2011 International Conference on Document Analysis and Recognition, Beijing, 2011, 493--497. DOI: 10.1109/ICDAR.2011.10", "K. Kise (2014). Page Segmentation Techniques in Document Analysis. In Doerman, D., Tombre, K. (eds.) Handbook of Document Image Processing and Recognition, 135--175. Springer. DOI 10.1007/978-0-85729-859-1", "V. Märgner, H. El Abed (2014). Tools and Metrics for Document Analysis Systems Evaluation. In Doerman, D., Tombre, K. (eds.) Handbook of Document Image Processing and Recognition, 1011--1036. Springer. DOI 10.1007/978-0-85729-859-1", "T. Palfray, D. Hebert, T. Nicolas, P. Tranouez, T. Paquet (2012). Logical segmentation for article extraction in digitized old newspapers. https://arxiv.org/ftp/arxiv/papers/1210/1210.0999.pdf", "P. Tranouez, S. Nicolas, J. Lerouge, T. Paquet (2015). PIVAJ: an article-centered platform for digitized newspapers. http://www.imaging.org/site/PDFS/Reporter/Articles/REP30_3_ARCH2015_TRANOUEZ.pdf", "M. Willems, R. Atanassova, Rossitza (2015). Europeana Newspapers: searching digitized historical newspapers from 23 European countries. Insights 28(1).", "H.I. Xie (2008). Users' evaluation of digital libraries (DLs): Their uses, their criteria, and their assessment. Information Processing and Management, 44(3), 1346--1373."]}, {"title": "Implementation of a Databaseless Web REST API for the Unstructured Texts of Migne's Patrologia Graeca with Searching capabilities and additional Semantic and Syntactic expandability", "authors": ["Evagelos Varthis\n,", "Marios Poulos\n,", "Ilias Yarenis\n,", "Sozon Papavlasopoulos"], "publication": "DATeCH2019: Proceedings of the 3rd International Conference on Digital Access to Textual Cultural Heritage", "abstract": "ABSTRACT\nThe search through large corpora of unstructured text on the Web Domain is not an easy task and such services are not offered for the common user. One such corpus is the published works of east Christian fathers by Jacques Paul Migne, known as Patrologia Graeca (PG). In this paper, an application of a Databaseless model is presented for extracting information from the unstructured patristic works of PG on the Web Domain. The user queries terms that may exist in PG and retrieves all the paragraphs-fragments that contain these terms. The time for retrieving the information is faster than implementing this querying system in a common Relational Database Management System (RDMS). Our proposed system is portable, secure and can be easily maintained by institutions or organizations. The system auto-transforms the PG corpus into a Representational State Transfer Access Point Interface (REST API) for retrieving and processing the information, using the JavaScript Object Notation (JSON) format. The User Interface (UI) is completely distinguished from the backbone of the system while the system, on the other hand, can be easily extended for more complicated queries as well as to be applied to other corpora. Two kinds of user interfaces are described: The first one is completely static, useful for the average user using the Web browser. The second one illustrates the use of simple Shell Scripting, for searching and extracting statistical, syntactical and semantic information in real time. In both cases we try to strip down the complexity in order to accomplish the corpus transformation and searching, in a simple, secure and manageable way. Difficulties and key problems are also discussed.", "references": ["Anemi. 2006. Digital Libary of Modern Greek Studies. Retrieved from https://anemi.lib.uoc.gr/metadata/8/5/0/metadata-01-0001289.tkl", "Archive.org. 1996. Internet Archive Homepage. Retrieved from https://archive.org.", "Chris Diaz. 2018. Using Static Site Generators for Scholarly Publications and Open Educational Resources. Code4Lib Journal, Issue 42 42 (2018).", "Hina Farooq, Azka Mahmood, and Javed Ferzund. 2017. Do NoSQL Databases Cope with Current Data Challenges. Int. J. Comput. Sci. Inf. Secur. (2017).", "Google. 2004. Books Library Project. Retrieved from https://books.google.com", "Khazarzar. 2000. Ruslan Khazarzar Library, Patrologia Section. Retrieved from http://khazarzar.skeptik.net/pgm/PG_Migne/.", "Tim Kraska, Donald Kossmann, Matthias Brantner, Daniela Florescu, and David Graf. 2008. Building a database on S3. In ACM SIGMOD international conference on Management of data, 251. DOI:https://doi.org/10.1145/1376616.1376645", "Jacques Paul Migne. 1866. Patrologia Graeca, Vol. 68: Cyril of Alexandria, Commentarius in Isaiam prophetam.", "M.R. Palankar, Adriana Iamnitchi, Matei Ripeanu, and S. Garfinkel. 2008. Amazon S3 for science grids: a viable solution? In Proceedings of the 2008 international workshop on Data-aware distributed computing. DOI:https://doi.org/10.1145/1383519.1383526", "Stylianos Papadopoulos. 1982. Patrology, Vol. 1: Introduction, Second and Third Century (2nd. ed.). Athens.", "Athanasios Paparnakis and Constantinos Domouchtsis. 2017. Digital Greek Patristic Catena (DGPC), Abrief presentation. J. Data Min. Digit. Humanit. Episciences.org, Spec. Issue Comput. Process. Intertextuality Anc.Lang. (2017).", "Patristica. Download Index for Patrologia Graeca. Retrieved from http://patristica.net/graeca.", "Perseus. Digital Library, OCR textual data for Patrologia Graeca. Retrieved from https://github.com/OGL-PatrologiaGraecaDev", "Perseus. 1987. Digital Library Homepage. Retrieved from http://www.perseus.tufts.edu/hopper/", "Brian Rinaldi. 2015. Static Site Generators, Modern Tools for Static Website Development. OReilly Media, Inc., Sebastopol, CA.", "Roads of Faith. 2014. Digital Patrology edited by the Cultural Heritage Management Laboratory of the Department of Cultural Technology and Communication of the University of the Aegean. Retrieved from http://web.archive.org/web/20061211200657/http://patrologia", "Bruce Robertson. Rigaudon OCR Homepage. Retrieved from https://github.com/brobertson/rigaudon", "Bruce Robertson and Federico Boschetti. 2017. Large-Scale Optical Character Recognition of Ancient Greek. Mouseion 14, 3, LVIII-Series III (2017), 341--359. DOI:https://doi.org/10.3138/mous.14.3-3", "Bruce Robertson, Christoph Dalitz, and Fabian Schmitt. 2014. Automated page layout simplification of Patrologia Graeca. In Proceedings of the First International Conference on Digital Access to Textual Cultural Heritage, 167--172. DOI:https://doi.org/10.1145/2595188.2595213", "Abdulqawi Saif, Lucas Nussbaum, and Ye-Qiong Song. 2017. Performance Evaluation of MongoDB I/O access patterns. In CLOUD DAYS'2017. Retrieved from https://hal.inria.fr/hal-01793479", "Ole Tange. 2011. GNU Parallel: The Command-Line Power Tool. ;login: (2011), 42--47. DOI:https://doi.org/10.5281/zenodo.16303", "TLG. Thesaurus Linguae Graeca Homepage. Retrieved from http://www.tlg.uci.edu/index.prev.php", "Evagelos Varthis, Marios Poulos, Ilias Yarenis, and Sozon Papavlasopoulos. 2019. A Prototype Web Search Tool for Patrologia Graeca. Retrieved January 1, 2019 from http://patrologia.tk/api/index.html"]}, {"title": "Using lexicography to characterise relations between species mentions in the biodiversity literature", "authors": ["Sandra Young"], "publication": "DATeCH2019: Proceedings of the 3rd International Conference on Digital Access to Textual Cultural Heritage", "abstract": "ABSTRACT\nThe biodiversity literature is one of the longest-standing examples of recording heritage in the world. Today there are many efforts to standardise and integrate the literature to ensure access to the information, both for heritage and research purposes.\nOntologies are increasingly being turned to as knowledge representation tools in these efforts. However, the validity of using ontological frameworks to represent biological taxonomies has been questioned. Biological taxonomies use the scientific nomenclature to assign names to described species. While the nomenclature is a useful classification tool, it can also be a source of confusion because of its synonymous, homonymous and fluid nature. Despite this, no empirical evaluation of scientific nomenclature use in the literature has ever been performed.\nCorpus-based analysis is already used in automatic ontology extraction, and this study explores the possibility of applying recently developed lexicography techniques to the problem to provide an evaluation of the empirical data in the literature, and serve as a comparison with existing ontologies.\nThis paper focuses on the work flow, parameters and preliminary findings of the research investigating how to extract structures from the literature to perform these comparisons. It uses the manipulation of corpus analysis techniques, visualisation and filtering methods to do so and evaluates potential classification and disambiguation qualities of the resulting graphs for future work. Preliminary results look at the effects of frequency and salience when filtering the graphs, which indicate that these filter parameters could be used for different purposes in revealing relationships between organism mentions.", "references": ["Abeer Al-Arfaj and Abdulmalik Al-Salman. 2015. Ontology construction from text: challenges and trends. International Journal of Artificial Intelligence and Expert Systems (IJAE) 6, 2 (2015), 15--26.", "Laurence Anthony. 2017. AntFileConverter (Version 1.2.1) [Computer Software]. http://www.laurenceanthony.net/software", "Daniel A. Schult Aric A. Hagberg and Pieter J. Swart. 2008. Exploring network structure, dynamics, and function using NetworkX. In Proceedings of the 7th Python in Science Conference, Travis Vaught Gäel Varoquaux and Jarrod Millman (Eds.). Pasadena, CA, USA, 11--15.", "Steven J Baskauf and CO Webb. 2016. Darwin-SW: Darwin Core-based terms for expressing biodiversity data as RDF. Semantic Web 7.6 (2016), 629--643. https://doi.org/10.3233/SW-150203", "Christopher Brewster and Yorick Wilks. 2004. Ontologies, Taxonomies, Thesauri: Learning from Texts. The Use of Computational Linguistics in the Extraction of Keyword Information from Digital Library Content Workshop (2004), 1--32.", "Pier Luigi Buttigieg, Norman Morrison, Barry Smith, Christopher J Mungall, Suzanna E Lewis, and ENVO Consortium. 2013. The environment ontology: contextualising biological and biomedical entities. Journal of biomedical semantics 4, 1 (2013), 43. https://doi.org/10.1186/2041-1480-4-43", "Pier Luigi Buttigieg, Evangelos Pafilis, Suzanna E. Lewis, Mark P. Schildhauer, Ramona L. Walls, and Christopher J. Mungall. 2016. The environment ontology in 2016: bridging domains with increased scope, semantic density, and interoperation. Journal of Biomedical Semantics 7, 1 (12 2016). https://doi.org/10.1186/s13326-016-0097-6", "Willem Coetzer, Deshendran Moodley, and Aurona Gerber. 2017. A knowledge-based system for generating interaction networks from ecological data. Data and Knowledge Engineering (2017). https://doi.org/10.1016/j.datak.2017.09.005", "Thierry Fontenelle. 2011. Lexicography. In The Routledge Handbook of Applied Linguistics, James Simpson (Ed.). Routledge. https://doi.org/10.4324/9780203835654.ch4", "Nico M. Franz, Mingmin Chen, Parisa Kianmajd, Shizhuo Yu, Shawn Bowers, Alan S. Weakley, and Bertram Ludäscher. 2016. Names are not good enough: Reasoning over taxonomic change in the Andropogon complex. Semantic Web 7, 6 (2016), 645--667. https://doi.org/10.3233/SW-160220", "Nico M. Franz and David Thau. 2010. Biological taxonomy and ontology development: scope and limitations. Biodiversity Informatics 7, 1 (1 2010), 45--66. https://doi.org/10.17161/bi.v7i1.3927", "Daniel Fuentes and Nicola Fiore. 2014. The LifeWatch approach to the exploration of distributed species information. ZooKeys 463, 463 (1 2014), 133--48. https://doi.org/10.3897/zookeys.463.8397", "GNA. [n. d.]. Global Names Recognition and Discovery. https://gnrd.globalnames.org", "Nancy E. Gwinn and Constance Rinaldo. 2009. The Biodiversity Heritage Library: sharing biodiversity literature with the world. IFLA Journal 35, 1 (3 2009), 25--34. https://doi.org/10.1177/0340035208102032", "Sin-Jae Kang and Jong-Hyeok Lee. 2001. Semi-automatic practical ontology construction by using a thesaurus, computational dictionaries, and large corpora. HLTKM '01 Proceedings of the workshop on Human Language Technology and Knowledge Management 2001, 6 (2001), 1--8. https://doi.org/10.3115/1118220.1118226", "Adam Kilgarriff. 1997. \"I don't believe in word senses\". Computers and the Humanities 31, 2 (1997), 91--113.", "Adam Kilgarriff, VÃ&eng;t Baisa, Jan Bušta, MiloÅą Jakubíček, VojtÄŻch Kovář, Jan Michelfeit, Pavel Rychlý, and VÃ&eng;t Suchomel. 2014. The Sketch Engine: ten years on. Lexicography 1, 2012 (2014), 7--36. https://doi.org/10.1007/s40607-014-0009-9", "Adam Kilgarriff, Pavel Rychly, Pavel Smrz, and David Tugwell. 2004. The Sketch Engine. Proceedings of the Eleventh EURALEX International Congress (2004), 105--116.", "M Koperski, M Sauer, W Braun, and S R Gradstein. 2000. Referenzliste der Moose Deutschlands. In Schriftenreihe für Vegetationskunde. Vol. 34. 519.", "John La Salle, Kristen J Williams, and Craig Moritz. 2016. Biodiversity analysis in the digital era. Philosophical Transactions of the Royal Society of London B: Biological Sciences' 371, 1702 (2016). https://doi.org/10.1098/rstb.2015.0337", "Pilar León-Araúz and Antonio San Martín. 2018. The EcoLexicon Semantic Sketch Grammar: from Knowledge Patterns to Word Sketches. Proceedings of the LREC 2018 Workshop âĂIJGlobalex 2018 âĂŞ Lexicography & WordNetsâĂİ 2013, 2016 (2018), 94--99.", "\"Lexical Computing Ltd.\". 2015. Statistics used in the Sketch Engine., 2 pages. https://www.sketchengine.eu/documentation/statistics-used-in-sketch-engine/", "Diana McCarthy, Adam Kilgarriff, MiloÅą Jakubíček, and Siva Reddy. 2015. Semantic Word Sketches. 8th International Corpus Linguistics Conference (CL 2015) (2015).", "David D Mcdonald. 2008. Lexical Inference and the Problem of the Long Tail. In Association for the Advancement of Artificial Intelligence. 71--73.", "Wes McKinney. 2011. pandas: a Foundational Python Library for Data Analysis and Statistics. In PyHPC.", "William K. Michener and Matthew B. Jones. 2012. Ecoinformatics: Supporting ecology as a data-intensive science. Trends in Ecology and Evolution 27, 2 (2012), 88--93. https://doi.org/10.1016/j.tree.2011.11.016", "Peter E. Midford, Thomas Alex Dececchi, James P. Balhoff, Wasila M. Dahdul, Nizar Ibrahim, Hilmar Lapp, John G. Lundberg, Paula M. Mabee, Paul C. Sereno, Monte Westerfield, Todd J. Vision, and David C. Blackburn. 2013. The vertebrate taxonomy ontology: A framework for reasoning across model organism and species phenotypes. Journal of Biomedical Semantics 4, 1 (2013), 2--7. https://doi.org/10.1186/2041-1480-4-34", "Peter E. et al Midford. [n. d.]. Vertebrate Taxonomy Ontology. http://www.ontobee.org/ontology/VTO", "Tomas Mikolov, Greg Corrado, Kai Chen, and Jeffrey Dean. 2013. Efficient Estimation of Word Representations in Vector Space. CoRR (2013), 1--12.", "Farhad Nooralahzadeh, Lilja Øvrelid, and Jan Tore Lønning. 2018. Evaluation of Domain-specific Word Embeddings using Knowledge Resources. International Conference on Language Resources and Evaluation (2018), 1438--1445. http://www.lrec-conf.org/proceedings/lrec2018/papers.html", "Cynthia S Parr and Anne E Thessen. 2018. Biodiversity Informatics. In Ecological Informatics. 375--399. https://doi.org/10.1007/978-3-319-59928-1", "Cynthia S. Parr, Nathan Wilson, Patrick Leary, Katja Schulz, Kristen Lans, Lisa Walley, Jennifer Hammock, Anthony Goddard, Jeremy Rice, Marie Studer, Jeffrey Holmes, Robert Corrigan, Jr., Jr., and Robert J. Corrigan Jr. 2014. The Encyclopedia of Life v2: Providing Global Access to Knowledge About Life on Earth. Biodiversity Data Journal 2 (5 2014). https://doi.org/10.3897/BDJ.2.e1079", "Jeffrey Pennington, Richard Socher, and Christopher Manning. 2015. Glove: Global Vectors for Word Representation. Empirical Methods in Natural Language Processing (EMNLP) (2015), 1532--1543. https://doi.org/10.3115/v1/d14-1162", "Richard L. Pyle. 2016. Towards a Global Names Architecture: The future of indexing scientific names. ZooKeys 550, 550 (1 2016), 261--281. https://doi.org/10.3897/zookeys.550.10009", "\"Python Core Team\". 2015. Python: A dynamic, open source programming language. https://www.python.org/", "Orrell T. Nicolson D. Bailly N. Kirk P.M. Bourgoin T. DeWalt R.E. Decock W. De Wever A. Nieukerken E. van Zarucchi J. Penev L. Eds. Roskov Y., Abucay L. 2017. Species 2000 & ITIS Catalogue of Life 2017 Annual Checklist. https://doi.org/ISSN2405-884X", "Arpita Roy, Youngja Park, and SHimei Pan. 2017. Learning Domain-Specific Word Embeddings from Sparse Cybersecurity Texts. CoRR (2017). http://arxiv.org/abs/1709.07470", "Pavel Rychlý. 2008. A Lexicographer-Friendly Association Score. Proceedings of Second Workshop on Recent Advances in Slavonic Natural Languages Processing, RASLAN 2008 (2008), 6--9. https://www.fi.muni.cz/usr/sojka/download/raslan2008/13.pdf", "Viktor Senderov, Kiril Simov, Nico Franz, Pavel Stoev, Terry Catapano, Donat Agosti, Guido Sautter, Robert A Morris, and Lyubomir Penev. 2018. OpenBiodiv-O: ontology of the OpenBiodiv knowledge management system. Journal of Biomedical Semantics 9, 5 (2018). https://doi.org/10.1186/s13326-017-0174-5", "Ozier O Baliga NS Wang JT Ramage D Amin N Schwikowski B Ideker T. Shannon P, Markiel A. 2003. Cytoscape: a software environment for integrated models of biomolecular interaction networks. Genome Research 13, 11 (2003), 2498--504.", "Abraham Solomonick. 1996. Towards a Comprehensive Theory of Lexicographic Definitions. In Euralex 1996 Conference Proceedings. 1-8. message: %253C2033B1A9-CA36-4FCA-999D-472038E80504@gmail.com%253E%255Cnpapers3://publication/uuid/CD338514-E505-4B1D-BCBE-1231F5D2F381", "David Thau and Bertram Ludäscher. 2007. Reasoning about taxonomies in first-order logic. Ecological Informatics 2, 3 SPEC. ISS. (2007), 195--209. https://doi.org/10.1016/j.ecoinf.2007.07.005", "Anne Thessen, Jenette Preciado, and Chris Jenkins. 2018. Collaboration between the Natural Sciences and Computational Linguistics: A Discussion of Issues. Technical Report December. https://doi.org/10.13140/RG.2.2.19353.26728", "Anne E. Thessen, Hong Cui, and Dmitry Mozzherin. 2012. Applications of natural language processing in biodiversity science. Advances in Bioinformatics 2012 (2012). https://doi.org/10.1155/2012/391574", "Gaurav Vaidya, Denis Lepage, and Robert Guralnick. 2018. The tempo and mode of the taxonomic correction process: How taxonomists have corrected and recorrected North American bird species over the last 127 years. PLoS ONE 13, 4 (2018), 1--19. https://doi.org/10.1371/journal.pone.0195736", "Ramona L. Walls, John Deck, Robert P. Guralnick, Steven J. Baskauf, Reed S. Beaman, Stanley Blum, Shawn Bowers, Pier Luigi Buttigieg, Neil Davies, Dag Endresen, Maria Alejandra Gandolfo, Robert Hanner, Alyssa Janning, Leonard Krishtalka, AndrÃľa Matsunaga, Peter Midford, Norman Morrison, ÃL'amonn ÃŞ. Tuama, Mark P. Schildhauer, Barry Smith, Brian J. Stucky, Andrea K. Thomer, John R. Wieczorek, Jamie Whitacre, and John Wooley. 2014. Semantics in Support of Biodiversity Knowledge Discovery: An Introduction to the Biological Collections Ontology and Related Ontologies. PLoS ONE 9, 3 (3 2014). https://doi.org/10.1371/journal.pone.0089606", "Ramona L Walls, Robert Guralnick, John Deck, Adam Buntzman, Pier L Buttigieg, Neil Davies, Michael W Denslow, Rachel E Gallery, J J Parnell, David Osumi-Sutherland, Robert J Robbins, Philippe Rocca-Serra, John Wieczorek, and Jie Zheng. 2014. Meeting report: advancing practical applications of biodiversity ontologies. Standards in Genomic Sciences 9, 1 (12 2014), 17. https://doi.org/10.1186/1944-3277-9-17", "\"Wiley Online Library\". 2019. Wiley Text and Data Mining Agreement - Wiley Online Library. http://olabout.wiley.com/WileyCDA/Section/id-826542.html"]}, {"title": "Automatic Reconstruction of Emperor Itineraries from the Regesta Imperii", "authors": ["Juri Opitz\n,", "Leo Born\n,", "Vivi Nastase\n,", "Yannick Pultar"], "publication": "DATeCH2019: Proceedings of the 3rd International Conference on Digital Access to Textual Cultural Heritage", "abstract": "ABSTRACT\nHistoric itinerary research investigates the traveling paths of historic entities, to determine their influence and reach. A potential source of such information are the Regesta Imperii (RI), a large-scale resource for European medieval history research. However, two important intermediate problems must be addressed: 1. place names may be stated as unknown or are left empty; 2., place name queries return large candidate sets of points scattered all across Europe and the correct point must be selected. For 1., we perform a place name completion step to predict place names for regests referencing charters of unknown origin. To address 2., we formulate a graph framework which allows efficient reconstruction of the emperors' itineraries by means of shortest path finding algorithms. Our experiments show that our method predicts coordinates of places with significant correlation to human gold coordinates and significantly outperforms a baseline which selects points randomly from the candidate sets. We further show that the method can be leveraged to detect errors in human coordinate labels of place names.", "references": ["E. W. Dijkstra. 1959. A Note on Two Problems in Connexion with Graphs. Numer. Math. 1, 1 (Dec. 1959), 269--271. https://doi.org/10.1007/BF01386390", "Michael L Fredman and Robert Endre Tarjan. 1987. Fibonacci heaps and their uses in improved network optimization algorithms. Journal of the ACM (JACM) 34, 3 (1987), 596--615.", "Markus John, Christian Richter, Steffen Koch, Andreas Kuczera, and Thomas Ertl. 2017. Interactive Visual Exploration of the Regesta Imperii.. In Digital Humanities 2017 Conference Abstracts.", "Andreas Kuczera. 2015. Graphdatenbanken für Historiker. Netzwerke in den Registern der Regesten Kaiser Friedrichs III. mit neo4j und Gephi. Mittelalter. Interdisziplinäre Forschung und Rezeptionsgeschichte (2015).", "Andreas Kuczera. 2018. Graphentechnologien in den Digitalen Geisteswissenschaften. Modellierung, Import, Exploration (Online-Publikation unter https://kuczera.github.io/Graphentechnologien/). Vol. 1. Andreas Kuczera.", "Juri Opitz, Leo Born, and Vivi Nastase. 2018. Induction of a Large-Scale Knowledge Graph from the Regesta Imperii. In Proceedings of the Second Joint SIGHUM Workshop on Computational Linguistics for Cultural Heritage, Social Sciences, Humanities and Literature. 159--168.", "Juri Opitz and Anette Frank. 2016. Deriving Players & Themes in the Regesta Imperii using SVMs and Neural Networks. In Proceedings of the 10th SIGHUM Workshop on Language Technology for Cultural Heritage, Social Sciences, and Humanities. 74--83.", "Thaddeus Vincenty. 1975. Direct and inverse solutions of geodesics on the ellipsoid with application of nested equations. Survey review 23, 176 (1975), 88--93."]}, {"title": "A New Strategy for Arabic OCR: Archigraphemes, Letter Blocks, Script Grammar, and shape synthesis", "authors": ["Thomas Milo\n,", "Alicia González Martínez"], "publication": "DATeCH2019: Proceedings of the 3rd International Conference on Digital Access to Textual Cultural Heritage", "abstract": "ABSTRACT\nCurrent OCR has limited capability for Arabic because of script models lacking scientific basis. We propose a new OCR strategy for Arabic, based on 1. Islamic script grammar including extended shaping and 2. treating Arabic script as a multi-layered writing system.\nWe analyse Arabic script as an allographic rendering of graphemic abstractions. Grapheme is a term adapted from phonology; it is analogous to the term phoneme. In phonology, the smallest functional unit of sound is the phoneme. This is not heard, but perceived. What one hears are contextually conditioned allophones. In Arabic orthography, the smallest functional unit of spelling is the grapheme. This is not seen, but perceived. What one sees are contextually conditioned allographs.\nIn our analysis, the letter block is the minimum unit of Arabic script formation and therefore of script grammar. A letter block is a single allograph or of a group of fused allographs surrounded by graphic space. The analogy with phonology can be pushed further: the archiphoneme is a bundle of shared features between two or more phonemes, minus their distinctive features. The archigrapheme is the bundle of shared features between two or more graphemes, minus their distinctive features. An archigraphemic letter block consists of one or more reduced allographs between spaces. The letter block follows the base line. There can be ligatures between letter blocks. In our strategy the archigraphemic letter block also forms the minimum unit of OCR. We have\n(1) implemented an algorithm that reduces any Unicode text in Arabic script to archigraphemes and we used it to create a list in Unicode format of all attested unique archigraphemic letter blocks on the internet.\n(2) With this list, and applying extended Islamic script grammar, we can synthesize realistic images of all possible archigraphemic fusions in a given style.\nThese two developments make it possible to create an OCR system for recognizing synthetic Arabic under controlled conditions for both basic and extended shaping in a given style. These two steps result in competence, after which the OCR system should be trained to apply tolerance for the variation of performance in real documents. To interpret the identified letter blocks linguistically, a technique for the parsing of archigraphemes must be developed. For example, the single sequence of the three archigraphemic letter blocks EBD A LLH can be interpreted as several different surface texts such as abda-n li llaahi, abdu l-laahi and inda l-laahi. To facilitate the linguistic phase of the process, the same list of unique archigraphemic letter blocks is designed to identify the language of the text under scrutiny. In this phase we can present\n• Islamic script synthesis\n• Unicode conversion from plene orthography to archigraphemic transliteration\n• the archigraphemic search algorithm\n• the list of unique archigraphemic letter blocks\n• samples of authentic shape generation\nThese are the first steps towards static OCR technology. The next step is to create or find matching AI software to teach OCR to recognize any unmapped letter blocks in order to make the OCR dynamic.", "references": ["Clive Holes. 2004. Modern Arabic Structures, Functions, and Varieties. 396--396 pages.", "Alicia González Martínez and Tillmann Feige. 2017. Herausforderungen in der Nutzung vorhandener Tools für arabische Daten. In Conference abstracts DHd 2017 Digitale Nachhaltigkeit. Bern, Switzerland, 67--70.", "Alicia González Martínez, Tillmann Feige, and Thomas Eich. 2017. Clear-cut methodology for Arabic OCR and post-correction with low technical skilled annotators. In Proceedings of the 2nd International Conference on Digital Access to Textual Cultural Heritage. Gttingen, Germany, 67--70.", "Matthew Thomas Miller, Maxim G. Romanov, and Sarah Bowen Savant. 2018. Digitizing the Textual Heritage of the Premodern Islamicate World: Principles and Plans. International Journal of Middle East Studies 50, 1 (February 2018), 103--109.", "Thomas Milo. 2002. A Brief Historical Overview, in Language Culture, Type International Type Design in the Age of Unicode. Chapter Arabic Script and Typography, 123--123.", "Thomas Milo. 2002. Writings and Writing, Investigations in Islamic Text and Script in Honour of Januarius Justus Witkam. Chapter Towards Arabic Historical Script Grammar Through Contrastive Analysis of Qurn Manuscripts, 249--292.", "T.F Mitchell. 1953. Writing Arabic - A Practical Introductions to Ruqah Script.", "Titus Nemeth. 2017. Arabic Type-Making in the Machine Age The Influence of Technology on the Form of Arabic Type, 1908-1993. Number 410--434.", "W. Wright. 1859. A Grammar of the Arabic Language."]}, {"title": "Dynamic Source Weight Computation for Truth Inference over Data Streams", "authors": ["Yi Yang\n,", "Quan Bai\n,", "Qing Liu"], "publication": "AAMAS '19: Proceedings of the 18th International Conference on Autonomous Agents and MultiAgent Systems", "abstract": "ABSTRACT\nTruth inference, a method that resolves conflicts among multi-agent data, has been widely studied in the field of AI. Most existing truth inference methods use iterative approaches to achieve high accuracy, but are inefficient to infer object truths over data streams. The methods developed for streaming data can achieve high efficiency but suffer from low accuracy. In this paper, we propose a novel truth inference method, Dynamic Source Weight Computation truth inference (DSWC), that can work with a wide range of iterative-based truth inference methods to dynamically compute source weights over data streams. Specifically, we use Taylor expansion to analyze the unit error of object truths inferred by source weights computed at a previous timestamp. If the source weight at present is predicted to be able to limit the error under a threshold, we use the source weights computed previously to approximate object truths at present to avoid the expensive source weight computation step. Compared with the existing work, the proposed method is more effective in predicting source weights and can be applied to a wider range of applications. Experimental results based on four real-world datasets demonstrate that DSWC is both accurate and efficient for truth inference over data streams.", "references": ["Charu C Aggarwal. 2013. Managing and mining sensor data. Springer Science & Business Media.", "Alexander Philip Dawid and Allan M Skene. 1979. Maximum likelihood estimation of observer error-rates using the EM algorithm. Applied statistics (1979), 20--28.", "Gianluca Demartini, Djellel Eddine Difallah, and Philippe Cudré-Mauroux. 2012. ZenCrowd: leveraging probabilistic reasoning and crowdsourcing techniques for large-scale entity linking. In Proceedings of the 21st international conference on World Wide Web. ACM, 469--478.", "Xin Dong, Evgeniy Gabrilovich, Geremy Heitz, Wilko Horn, Ni Lao, Kevin Murphy, Thomas Strohmann, Shaohua Sun, and Wei Zhang. 2014. Knowledge vault: A web-scale approach to probabilistic knowledge fusion. In Proceedings of the 20th ACM SIGKDD international conference on Knowledge discovery and data mining. ACM, 601--610.", "Xin Luna Dong, Laure Berti-Equille, Yifan Hu, and Divesh Srivastava. 2010. Global detection of complex copying relationships between sources. Proceedings of the VLDB Endowment 3, 1--2 (2010), 1358--1369.", "Xin Luna Dong, Evgeniy Gabrilovich, Geremy Heitz, Wilko Horn, Kevin Murphy, Shaohua Sun, and Wei Zhang. 2014. From data fusion to knowledge fusion. Proceedings of the VLDB Endowment 7, 10 (2014), 881--892.", "Xin Luna Dong, Evgeniy Gabrilovich, Kevin Murphy, Van Dang, Wilko Horn, Camillo Lugaresi, Shaohua Sun, andWei Zhang. 2015. Knowledge-based trust: Estimating the trustworthiness of web sources. Proceedings of the VLDB Endowment 8, 9 (2015), 938--949.", "Alban Galland, Serge Abiteboul, Amélie Marian, and Pierre Senellart. 2010. Corroborating information from disagreeing views. In Proceedings of the third ACM international conference on Web search and data mining. ACM, 131--140.", "Furong Li, Mong Li Lee, and Wynne Hsu. 2014. Entity profiling with varying source reliabilities. In Proceedings of the 20th ACM SIGKDD international conference on Knowledge discovery and data mining. ACM, 1146--1155.", "Qi Li, Yaliang Li, Jing Gao, Lu Su, Bo Zhao, Murat Demirbas, Wei Fan, and Jiawei Han. 2014. A confidence-aware approach for truth discovery on long-tail data. Proceedings of the VLDB Endowment 8, 4 (2014), 425--436.", "Qi Li, Yaliang Li, Jing Gao, Bo Zhao, Wei Fan, and Jiawei Han. 2014. Resolving conflicts in heterogeneous data by truth discovery and source reliability estimation. In Proceedings of the 2014 ACM SIGMOD international conference on Management of data. ACM, 1187--1198.", "Tianyi Li, Yu Gu, Xiangmin Zhou, Qian Ma, and Ge Yu. 2017. An Effective and Efficient Truth Discovery Framework over Data Streams.. In EDBT. 180--191.", "Xian Li, Xin Luna Dong, Kenneth Lyons, Weiyi Meng, and Divesh Srivastava. 2012. Truth finding on the deep web: Is the problem solved?. In Proceedings of the VLDB Endowment, Vol. 6. VLDB Endowment, 97--108.", "Yaliang Li, Jing Gao, Chuishi Meng, Qi Li, Lu Su, Bo Zhao, Wei Fan, and Jiawei Han. 2016. A survey on truth discovery. Acm Sigkdd Explorations Newsletter 17, 2 (2016), 1--16.", "Yaliang Li, Qi Li, Jing Gao, Lu Su, Bo Zhao,Wei Fan, and Jiawei Han. 2015. On the discovery of evolving truth. In Proceedings of the 21th ACM SIGKDD International Conference on Knowledge Discovery and Data Mining. ACM, 675--684.", "Yaliang Li, Qi Li, Jing Gao, Lu Su, Bo Zhao, Wei Fan, and Jiawei Han. 2016. Conflicts to harmony: A framework for resolving conflicts in heterogeneous data by truth discovery. IEEE Transactions on Knowledge and Data Engineering 28, 8 (2016), 1986--1999.", "Subhabrata Mukherjee, Gerhard Weikum, and Cristian Danescu-Niculescu-Mizil. 2014. People on drugs: credibility of user statements in health communities. In Proceedings of the 20th ACM SIGKDD international conference on Knowledge discovery and data mining. ACM, 65--74.", "Robin Wentao Ouyang, Mani Srivastava, Alice Toniolo, and Timothy J Norman. 2016. Truth discovery in crowdsourced detection of spatial events. IEEE transactions on knowledge and data engineering 28, 4 (2016), 1047--1060.", "Carl Edward Rasmussen. 2004. Gaussian processes in machine learning. In Advanced lectures on machine learning. Springer, 63--71.", "Vikas C Raykar, Shipeng Yu, Linda H Zhao, Gerardo Hermosillo Valadez, Charles Florin, Luca Bogoni, and Linda Moy. 2010. Learning from crowds. Journal of Machine Learning Research 11, Apr (2010), 1297--1322.", "Theodoros Rekatsinas, Xin Luna Dong, and Divesh Srivastava. 2014. Characterizing and selecting fresh data sources. In Proceedings of the 2014 ACM SIGMOD international conference on Management of data. ACM, 919--930.", "Dong Wang, Lance Kaplan, Hieu Le, and Tarek Abdelzaher. 2012. On truth discovery in social sensing: A maximum likelihood estimation approach. In Proceedings of the 11th international conference on Information Processing in Sensor Networks. ACM, 233--244.", "Yi Yang, Quan Bai, and Qing Liu. 2018. On the Discovery of Continuous Truth: A Semi-supervised Approach with Partial Ground Truths. In International Conference on Web Information Systems Engineering. Springer, 424--438.", "Yi Yang, Quan Bai, and Qing Liu. 2019. A probabilistic model for truth discovery with object correlations. Knowledge-Based Systems 165 (2019), 360--373.", "Liuyi Yao, Lu Su, Qi Li, Yaliang Li, Fenglong Ma, Jing Gao, and Aidong Zhang. 2018. Online Truth Discovery on Time Series Data. In Proceedings of the 2018 SIAM International Conference on Data Mining. SIAM, 162--170.", "Xiaoxin Yin, Jiawei Han, and S Yu Philip. 2008. Truth discovery with multiple conflicting information providers on the web. IEEE Transactions on Knowledge and Data Engineering 20, 6 (2008), 796--808.", "Dian Yu, Hongzhao Huang, Taylor Cassidy, Heng Ji, Chi Wang, Shi Zhi, Jiawei Han, Clare Voss, and Malik Magdon-Ismail. 2014. The wisdom of minority: Unsupervised slot filling validation based on multi-dimensional truth-finding. In Proceedings of COLING 2014, the 25th International Conference on Computational Linguistics: Technical Papers. 1567--1578.", "Bo Zhao and Jiawei Han. 2012. A probabilistic model for estimating real-valued truth from conflicting sources. Proc. of QDB (2012).", "Bo Zhao, Benjamin IP Rubinstein, Jim Gemmell, and Jiawei Han. 2012. A bayesian approach to discovering truth from conflicting sources for data integration. Proceedings of the VLDB Endowment 5, 6 (2012), 550--561.", "Yudian Zheng, Guoliang Li, Yuanbing Li, Caihua Shan, and Reynold Cheng. 2017. Truth inference in crowdsourcing: is the problem solved? Proceedings of the VLDB Endowment 10, 5 (2017), 541--552."]}, {"title": "Your 2 is My 1, Your 3 is My 9: Handling Arbitrary Miscalibrations in Ratings", "authors": ["Jingyan Wang\n,", "Nihar B. Shah"], "publication": "AAMAS '19: Proceedings of the 18th International Conference on Autonomous Agents and MultiAgent Systems", "abstract": "ABSTRACT\nA key step in building multi-agent systems is to gather data reported by the agents (people), in either cardinal (numeric ratings) or ordinal (rankings) form. Cardinal scores collected from people are well known to suffer from miscalibrations. A popular approach to address this issue is to assume simplistic models of miscalibration (such as linear biases) to de-bias the scores. This approach, however, often fares poorly because people's miscalibrations are typically far more complex and not well understood. It is widely believed that in the absence of simplifying assumptions on the miscalibration, the only useful information in practice from the cardinal scores is the induced ranking. In this paper we address the fundamental question of whether this widespread folklore belief is actually true. We consider cardinal scores with arbitrary (or even adversarially chosen) miscalibrations that is only required to be consistent with the induced ranking. We design rating-based estimators and prove that despite making no assumptions on the ratings, they strictly and uniformly outperform all possible estimators that rely on only the ranking. These estimators can be used as a plug-in to show the superiority of cardinal scores over ordinal rankings for a variety of applications, and we provide examples for A/B testing and ranking as a proof of concept. Our results thus provide novel fundamental insights in the eternal debate between cardinal and ordinal data.", "references": ["Ammar Ammar and Devavrat Shah. 2012. Efficient rank aggregation using partial data. In SIGMETRICS/PERFORMANCE Joint International Conference on Measurement and Modeling of Computer Systems. 355--366.", "Yukino Baba and Hisashi Kashima. 2013. Statistical Quality Estimation for General Crowdsourcing Tasks. In ACM SIGKDD International Conference on Knowledge Discovery and Data Mining. 554--562.", "Michel Balinski and Rida Laraki. 2007. A theory of measuring, electing, and ranking. Proceedings of the National Academy of Sciences, Vol. 104, 21, 8720--8725.", "A. J. Baranchik. 1970. A Family of Minimax Estimators of the Mean of a Multivariate Normal Distribution. Ann. Math. Statist., Vol. 41, 2 (1970), 642--645.", "Jacob P. Baskin and Shriram Krishnamurthi. 2009. Preference aggregation in group recommender systems for committee decision-making. In ACM Conference on Recommender Systems, RecSys. 337--340.", "Salem Benferhat, Sylvain Lagrue, and Julien Rossit. 2007. An Egalitarist Fusion of Incommensurable Ranked Belief Bases under Constraints. In AAAI Conference on Artificial Intelligence. 367--372.", "Salem Benferhat, Sylvain Lagrue, and Julien Rossit. 2009. An Analysis of Sum-Based Incommensurable Belief Base Merging. In International Conference on Scalable Uncertainty Management. 55--67.", "M. E. Bock. 1975. Minimax Estimators of the Mean of a Multivariate Normal Distribution. Ann. Statist., Vol. 3, 1 (1975), 209--218.", "Wade D. Cook, Boaz Golany, Michal Penn, and Tal Raviv. 2007. Creating a consensus ranking of proposals from reviewers' partial ordinal rankings. Computers & Operations Research, Vol. 34, 4 (2007), 954--965.", "Thomas M. Cover. 1987. Pick the Largest Number .Springer New York, New York, NY, 152--152.", "Sanjoy Dasgupta, Christos H. Papadimitriou, and Umesh Vazirani. 2008. Algorithms 1 ed.). McGraw-Hill, Inc.", "John R Douceur. 2009. Paper rating vs. paper ranking. ACM SIGOPS Operating Systems Review, Vol. 43, 2 (2009), 117--121.", "Cynthia Dwork, Ravi Kumar, Moni Naor, and D. Sivakumar. 2001. Rank Aggregation Methods for the Web. In International Conference on World Wide Web. 613--622.", "Peter A. Flach, Sebastian Spiegler, Bruno Golénia, Simon Price, John Guiver, Ralf Herbrich, Thore Graepel, and Mohammed J. Zaki. 2010. Novel Tools to Streamline the Conference Review Process: Experiences from SIGKDD'09. SIGKDD Explor. Newsl., Vol. 11, 2 (2010), 63--67.", "Yoav Freund, Raj D. Iyer, Robert E. Schapire, and Yoram Singer. 2003. An Efficient Boosting Algorithm for Combining Preferences. Journal of Machine Learning Research, Vol. 4 (2003), 933--969.", "Hong Ge, Max Welling, and Zoubin Ghahramani. 2013. A Bayesian model for calibrating conference review scores. (2013). http://mlg.eng.cam.ac.uk/hong/unpublished/nips-review-model.pdf {Online; accessed 03/01/2019}.", "Alexander Gnedin. 2016. Guess the Larger Number. preprint arXiv:1608.01899 (2016).", "Dale Griffin and Lyle Brenner. 2008. Perspectives on Probability Judgment Calibration .Wiley-Blackwell, Chapter 9, 177--199.", "Anne-Wil Harzing, Joyce Baldueza, Wilhelm Barner-Rasmussen, Cordula Barzantny, Anne Canabal, Anabella Davila, Alvaro Espejo, Rita Ferreira, Axele Giroud, Kathrin Koester, et almbox. 2009. Rating versus ranking: What is the best way to reduce response and language bias in cross-national research? International Business Review, Vol. 18, 4 (2009), 417--432.", "William James and Charles Stein. 1961. Estimation with quadratic loss. In Proceedings of the fourth Berkeley symposium on mathematical statistics and probability, Vol. 1. 361--379.", "John Langford. 2012. ICML acceptance statistics. (2012). http://hunch.net/?p=2517 {Online; accessed 05/14/2018}.", "R. S. MacKay, R. Kenna, R. J. Low, and S. Parker. 2017. Calibration with confidence: a principled method for panel assessment. Royal Society Open Science, Vol. 4, 2 (2017).", "Mark D. McDonnell and Derek Abbott. 2009. Randomized switching in the two-envelope problem. Proceedings of the Royal Society of London A: Mathematical, Physical and Engineering Sciences. The Royal Society, 3309--3322.", "Ioannis Mitliagkas, Aditya Gopalan, Constantine Caramanis, and Sriram Vishwanath. 2011. User rankings from comparisons: Learning permutations in high dimensions. In Allerton Conference on Communication, Control, and Computing. 1143--1150.", "Sahand Negahban, Sewoong Oh, and Devavrat Shah. 2012. Iterative ranking from pair-wise comparisons. In Advances in Neural Information Processing Systems. 2474--2482.", "Ritesh Noothigattu, Nihar B. Shah, and Ariel Procaccia. 2018. Choosing how to choose papers. arXiv preprint arxiv:1808.09057 (2018).", "António Osório. 2017. Judgement and ranking: living with hidden bias. Annals of Operations Research, Vol. 253, 1 (2017), 501--518.", "S. R. Paul. 1981. Bayesian methods for calibration of examiners. Brit. J. Math. Statist. Psych., Vol. 34, 2 (1981), 213--223.", "Chris Piech, Jonathan Huang, Zhenghao Chen, Chuong Do, Andrew Ng, and Daphne Koller. 2013. Tuned models of peer assessment in MOOCs. preprint arXiv:1307.2579 (2013).", "Robin S. Poston. 2008. Using and fixing biased rating schemes. Commun. ACM, Vol. 51, 9 (2008), 105--109.", "Ariel D. Procaccia, Nisarg Shah, and Yair Zick. 2016. Voting rules as error-correcting codes. Artif. Intell., Vol. 231 (2016), 1--16.", "Guilin Qi, Weiru Liu, and David A. Bell. 2006. Merging Stratified Knowledge Bases under Constraints. In AAAI Conference on Artificial Intelligence. 281--286.", "Arun Rajkumar, Suprovat Ghoshal, Lek-Heng Lim, and Shivani Agarwal. 2015. Ranking from stochastic pairwise preferences: Recovering Condorcet winners and tournament solution sets at the top. In International Conference on Machine Learning. 665--673.", "Herbert Robbins. 1956. An empirical Bayes approach to statistics. In Proceedings of the Third Berkeley Symposium on Mathematical Statistics and Probability, Vol. 1. 157--163.", "Milton Rokeach. 1968. The Role of Values in Public Opinion Research. Public Opinion Quarterly, Vol. 32, 4 (1968), 547--559.", "Magnus Roos, Jörg Rothe, and Björn Scheuermann. 2011. How to Calibrate the Scores of Biased Reviewers by Quadratic Programming. In AAAI Conference on Artificial Intelligence .", "Nihar B. Shah, Sivaraman Balakrishnan, Joseph Bradley, Abhay Parekh, Kannan Ramchandran, and Martin J. Wainwright. 2016. Estimation from pairwise comparisons: Sharp minimax bounds with topology dependence. Journal of Machine Learning Research, Vol. 17, 1 (2016), 2049--2095.", "Nihar B. Shah, Joseph K Bradley, Abhay Parekh, Martin Wainwright, and Kannan Ramchandran. 2013. A case for ordinal peer-evaluation in MOOCs. In NIPS Workshop on Data Driven Education .", "Nihar B. Shah, Behzad Tabibian, Krikamol Muandet, Isabelle Guyon, and Ulrike Von Luxburg. 2017. Design and Analysis of the NIPS 2016 Review Process. preprint arXiv:1708.09794 (2017).", "Nihar B. Shah and Martin J. Wainwright. 2018. Simple, Robust and Optimal Ranking from Pairwise Comparisons. Journal of Machine Learning Research (2018).", "Charles Stein. 1956. Inadmissibility of the usual estimator for the mean of a multivariate normal distribution. In Proceedings of the Third Berkeley Symposium on Mathematical Statistics and Probability, Vol. 1. 197--206.", "Ivan Stelmakh, Nihar B. Shah, and Aarti Singh. 2019. PeerReview4All: Fair and Accurate Reviewer Assignment in Peer Review. In Algorithmic Learning Theory .", "Kevin Tian, Weihao Kong, and Gregory Valiant. 2017. Learning Populations of Parameters. In Advances in Neural Information Processing Systems. 5778--5787.", "Jingyan Wang and Nihar B. Shah. 2018. Your 2 is My 1, Your 3 is My 9: Handling Arbitrary Miscalibrations in Ratings. preprint arXiv:1806.05085 (2018).", "Larry Wasserman. 2010. All of Statistics: A Concise Course in Statistical Inference .Springer Publishing Company, Incorporated.", "Yichong Xu, Han Zhao, Xiaofei Shi, and Nihar B. Shah. 2018. On Strategyproof Conference Review. arXiv preprint arxiv:1806.06266 (2018).", "H. P. Young. 1988. Condorcet's Theory of Voting. American Political Science Review, Vol. 82, 4 (1988), 1231--1244."]}, {"title": "Rethinking the Neutrality Axiom in Judgment Aggregation", "authors": ["Zoi Terzopoulou\n,", "Ulle Endriss"], "publication": "AAMAS '19: Proceedings of the 18th International Conference on Autonomous Agents and MultiAgent Systems", "abstract": "ABSTRACT\nWhen aggregating the judgments of a group of agents, an important consideration concerns the fairness of the aggregation process. This is the fundamental idea behind the neutrality axiom in social choice theory: if two judgments enjoy the same support amongst the agents, either both or neither of them should be part of the collective decision. This is a reasonable requirement in many scenarios, but we argue that for scenarios in which agents are asked to judge very diverse kinds of propositions, the classical neutrality axiom is much too strong. We thus propose a family of weaker neutrality axioms, parametrised by binary relations between the propositions.", "references": ["Dorothea Baumeister, Gábor Erdélyi, and Jörg Rothe. 2016. Judgment Aggregation. Economics and Computation, Jörg Rothe (Ed.). Springer.", "Marco Costantini, Carla Groenland, and Ulle Endriss. 2016. Judgment Aggregation under Issue Dependencies. In Proceedings of the 30th AAAI Conference on Artificial Intelligence (AAAI). 468--474.", "Franz Dietrich and Christian List. 2007. Arrow's Theorem in Judgment Aggregation. Social Choice and Welfare, Vol. 29, 1 (2007), 19--33.", "Franz Dietrich and Christian List. 2008. Judgment Aggregation without Full Rationality. Social Choice and Welfare, Vol. 31, 1 (2008), 15--39.", "Franz Dietrich and Christian List. 2010. The Impossibility of Unbiased Judgment Aggregation. Theory and Decision, Vol. 68, 3 (2010), 281--299.", "Ulle Endriss. 2016. Judgment Aggregation. Handbook of Computational Social Choice, Felix Brandt, Vincent Conitzer, Ulle Endriss, Jérôme Lang, and Ariel D. Procaccia (Eds.). Cambridge University Press.", "Davide Grossi and Gabriella Pigozzi. 2014. Judgment Aggregation: A Primer. Synthesis Lectures on Artificial Intelligence and Machine Learning, Vol. 8. Morgan & Claypool Publishers. 1--151 pages.", "John Kemeny. 1959. Mathematics Without Numbers. Daedalus, Vol. 88 (1959), 577--591.", "Christian List. 2012. The Theory of Judgment Aggregation: An Introductory Review. Synthese, Vol. 187, 1 (2012), 179--207.", "Christian List and Philip Pettit. 2002. Aggregating Sets of Judgments: An Impossibility Result. Economics and Philosophy, Vol. 18, 1 (2002), 89--110.", "Christian List and Clemens Puppe. 2009. Judgment Aggregation: A Survey. Handbook of Rational and Social Choice, Paul Anand, Prasanta Pattanaik, and Clemens Puppe (Eds.). Oxford University Press.", "Marija Slavkovik. 2014. Not all Judgment Aggregation Should be Neutral. In Proceedings of the 2nd European Conference on Social Intelligence (ECSI). 198--211."]}, {"title": "DeepAggregation: A New Approach for Aggregating Incomplete Ranked Lists using Multi-Layer Graph Embedding", "authors": ["Rohith Dwarakanath Vallam\n,", "Ramasuri Narayanam\n,", "Srikanth G. Tamilselvam\n,", "Nicholas Mattei\n,", "Sudhanshu S. Singh\n,", "Shweta Garg\n,", "Gyana R. Parija"], "publication": "AAMAS '19: Proceedings of the 18th International Conference on Autonomous Agents and MultiAgent Systems", "abstract": "ABSTRACT\nPreference aggregation, and specifically rank aggregation, is a well known problem in the fields of computational social choice and preference handling with broad application including web search and recommendation systems. Inspired by the recent advances in the area of deep neural representation learning, for the first time in the literature, in this paper we leverage unsupervised deep learning techniques - especially graph embeddings - for aggregating a collection of incomplete rank lists and accordingly we develop an algorithm called DeepAggregation. It takes as input a set of incomplete rank lists and constructs a multi-layer graph wherein the nodes are the alternatives that are ranked and the edges capture information contained in the incomplete rank lists. We then compute deep neural representation vectors (i.e. embeddings) for the nodes and then derive the aggregated order using these representation vectors. Our proposed algorithm can handle incomplete rank lists with or without ties. We conduct thorough empirical analysis of the proposed DeepAggregation algorithm using various real life data sets such as TripAdvisor reviews data. We empirically observe that DeepAggregation generates impressive results in comparison with a number of well-known state-of-the-art preference aggregation methods.", "references": ["Nir Ailon. 2010. Aggregation of Partial Rankings, p-Ratings and Top-m Lists. Algorithmica, Vol. 57, 2 (2010), 284--300.", "Kenneth J. Arrow. 1951. Social Choice and Individual Values .Wiley, New York.", "Y. Bengio, A. Courville, and P. Vincent. 2013. Representation Learning: A Review and New Perspectives. IEEE Transactions on Pattern Analysis and Machine Intelligence, Vol. 35, 8 (2013), 1798--1828.", "Felix Brandt, Vincent Conitzer, Ulle Endriss, Jérôme Lang, and Ariel D. Procaccia. 2016. Handbook of Computational Social Choice. Cambridge University Press, New York, USA.", "Moni Naor D. Sivakumar Cynthia Dwork, Ravi Kumar. 2001. Rank aggregation methods for the Web. In Proceedings of WWW. 613--622.", "Aditya Grover and Jure Leskovec. 2016. node2vec: Scalable feature learning for networks. Proceedings of the 22nd ACM SIGKDD international conference on Knowledge discovery and data mining. ACM, 855--864.", "C. A. Tovey J. Bartholdi and M. A. Trick. 1989. Voting schemes for which it can be difficult to tell who won the election. Social Choice and Welfare, Vol. 6 (1989), 157--165.", "John Kemeny. 1959. Mathematics without numbers. Daedalus, Vol. 88 (1959), 577--591.", "Jon Kleinberg. 1999. Authoritative sources in a hyperlinked environment. J. ACM, Vol. 46, 5 (1999), 604--632.", "Ravi Kumar and Sergei Vassilvitskii. 2010. Generalized distances between rankings. In Proceedings of WWW. 571--580.", "Nicholas Mattei and Toby Walsh. {n. d.}. PrefLib: A Library for Preferences. ({n. d.}). http://www.preflib.org/", "Bryan Perozzi, Rami Al-Rfou, and Steven Skiena. 2014. Deepwalk: Online learning of social representations. In Proceedings of the 20th ACM SIGKDD international conference on Knowledge discovery and data mining. ACM, 701--710.", "A. Popova, M. Regenwetter, and N. Mattei. 2013. A Behavioral Perspective on Social Choice. Annals of Mathematics and Artificial Intelligence, Vol. 68, 1--3 (2013), 135--160.", "Mohammad Mahdian D. Sivakumar Erik Vee Ronald Fagin, Ravi Kumar. 2006. Comparing Partial Rankings. SIAM J. Discrete Math., Vol. 20, 3 (2006), 628--648.", "D. Sculley. 2007. Rank Aggregation for Similar Items. In Proceedings of the 7th SIAM International Conference on Data Mining (SDM). 587--592.", "H.P. Young. 1974. An axiomatization of Borda's rule. Journal of Economic Theory, Vol. 9, 43 (1974), 43--52."]}, {"title": "A Survey of Opinion Mining in Arabic: A Comprehensive System Perspective Covering Challenges and Advances in Tools, Resources, Models, Applications, and Visualizations", "authors": ["Gilbert Badaro\n,", "Ramy Baly\n,", "Hazem Hajj\n,", "Wassim El-Hajj\n,", "Khaled Bashir Shaban\n,", "Nizar Habash\n,", "Ahmad Al-Sallab\n,", "Ali Hamdi"], "publication": "ACM Transactions on Asian and Low-Resource Language Information Processing", "abstract": "Abstract\nOpinion-mining or sentiment analysis continues to gain interest in industry and academics. While there has been significant progress in developing models for sentiment analysis, the field remains an active area of research for many languages across the world, and in particular for the Arabic language, which is the fifth most-spoken language and has become the fourth most-used language on the Internet. With the flurry of research activity in Arabic opinion mining, several researchers have provided surveys to capture advances in the field. While these surveys capture a wealth of important progress in the field, the fast pace of advances in machine learning and natural language processing (NLP) necessitates a continuous need for a more up-to-date literature survey. The aim of this article is to provide a comprehensive literature survey for state-of-the-art advances in Arabic opinion mining. The survey goes beyond surveying previous works that were primarily focused on classification models. Instead, this article provides a comprehensive system perspective by covering advances in different aspects of an opinion-mining system, including advances in NLP software tools, lexical sentiment and corpora resources, classification models, and applications of opinion mining. It also presents future directions for opinion mining in Arabic. The survey also covers latest advances in the field, including deep learning advances in Arabic Opinion Mining. The article provides state-of-the-art information to help new or established researchers in the field as well as industry developers who aim to deploy an operational complete opinion-mining system. Key insights are captured at the end of each section for particular aspects of the opinion-mining system giving the reader a choice of focusing on particular aspects of interest.", "references": ["{n. d.}. Dataset for Arabic Document Classification. Retrieved August 22, 2017 from http://diab.edublogs.org/dataset-for-arabic-document-classification/.", "Ahmed Abbasi, Hsinchun Chen, and Arab Salem. 2008. Sentiment analysis in multiple languages: Feature selection for opinion classification in web forums. ACM Trans. Inf. Syst. 26, 3 (2008), 12.", "Laila Abd-Elhamid, Doaa Elzanfaly, and Ahmed Sharaf Eldin. 2016. Feature-based sentiment analysis in online Arabic reviews. In Proceedings of the 2016 11th International Conference on Computer Engineering 8 Systems (ICCES’16). IEEE, 260--265.", "Laila Abd-Elhamid, Doaa Elzanfaly, and Ahmed Sharaf Eldin. 2018. Arabic feature-based level sentiment analysis using lexicon-based approach. J. Fundam. Appl. Sci. 10, 4S (2018), 143--148.", "Naglaa Abdelhade, Taysir Hassan A. Soliman, and Hosny M. Ibrahim. 2017. Detecting Twitter users’ opinions of Arabic comments during various time episodes via deep neural network. In Proceedings of the International Conference on Advanced Intelligent Systems and Informatics. Springer, 232--246.", "Muhammad Abdul-Mageed. 2017. Modeling Arabic subjectivity and sentiment in lexical space. Inf. Process. Manage. 56, 2 (2017), 291--307.", "Muhammad Abdul-Mageed. 2017. Not all segments are created equal: Syntactically motivated sentiment analysis in lexical space. In Proceedings of the 3rd Arabic Natural Language Processing Workshop. 147--156.", "Muhammad Abdul-Mageed and Mona Diab. 2012. Toward building a large-scale Arabic sentiment lexicon. In Proceedings of the 6th International Global WordNet Conference. 18--22.", "Muhammad Abdul-Mageed, Mona Diab, and Sandra Kübler. 2013. Asma: A system for automatic segmentation and morpho-syntactic disambiguation of modern standard arabic. In Proceedings of the International Conference Recent Advances in Natural Language Processing (RANLP’13). 1--8.", "Muhammad Abdul-Mageed, Mona Diab, and Sandra Kübler. 2014. SAMAR: Subjectivity and sentiment analysis for Arabic social media. Comput. Speech Lang. 28, 1 (2014), 20--37.", "Muhammad Abdul-Mageed and Mona T. Diab. 2011. Subjectivity and sentiment annotation of modern standard arabic newswire. In Proceedings of the 5th Linguistic Annotation Workshop. Association for Computational Linguistics, 110--118.", "Muhammad Abdul-Mageed and Mona T. Diab. 2012. AWATIF: A multi-genre corpus for modern standard Arabic subjectivity and sentiment analysis. In Proceedings of the International Conference on Language Resources and Evaluation (LREC’12). 3907--3914.", "Muhammad Abdul-Mageed and Mona T. Diab. 2014. SANA: A large scale multi-genre, multi-dialect lexicon for Arabic subjectivity and sentiment analysis. In Proceedings of the International Conference on Language Resources and Evaluation (LREC’14). 1162--1169.", "Muhammad Abdul-Mageed, Mona T. Diab, and Mohammed Korayem. 2011. Subjectivity and sentiment analysis of modern standard Arabic. In Proceedings of the 49th Annual Meeting of the Association for Computational Linguistics: Human Language Technologies: Short Papers-Volume 2. Association for Computational Linguistics, 587--591.", "Muhammad Abdul-Mageed and Mohammed Korayem. 2010. Automatic identification of subjectivity in morphologically rich languages: The case of Arabic. Computational Approaches to Subjectivity and Sentiment Analysis 2 (2010), 2--6.", "Muhammad Abdul-Mageed, Mohammed Korayem, and Ahmed YoussefAgha. 2011. “Yes we can?”: Subjectivity Annotation and Tagging for the Health Domain. (2011), 666--671.", "N. A. Abdulla. 2014. Towards Building a Sentiment Analysis Tool for Colloquial and Modern Standard Arabic Reviews. Ph.D. Dissertation. Master’s thesis. Computer Science Department, Jordan University of Science and Technology, Irbid, Jordan.", "Nawaf Abdulla, Salwa Mohammed, Mahmoud Al-Ayyoub, Mohammed Al-Kabi, et al. 2014. Automatic lexicon construction for Arabic sentiment analysis. In Proceedings of the 2014 International Conference on Future Internet of Things and Cloud (FiCloud’14). IEEE, 547--552.", "Nawaf A. Abdulla, Nizar A. Ahmed, Mohammed A. Shehab, and Mahmoud Al-Ayyoub. 2013. Arabic sentiment analysis: Lexicon-based and corpus-based. In Proceedings of the 2013 IEEE Jordan Conference on Applied Electrical Engineering and Computing Technologies (AEECT’13). IEEE, 1--6.", "Nawaf A. Abdulla, Nizar A. Ahmed, Mohammed A. Shehab, Mahmoud Al-Ayyoub, Mohammed N. Al-Kabi, and Saleh Al-rifai. 2014. Towards improving the lexicon-based approach for Arabic sentiment analysis. Int. J. Inf. Technol. Web Eng. 9, 3 (2014), 55--71.", "Nawaf A. Abdulla, Mahmoud Al-Ayyoub, and Mohammed Naji Al-Kabi. 2014. An extended analytical study of arabic sentiments. Int. J. Big Data Intell. 1, 1-2 (2014), 103--113.", "Malak Abdullah and Mirsad Hadzikadic. 2017. Sentiment analysis on arabic tweets: Challenges to dissecting the language. In Proceedings of the International Conference on Social Computing and Social Media. Springer, 191--202.", "Malak Abdullah and Samira Shaikh. 2018. TeamUNCC at SemEval-2018 task 1: Emotion detection in English and Arabic tweets using deep learning. In Proceedings of the 12th International Workshop on Semantic Evaluation. 350--357.", "Raddad Abooraig, Ahmed Alwajeeh, Mahmoud Al-Ayyoub, and Ismail Hmeidi. 2014. On the automatic categorization of arabic articles based on their political orientation. In Proceedings of the 3rd International Conference on Informatics Engineering and Information Science (ICIEIS’14).", "Amjad Abu-Jbara, Ben King, Mona Diab, and Dragomir Radev. 2013. Identifying opinion subgroups in arabic online discussions. In Proceedings of the 51st Annual Meeting of the Association for Computational Linguistics (Volume 2: Short Papers), Vol. 2. 829--835.", "Diab Abuaiadah, Dileep Rajendran, and Mustafa Jarrar. 2017. Clustering Arabic tweets for sentiment analysis. In Proceedings of the 2017 IEEE/ACS 14th International Conference on Computer Systems and Applications (AICCSA’17). IEEE, 449--456.", "Brett Adams, Dinh Phung, and Svetha Venkatesh. 2011. Eventscapes: Visualizing events over time with emotive facets. In Proceedings of the 19th ACM International Conference on Multimedia. ACM, 1477--1480.", "Khurshid Ahmad, David Cheng, and Yousif Almas. 2007. Multi-lingual sentiment analysis of financial news streams. In Proceedings of the 1st International Workshop on Grid Technology for Financial Modeling and Simulation, Vol. 26. SISSA Medialab.", "Abdelrahman Ahmed, Sergio Toral, and Khaled Shaalan. 2016. Agent productivity measurement in call center using machine learning. In Proceedings of the International Conference on Advanced Intelligent Systems and Informatics. Springer, 160--169.", "Nasser Ahmed. 2018. Large-scale Arabic sentiment corpus and lexicon building for concept-based sentiment analysis systems. Doctoral Dissertation, Hacettepe University. Retrieved from http://www.openaccess.hacettepe.edu.tr:8080/xmlui/handle/11655/4170.", "Soha Ahmed, Michel Pasquier, and Ghassan Qadah. 2013. Key issues in conducting sentiment analysis on Arabic social media text. In Proceedings of the 2013 9th International Conference on Innovations in Information Technology (IIT’13). IEEE, 72--77.", "Fawaz S. Al-Anzi and Dia AbuZeina. 2017. A micro-word based approach for Arabic sentiment analysis. In Proceedings of the 2017 IEEE/ACS 14th International Conference on Computer Systems and Applications (AICCSA’17). IEEE, 910--914.", "Mahmoud Al-Ayyoub, Safa Bani Essa, and Izzat Alsmadi. 2015. Lexicon-based sentiment analysis of Arabic tweets. Int. J. Soc. Netw. Min. 2, 2 (2015), 101--114.", "Mahmoud Al-Ayyoub, Abed Allah Khamaiseh, Yaser Jararweh, and Mohammed N Al-Kabi. 2018. A comprehensive survey of arabic sentiment analysis. Inf. Process. Manage. 56, 2 (2018), 320--342.", "Mahmoud Al-Ayyoub, Aya Nuseir, Kholoud Alsmearat, Yaser Jararweh, and Brij Gupta. 2017. Deep learning for Arabic NLP: A survey. J. Comput. Sci. 26, 1 (2017), 522--531.", "Mahmoud Al-Ayyoub, Aya Nuseir, Ghassan Kanaan, and Riyad Al-Shalabi. 2016. Hierar-chical classifiers for multi-way sentiment analysis of arabic reviews. Int. J. Adv. Comput. Sci. Appl. 7, 2 (2016), 531--539.", "Sadam Al-Azani and El-Sayed El-Alfy. 2018. Emojis-based sentiment classification of Arabic microblogs using deep recurrent neural networks. In Proceedings of the 2018 International Conference on Computing Sciences and Engineering (ICCSE’18). IEEE, 1--6.", "Sadam Al-Azani and El-Sayed M El-Alfy. 2017. Hybrid deep learning for sentiment polarity determination of arabic microblogs. In Proceedings of the International Conference on Neural Information Processing. Springer, 491--500.", "Sadam Al-Azani and El-Sayed M El-Alfy. 2017. Using word embedding and ensemble learning for highly imbalanced data sentiment analysis in short arabic text. Proc. Comput. Sci. 109 (2017), 359--366.", "Sadam Al-Azani and El-Sayed M El-Alfy. 2018. Combining emojis with Arabic textual features for sentiment classification. In Proceedings of the 2018 9th International Conference on Information and Communication Systems (ICICS’18). IEEE, 139--144.", "Heitham Al-Hajieh, Keith Redhead, and Timothy Rodgers. 2011. Investor sentiment and calendar anomaly effects: A case study of the impact of ramadan on islamic middle eastern markets. Res. Int. Bus. Finan. 25, 3 (2011), 345--356.", "Omar Al-Harbi. 2017. Using objective words in the reviews to improve the colloquial arabic sentiment analysis. Int. J. Nat. Lang. Comput. 6, 3 (2017), 1--14.", "Waad A. Al-Harbi and Ahmed Emam. 2015. Effect of Saudi dialect preprocessing on Arabic sentiment analysis. Int. J. Adv. Comput. Technol. 8, 2 (2015), 91--99.", "Lamia Al-Horaibi and Muhammad Badruddin Khan. 2016. Sentiment analysis of Arabic tweets using semantic resources. Int. J. Comput. Inf. Sci. 12, 2 (2016), 149.", "Mohammed Al-Kabi, Mahmoud Al-Ayyoub, Izzat Alsmadi, and Heider Wahsheh. 2016. A prototype for a standard arabic sentiment analysis corpus.Int. Arab J. Inf. Technol. 13, 1A (2016), 163--170.", "Mohammed Al-Kabi, Noor M. Al-Qudah, Izzat Alsmadi, M. Dabour, and H. Wahsheh. 2013. Arabic/English sentiment analysis: An empirical study. In Proceedings of the 4th International Conference on Information and Communication Systems (ICICS’13). 23--25.", "Mohammed Al-Kabi, Amal Gigieh, Izzat Alsmadi, Heider Wahsheh, and Mohamad Haidar. 2013. An opinion analysis tool for colloquial and standard Arabic. In Proceedings of the 4th International Conference on Information and Communication Systems (ICICS’13). 23--25.", "Mohammed N. Al-Kabi, Nawaf A. Abdulla, and Mahmoud Al-Ayyoub. 2013. An analytical study of Arabic sentiments: Maktoob case study. In Proceedings of the 2013 8th International Conference for Internet Technology and Secured Transactions (ICITST’13). IEEE, 89--94.", "Mohammed N. Al-Kabi, Areej A. Al-Qwaqenah, Amal H. Gigieh, Kholoud Alsmearat, Mahmoud Al-Ayyoub, and Izzat M. Alsmadi. 2016. Building a standard dataset for Arabie sentiment analysis: Identifying potential annotation pitfalls. In Proceedings of the 2016 IEEE/ACS 13th International Conference of Computer Systems and Applications (AICCSA’16). IEEE, 1--6.", "Mohammed N. Al-Kabi, Izzat M. Alsmadi, Rawan T. Khasawneh, and Heider A. Wahsheh. 2016. Evaluating social context in Arabic opinion mining. Int. Arab J. Inf. Technol. 15, 6 (2016), 974--982.", "Mohammed N. Al-Kabi, Amal H. Gigieh, Izzat M. Alsmadi, Heider A. Wahsheh, and Mohamad M. Haidar. 2014. Opinion mining and analysis for Arabic language. Int. J. Adv. Comput. Sc. Appl. 5, 5 (2014), 181--195.", "Tareq Al-Moslmi, Mohammed Albared, Adel Al-Shabi, Nazlia Omar, and Salwani Abdullah. 2017. Arabic senti-lexicon: Constructing publicly available language resources for Arabic sentiment analysis. J. Inf. Sci. 44, 3 (2017), 345--362.", "Tareq Al-Moslmi, Nazlia Omar, Salwani Abdullah, and Mohammed Albared. 2017. Approaches to cross-domain sentiment analysis: A systematic literature review. IEEE Access 5 (2017), 16173--16192.", "Ayesha Jumaa Salem Al Mukhaiti, Sanjeera Siddiqui, and Khaled Shaalan. 2017. Dataset built for Arabic sentiment analysis. In Proceedings of the International Conference on Advanced Intelligent Systems and Informatics. Springer, 406--416.", "Ahmed Y. Al-Obaidi and Venus W. Samawi. 2016. Opinion mining: Analysis of comments written in arabic colloquial. In Proceedings of the World Congress on Engineering and Computer Science, Vol. 1.", "Salha Al-Osaimi and Khan Muhammad Badruddin. 2014. Role of emotion icons in sentiment classification of Arabic tweets. In Proceedings of the 6th International Conference on Management of Emergent Digital Ecosystems. ACM, 167--171.", "Qasem A. Al-Radaideh and Ghufran Y. Al-Qudah. 2017. Application of rough set-based feature selection for Arabic sentiment analysis. Cogn. Comput. 9, 4 (2017), 436--445.", "Qasem A. Al-Radaideh and Laila M. Twaiq. 2014. Rough set theory for Arabic sentiment classification. In Proceedings of the 2014 International Conference on Future Internet of Things and Cloud (FiCloud’14). IEEE, 559--564.", "Khalid Al-Rowaily, Muhammad Abulaish, Nur Al-Hasan Haldar, and Majed Al-Rubaian. 2015. BiSAL--A bilingual sentiment analysis lexicon to analyze dark web forums for cyber security. Dig. Invest. 14 (2015), 53--62.", "Hamed Al-Rubaiee, Renxi Qiu, Khalid Alomar, and Dayou Li. 2016. Sentiment analysis of Arabic tweets in e-learning. J. Comput. Sci. 12, 11 (Jan. 2016), 553--563.", "Hamed Al-Rubaiee, Renxi Qiu, and Dayou Li. 2016. Identifying mubasher software products through sentiment analysis of Arabic tweets. In Proceedings of the 2016 International Conference on Industrial Informatics and Computer Systems (CIICS’16). IEEE, 1--6.", "Rania Al-Sabbagh and Roxana Girju. 2012. A supervised POS tagger for written Arabic social networking corpora. In Proceedings of the Konferenz zur Verarbeitung natürlicher Sprache. 39--52.", "Ahmad Al-Sallab, Ramy Baly, Hazem Hajj, Khaled Bashir Shaban, Wassim El-Hajj, and Gilbert Badaro. 2017. AROMA: A recursive deep learning model for opinion mining in arabic as a low resource language. ACM Transac. Asian Low-Res. Lang. Inf. Process. 16, 4 (2017), 25.", "Ahmad A. Al Sallab, Ramy Baly, Gilbert Badaro, Hazem Hajj, Wassim El Hajj, and Khaled B. Shaban. 2015. Deep learning models for sentiment analysis in arabic. In Proceedings of the Annual Meeting on Natural Language Processing (ANLP’15) Workshop, Vol. 9.", "Huda Al-Sarhan, Majd Al-So’ud, Mohammad Al-Smadi, Mahmoud Al-Ayyoub, and Yaser Jararweh. 2016. Framework for affective news analysis of arabic news: 2014 gaza attacks case study. In Proceedings of the 2016 7th International Conference on Information and Communication Systems (ICICS’16). IEEE, 327--332.", "Bashar Al Shboul, Mahmoud Al-Ayyoub, and Yaser Jararweh. 2015. Multi-way sentiment classification of arabic reviews. In Proceedings of the 2015 6th International Conference on Information and Communication Systems (ICICS’15). IEEE, 206--211.", "Mohammad Al-Smadi, Mahmoud Al-Ayyoub, Huda Nimer Al-Sarhan, and Yaser Jararweh. 2016. An aspect-based sentiment analysis approach to evaluating arabic news affect on readers. J. Univ. Comput. Sci. 22, 5 (2016), 630--649.", "Mohammad Al-Smadi, Mahmoud Al-Ayyoub, Yaser Jararweh, and Omar Qawasmeh. 2018. Enhancing aspect-based sentiment analysis of Arabic hotels’ reviews using morphological, syntactic and semantic features. Journal of Information Processing 8 Management 56, 2 (2018), 308--319.", "Mohammad Al Smadi, Islam Obaidat, Mahmoud Al-Ayyoub, Rami Mohawesh, and Yaser Jararweh. 2016. Using enhanced lexicon-based approaches for the determination of aspect categories and their polarities in arabic reviews. Int. J. Inf. Technol. Web Eng. 11, 3 (2016), 15--31.", "Mohammad Al-Smadi, Omar Qawasmeh, Mahmoud Al-Ayyoub, Yaser Jararweh, and Brij Gupta. 2017. Deep recurrent neural network vs. support vector machine for aspect-based sentiment analysis of Arabic hotels’ reviews. J. Comput. Sci. 27 (2017), 386--393.", "Mohammad Al-Smadi, Omar Qawasmeh, Bashar Talafha, and Muhannad Quwaider. 2015. Human annotated arabic dataset of book reviews for aspect based sentiment analysis. In Proceedings of the 2015 3rd International Conference on Future Internet of Things and Cloud (FiCloud’15). IEEE, 726--730.", "Mohammad Al-Smadi, Omar Qwasmeh, Bashar Talafha, Mahmoud Al-Ayyoub, Yaser Jararweh, and Elhadj Benkhelifa. 2016. An enhanced framework for aspect-based sentiment analysis of hotels’ reviews: Arabic reviews case study. In Proceedings of the 2016 11th International Conference for Internet Technology and Secured Transactions (ICITST’16). IEEE, 98--103.", "Mohammad Al-Smadi, Bashar Talafha, Mahmoud Al-Ayyoub, and Yaser Jararweh. 2018. Using long short-term memory deep neural networks for aspect-based sentiment analysis of Arabic reviews. Int. J. Mach. Learn. Cybernet. 55, 2 (2018), 1--13.", "Afnan A. Al-Subaihin, Hend S. Al-Khalifa, and AbdulMalik S. Al-Salman. 2011. A proposed sentiment analysis tool for modern arabic using human-based computing. In Proceedings of the 13th International Conference on Information Integration and Web-based Applications and Services. ACM, 543--546.", "Afnan S. Al-Subaihin and Hend S. Al-Khalifa. 2014. A system for sentiment analysis of colloquial Arabic using human computation. Sci. World J. 2014 (2014), 1--8.", "H. Al Suwaidi, Tariq Rahim Soomro, and K. Shaalan. 2016. Sentiment analysis for emiriti dialects in Twitter. Sindh Univ. Res. J. 48, 4 (2016).", "Nora Al-Twairesh, Hend Al-Khalifa, and AbdulMalik Al-Salman. 2014. Subjectivity and sentiment analysis of Arabic: Trends and challenges. In Proceedings of the 2014 IEEE/ACS 11th International Conference on Computer Systems and Applications (AICCSA’14). IEEE, 148--155.", "Nora Al-Twairesh, Hend Al-Khalifa, and AbdulMalik Al-Salman. 2015. Towards analyzing Saudi tweets. In Proceedings of the 2015 First International Conference on Arabic Computational Linguistics (ACLing’15). IEEE, 114--117.", "Nora Al-Twairesh, Hend Al-Khalifa, AbdulMalik Al-Salman, and Yousef Al-Ohali. 2017. AraSenTi-Tweet: A corpus for Arabic sentiment analysis of Saudi tweets. Proc. Comput. Sci. 117 (2017), 63--72.", "Nora Al-Twairesh, Hend Al-Khalifa, and Abdulmalik AlSalman. 2016. AraSenTi: Large-scale twitter-specific arabic sentiment lexicons. In Proceedings of the 54th Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers), Vol. 1. 697--705.", "Nora Al-Twairesh, Hend Al-Khalifa, AbdulMalik Alsalman, and Yousef Al-Ohali. 2018. Sentiment analysis of Arabic tweets: Feature engineering and a hybrid approach. https://arxiv.org/abs/1805.08533 (2018).", "Ayman Al Zaatari, Rim El Ballouli, Shady Elbassuoni, Wassim El-Hajj, Hazem M. Hajj, Khaled B. Shaban, Nizar Habash, and Emad Yahya. 2016. Arabic corpora for credibility analysis. In Proceedings of the International Conference on Language Resources and Evaluation (LREC’16).", "Ahmed M. I. AlAsmar. 2016. Feature Based Approach in Arabic Opinion Mining Using Ontology. Ph.D. Dissertation. The Islamic University--Gaza.", "Abdulaziz M. Alayba, Vasile Palade, Matthew England, and Rahat Iqbal. 2017. Arabic language sentiment analysis on health services. In Proceedings of the 2017 1st International Workshop on Arabic Script Analysis and Recognition (ASAR’17). IEEE, 114--118.", "Abdulaziz M. Alayba, Vasile Palade, Matthew England, and Rahat Iqbal. 2018. A combined CNN and LSTM model for arabic sentiment analysis. In Proceedings of the International Cross-Domain Conference for Machine Learning and Knowledge Extraction. Springer, 179--191.", "Abdulaziz M. Alayba, Vasile Palade, Matthew England, and Rahat Iqbal. 2018. Improving sentiment analysis in Arabic using word representation. arXiv preprint arXiv:1803.00124 (2018).", "Lamya Albraheem and Hend S. Al-Khalifa. 2012. Exploring the problems of sentiment analysis in informal Arabic. In Proceedings of the 14th International Conference on Information Integration and Web-based Applications 8 Services. ACM, 415--418.", "Haifa K. Aldayel and Aqil M. Azmi. 2016. Arabic tweets sentiment analysis--a hybrid scheme. J. Inf. Sci. 42, 6 (2016), 782--797.", "Samah Alhazmi, William Black, and John McNaught. 2013. Arabic SentiWordNet in relation to SentiWordNet 3.0. IJCL. 2180 1266, 4 (2013), 1.", "Sarah Alhumoud, Tarfa Albuhairi, and Wejdan Alohaideb. 2015. Hybrid sentiment analyser for Arabic tweets using R. In Proceedings of the 2015 7th International Joint Conference on Knowledge Discovery, Knowledge Engineering and Knowledge Management (IC3K’15). IEEE, 417--424.", "Sarah Alhumoud, Tarfa Albuhairi, and Mawaheb Altuwaijri. 2015. Arabic sentiment analysis using WEKA a hybrid learning approach. In Proceedings of the 2015 7th International Joint Conference on Knowledge Discovery, Knowledge Engineering and Knowledge Management (IC3K’15). IEEE, 402--408.", "Sarah O. Alhumoud, Mawaheb I. Altuwaijri, Tarfa M. Albuhairi, and Wejdan M. Alohaideb. 2015. Survey on Arabic sentiment analysis in twitter. Int. Sci. Ind. 9, 1 (2015), 364--368.", "Abdullah M. Alkadri and Abeer M. ElKorany. 2016. Semantic feature based arabic opinion mining using ontology. Int. J. Adv. Comput. Sci. Appl. 7, 5 (2016), 577--583.", "Khalid AlKhatib, Abdullateef Rabab’ah, Mahmoud Al-Ayyoub, and Yaser Jararweh. 2016. On the use of arabic tweets to predict stock market changes in the arab world. Int. J. Adv. Comput. Sci. Appl. 7, 5 (2016), 560--566.", "Ghaith Abdulsattar A. Jabbar Alkubaisi, Siti Sakira Kamaruddin, and Husniza Husni. 2018. Stock market classification model using sentiment analysis on Twitter based on hybrid naive bayes classifiers. Comput. Inf. Sci. 11, 1 (2018), 52.", "Yousif Almas and Khurshid Ahmad. 2007. A note on extracting sentiments in financial news in English, Arabic 8 Urdu. In Proceedings of the 2nd Workshop on Computational Approaches to Arabic Script-based Languages. 1--12.", "Latifah Almuqren, Arwa Alzammam, Shahad Alotaibi, Alexandra Cristea, and Sarah Alhumoud. 2017. A review on corpus annotation for Arabic sentiment analysis. In Proceedings of the International Conference on Social Computing and Social Media. Springer, 215--225.", "Latifah Almuqren and Alexandra I. Cristea. 2016. Framework for sentiment analysis of Arabic text. In Proceedings of the 27th ACM Conference on Hypertext and Social Media. ACM, 315--317.", "Anwar Alnawas and Nursal Arıcı. 2018. The corpus based approach to sentiment analysis in modern standard Arabic and Arabic dialects: A literature review. Polit. Derg. 21, 2 (2018), 461--470.", "Khaled Mohammad Alomari, Hatem M. ElSherif, and Khaled Shaalan. 2017. Arabic tweets sentimental analysis using machine learning. In Proceedings of the International Conference on Industrial, Engineering and Other Applications of Applied Intelligent Systems. Springer, 602--610.", "Saud Alotaibi and Charles Anderson. 2017. Word clustering as a feature for Arabic sentiment classification. Int. J. Educ. Manage. Eng. 7, 1 (2017), 1--13.", "Saud S. Alotaibi and Charles W. Anderson. 2016. Extending the knowledge of the Arabic sentiment classification using a foreign external lexical source. Int. J. Nat. Lang. Comput. 5, 3 (2016), 1--11.", "Sana Alowaidi, Mustafa Saleh, and Osama Abulnaja. 2017. Semantic sentiment analysis of Arabic texts. Int. J. Adv. Comput. Sci. Appl. 8, 2 (2017), 256--262.", "Areeb Alowisheq, Sarah Alhumoud, Nora alTwairesh, and Tarfa Albuhairi. 2016. Arabic sentiment analysis resources: A survey. In Proceedings of the 8th International Conference on Social Computing and Social Media (SCSM’16) Held as Part of HCI International 2016. Springer, 267--278.", "Mohammed Alshahrani, Fuxi Zhu, Ahmed Sameh, Lin Zheng, and Summaya Mumtaz. 2018. Evaluating the influence of Twitter on the Saudi Arabian stock market indicators. In Proceedings of the 5th International Symposium on Data Mining Applications. Springer, 113--132.", "Kholoud Alsmearat, Mohammed Shehab, Mahmoud Al-Ayyoub, Riyad Al-Shalabi, and Ghassan Kanaan. 2015. Emotion analysis of arabic articles and its impact on identifying the author’s gender. In Proceedings of the 2015 IEEE/ACS 12th International Conference of Computer Systems and Applications (AICCSA’15). IEEE, 1--6.", "A. Aziz Altowayan and Ashraf Elnagar. 2017. Improving Arabic sentiment analysis with sentiment-specific embeddings. In Proceedings of the 2017 IEEE International Conference on Big Data (Big Data’17). IEEE, 4314--4320.", "A. Aziz Altowayan and Lixin Tao. 2016. Word embeddings for Arabic sentiment analysis. In Proceedings of the 2016 IEEE International Conference on Big Data (Big Data’16). IEEE, 3820--3825.", "Ghadah Alwakid, Taha Osman, and Thomas Hughes-Roberts. 2017. Challenges in sentiment analysis for Arabic social networks. Proc. Comput. Sci. 117 (2017), 89--100.", "Mohamed A. Aly and Amir F. Atiya. 2013. LABR: A large scale Arabic book reviews dataset. In Proceedings of the Annual Meeting of the Association of Computer Linguistics (ACL’13). 494--498.", "Matheus Araujo, Julio Reis, Adriano Pereira, and Fabricio Benevenuto. 2016. An evaluation of machine translation for multilingual sentence-level sentiment analysis. In Proceedings of the 31st Annual ACM Symposium on Applied Computing. ACM, 1140--1145.", "Adel Assiri, Ahmed Emam, and Hmood Al-Dossari. 2016. Saudi twitter corpus for sentiment analysis. Int. J. Comput. Electr. Autom. Contr. Inf. Eng. 10, 2 (2016), 242--245.", "Adel Assiri, Ahmed Emam, and Hmood Al-Dossari. 2017. Towards enhancement of a lexicon-based approach for Saudi dialect sentiment analysis. J. Inf. Sci. 44, 2 (2017).", "Adel Assiri, Ahmed Emam, and Hmood Aldossari. 2015. Arabic sentiment analysis: A survey. Int. J. Adv. Comput. Sci. Appl. 6, 12 (2015), 75--85.", "Sasi Atia and Khaled Shaalan. 2015. Increasing the accuracy of opinion mining in Arabic. In Proceedings of the 2015 First International Conference on Arabic Computational Linguistics (ACLing’15). IEEE, 106--113.", "Hunaida Awwad and Adil Alpkocak. 2016. Performance comparison of different lexicons for sentiment analysis in Arabic. In Proceedings of the 2016 3rd European Network Intelligence Conference (ENIC’16). IEEE, 127--133.", "Aqil M. Azmi and Samah M. Alzanin. 2014. Aara’—A system for mining the polarity of Saudi public opinion through e-newspaper comments. J. Inf. Sci. 40, 3 (2014), 398--410.", "Stefano Baccianella, Andrea Esuli, and Fabrizio Sebastiani. 2010. SentiWordNet 3.0: An enhanced lexical resource for sentiment analysis and opinion mining. In Proceedings of the International Conference on Language Resources and Evaluation (LREC’10), Vol. 10. 2200--2204.", "Gilbert Badaro, Ramy Baly, Rana Akel, Linda Fayad, Jeffrey Khairallah, Hazem Hajj, Wassim El-Hajj, and Khaled Bashir Shaban. 2015. A light lexicon-based mobile application for sentiment mining of Arabic tweets. In Proceedings of the Annual Conference on Natural Language Processing (ANLP’15) Workshop 2015. 18.", "Gilbert Badaro, Ramy Baly, Hazem Hajj, Nizar Habash, and Wassim El-Hajj. 2014. A large scale Arabic sentiment lexicon for Arabic opinion mining. In Proceedings of the Annual Conference on Natural Language Processing (ANLP’14) 165 (2014).", "Gilbert Badaro, Obeida El Jundi, Alaa Khaddaj, Alaa Maarouf, Raslan Kain, Hazem Hajj, and Wassim El-Hajj. 2018. EMA at SemEval-2018 task 1: Emotion mining for Arabic. In Proceedings of the 12th International Workshop on Semantic Evaluation. 236--244.", "Gilbert Badaro, Hazem Hajj, Wassim El-Hajj, and Lama Nachman. 2013. A hybrid approach with collaborative filtering for recommender systems. In Proceedings of the 2013 9th International Wireless Communications and Mobile Computing Conference (IWCMC’13). IEEE, 349--354.", "Gilbert Badaro, Hazem Hajj, Ali Haddad, Wassim El-Hajj, and Khaled Bashir Shaban. 2014. A multiresolution approach to recommender systems. In Proceedings of the 8th Workshop on Social Network Mining and Analysis. ACM, 9.", "Gilbert Badaro, Hazem Hajj, Ali Haddad, Wassim El-Hajj, and Khaled Bashir Shaban. 2014. Recommender systems using harmonic analysis. In Proceedings of the 2014 IEEE International Conference on Data Mining Workshop (ICDMW’14). IEEE, 1004--1011.", "Gilbert Badaro, Hussein Jundi, Hazem Hajj, and Wassim El-Hajj. 2018. EmoWordNet: Automatic expansion of emotion lexicon using English WordNet. In Proceedings of the 7th Joint Conference on Lexical and Computational Semantics. 86--93.", "Gilbert Badaro, Be, Ramy Baly, Hazem Hajj, Nizar Habash, Wassim El-hajj, and Khaled Shaban. 2014. An efficient model for sentiment classification of Arabic tweets on mobiles. In Proceedings of the Qatar Foundation Annual Research Conference.", "Hitham Abo Bakr, Khaled Shaalan, and Ibrahim Ziedan. 2008. A hybrid approach for converting written Egyptian colloquial dialect into diacritized Arabic. In Proceedings of the 6th International Conference on Informatics and Systems (INFOS’08).", "Georgios Balikas and Massih-Reza Amini. 2016. TwiSE at SemEval-2016 task 4: Twitter sentiment classification. arXiv preprint arXiv:1606.04351 (2016).", "Ramy Baly, Gilbert Badaro, Georges El-Khoury, Rawan Moukalled, Rita Aoun, Hazem Hajj, Wassim El-Hajj, Nizar Habash, and Khaled Bashir Shaban. 2017. A characterization study of Arabic Twitter data with a benchmarking for state-of-the-art opinion mining models. In Proceedings of the Arabic Natural Language Processing Workshop (WANLP’17) (co-located with EACL 2017). 110.", "Ramy Baly, Gilbert Badaro, Ali Hamdi, Rawan Moukalled, Rita Aoun, Georges El-Khoury, Ahmad Al Sallab, Hazem Hajj, Nizar Habash, Khaled Shaban, et al. 2017. OMAM at SemEval-2017 task 4: Evaluation of English state-of-the-art sentiment analysis models for Arabic and a new topic-based model. In Proceedings of the 11th International Workshop on Semantic Evaluation (SemEval’17). Association for Computational Linguistics, 601--608.", "Ramy Baly, Georges El-Khoury, Rawan Moukalled, Rita Aoun, Hazem Hajj, Khaled Bashir Shaban, and Wassim El-Hajj. 2017. Comparative evaluation of sentiment analysis methods across Arabic dialects. Proc. Comput. Sci. 117 (2017), 266--273.", "Ramy Baly, Hazem Hajj, Nizar Habash, Khaled Bashir Shaban, and Wassim El-Hajj. 2017. A sentiment treebank and morphologically enriched recursive deep models for effective sentiment analysis in Arabic. ACM Trans. Asian Low-Res. Lang. Inf. Process. 16, 4 (2017), 23.", "Ramy Baly, Roula Hobeica, Hazem Hajj, Wassim El-Hajj, Khaled Bashir Shaban, and Ahmad Al-Sallab. 2016. A meta-framework for modeling the human reading process in sentiment analysis. ACM Trans. Inf. Syst. 35, 1 (2016), 7.", "Carmen Banea, Rada Mihalcea, and Janyce Wiebe. 2010. Multilingual subjectivity: Are more languages better? In Proceedings of the 23rd International Conference on Computational Linguistics. Association for Computational Linguistics, 28--36.", "Anoud Bani-Hani, Munir Majdalawieh, and Feras Obeidat. 2017. The creation of an Arabic emotion ontology based on E-Motive. Proc. Comput. Sci. 109 (2017), 1053--1059.", "Amira Barhoumi, Yannick Estève1 Chafik Aloulou, and Lamia Hadrich Belguith. 2017. Document embeddings for Arabic sentiment analysis. Language Processing and Knowledge Management 1988 (2017).", "Mikhail Bautin, Lohit Vijayarenu, and Steven Skiena. 2008. International sentiment analysis for news and blogs. In Proceedings of the International AAAI Conference on Web and Social Media (ICWSM’08).", "Amine Bayoudhi, Hatem Ghorbel, and Lamia Hadrich Belguith. 2015. Sentiment classification of Arabic documents: Experiments with multi-type features and ensemble algorithms. In Proceedings of the 29th Pacific Asia Conference on Language, Information and Computation. 196--205.", "Amine Bayoudhi, Hatem Ghorbel, Houssem Koubaa, and Lamia Hadrich Belguith. 2015. Sentiment classification at discourse segment level: Experiments on multi-domain Arabic corpus.J. Lang. Technol. Comp. Ling. 30, 1 (2015), 1--24.", "Yonatan Belinkov and James Glass. 2016. A character-level convolutional neural network for distinguishing similar languages and dialects. arXiv preprint arXiv:1609.07568 (2016).", "Mariam Biltawi, Ghazi Al-Naymat, and Sara Tedmori. 2017. Arabic sentiment classification: A hybrid approach. In Proceedings of the 2017 International Conference on New Trends in Computing Sciences (ICTCS’17). IEEE, 104--108.", "Mariam Biltawi, Wael Etaiwi, Sara Tedmori, Amjad Hudaib, and Arafat Awajan. 2016. Sentiment classification techniques for Arabic language: A survey. In Proceedings of the 2016 7th International Conference on Information and Communication Systems (ICICS’16). IEEE, 339--346.", "William Black, Sabri Elkateb, Horacio Rodriguez, Musa Alkhalifa, Piek Vossen, Adam Pease, and Christiane Fellbaum. 2006. Introducing the Arabic wordnet project. In Proceedings of the 3rd International WordNet Conference. 295--300.", "Rihab Bouchlaghem, Aymen Elkhelifi, and Rim Faiz. 2016. A machine learning approach for classifying sentiments in Arabic tweets. In Proceedings of the 6th International Conference on Web Intelligence, Mining and Semantics. ACM, 24.", "Rihab Bouchlaghem, Aymen Elkhelifi, and Rim Faiz. 2016. Sentiment analysis in Arabic Twitter posts using supervised methods with combined features. In Proceedings of the International Conference on Intelligent Text Processing and Computational Linguistics. Springer, 320--334.", "Naaima Boudad, Rdouan Faizi, Rachid Oulad Haj Thami, and Raddouane Chiheb. 2017. Sentiment analysis in Arabic: A review of the literature. Ain Shams Eng. J. 9, 4 (2017), 2479--2490.", "Naaima Boudad, Rdouan Faizi, Rachid Oulad Haj Thami, and Raddouane Chiheb. 2017. Sentiment classification of Arabic tweets: A supervised approach. J. Mobile Multimedia 13, 384 (2017), 233--243.", "Belgacem Brahimi, Mohamed Touahria, and Abdelkamel Tari. 2016. Data and text mining techniques for classifying Arabic tweet polarity.J. Dig. Inf. Manage. 14, 1 (2016).", "Tim Buckwalter. 2002. Arabic Morphological Analyzer (AraMorph). Linguistic Data Consortium, Philadelphia.", "T. Buckwalter. 2004. Buckwalter Arabic Morphological Analyzer (BAMA) Version 2.0. Linguistic Data Consortium (LDC) Catalogue Number LDC2004L02. Technical Report. ISBN1-58563-324-0.", "Erik Cambria, Soujanya Poria, Rajiv Bajpai, and Björn Schuller. 2016. SenticNet 4: A semantic resource for sentiment analysis based on conceptual primitives. In Proceedings of the 26th International Conference on Computational Linguistics: Technical Papers (COLING’16). 2666--2677.", "Nan Cao, Lu Lu, Yu-Ru Lin, Fei Wang, and Zhen Wen. 2015. Socialhelix: Visual analysis of sentiment divergence in social media. J. Vis. 18, 2 (2015), 221--235.", "Yanqing Chen and Steven Skiena. 2014. Building sentiment lexicons for all major languages. In Proceedings of the 52nd Annual Meeting of the Association for Computational Linguistics (Volume 2: Short Papers), Vol. 2. 383--389.", "Marc Cheong and Vincent C. S. Lee. 2011. A microblogging-based approach to terrorism informatics: Exploration and chronicling civilian sentiment and response to terrorism events via Twitter. Inf. Syst. Front. 13, 1 (2011), 45--59.", "Walid Cherif, Abdellah Madani, and Mohamed Kissi. 2015. A new modeling approach for Arabic opinion mining recognition. In Proceedings of the 2015 Intelligent Systems and Computer Vision (ISCV’15). IEEE, 1--6.", "Walid Cherif, Abdellah Madani, and Mohamed Kissi. 2015. Towards an efficient opinion measurement in Arabic comments. Proc. Comput. Sci. 73 (2015), 122--129.", "Walid Cherif, Abdellah Madani, and Mohamed Kissi. 2016. A combination of low-level light stemming and support vector machines for the classification of Arabic opinions. In Proceedings of the 2016 11th International Conference on Intelligent Systems: Theories and Applications (SITA’16). IEEE, 1--5.", "Walid Cherif, Abdellah Madani, and Mohamed Kissi. 2016. A hybrid optimal weighting scheme and machine learning for rendering sentiments in tweets. Int. J. Intell. Eng. Inf. 4, 3-4 (2016), 322--339.", "David Chiang, Mona T. Diab, Nizar Habash, Owen Rambow, and Safiullah Shareef. 2006. Parsing Arabic dialects. In Proceedings of the European Chapter of the Association for Computational Linguistics (EACL’06).", "Ronan Collobert and Jason Weston. 2008. A unified architecture for natural language processing: Deep neural networks with multitask learning. In Proceedings of the 25th International Conference on Machine Learning. ACM, 160--167.", "Mohammed Dahab and Salma Al Asmari. 2015. Towards discovering the sentiment holder in Arabic text. Int. J. Comput. Appl. 111, 16 (2015).", "Abdelghani Dahou, Shengwu Xiong, Junwei Zhou, Mohamed Houcine Haddoud, and Pengfei Duan. 2016. Word embeddings and convolutional neural network for arabic sentiment classification. In Proceedings of the 26th International Conference on Computational Linguistics (COLING’16): Technical Papers. 2418--2427.", "Bouras Dalila, Amroune Mohamed, and Hakim Bendjanna. 2018. A review of recent aspect extraction techniques for opinion mining systems. In Proceedings of the 2018 2nd International Conference on Natural Language and Speech Processing (ICNLSP’18). IEEE, 1--6.", "Jan Deriu, Maurice Gonzenbach, Fatih Uzdilli, Aurelien Lucchi, Valeria De Luca, and Martin Jaggi. 2016. SwissCheese at SemEval-2016 task 4: Sentiment classification using an ensemble of convolutional neural networks with distant supervision. In Proceedings of the International Workshop on Semantic Evaluation at the Annual Conference of the North American Chapter of the Association for Computational Linguistics: Human Language Technologies (SemEval@ NAACL-HLT’16). 1124--1128.", "Mona Diab. 2009. Second generation AMIRA tools for Arabic processing: Fast and robust tokenization, POS tagging, and base phrase chunking. In Proceedings of the 2nd International Conference on Arabic Language Resources and Tools, Vol. 110.", "Mona Diab, Kadri Hacioglu, and Daniel Jurafsky. 2004. Automatic tagging of Arabic text: From raw text to base phrase chunks. In Proceedings of the Annual Conference of the North American Chapter of the Association for Computational Linguistics: Human Language Technologies (NAACL’04): Short Papers. Association for Computational Linguistics, 149--152.", "Mona T. Diab, Mohamed Al-Badrashiny, Maryam Aminian, Mohammed Attia, Heba Elfardy, Nizar Habash, Abdelati Hawwari, Wael Salloum, Pradeep Dasigi, and Ramy Eskander. 2014. Tharwa: A large scale dialectal Arabic-standard Arabic-english lexicon. In Proceedings of the International Conference on Language Resources and Evaluation (LREC’14). 3782--3789.", "Dongxu Duan, Weihong Qian, Shimei Pan, Lei Shi, and Chuang Lin. 2012. VISA: A visual sentiment analysis system. In Proceedings of the 5th International Symposium on Visual Information Communication and Interaction. ACM, 22--28.", "Kevin Duh and Katrin Kirchhoff. 2005. POS tagging of dialectal Arabic: A minimally supervised approach. In Proceedings of the ACL Workshop on Computational Approaches to Semitic Languages. Association for Computational Linguistics, 55--62.", "R. M. Duwairi, Nizar A. Ahmed, and Saleh Y. Al-Rifai. 2015. Detecting sentiment embedded in Arabic social media--a lexicon-based approach. J. Intell. Fuzzy Syst. 29, 1 (2015), 107--117.", "Rehab Duwairi and Mahmoud El-Orfali. 2014. A study of the effects of preprocessing strategies on sentiment analysis for Arabic text. J. Inf. Sci. 40, 4 (2014), 501--513.", "R. M. Duwairi, Raed Marji, Narmeen Sha’ban, and Sally Rushaidat. 2014. Sentiment analysis in Arabic tweets. In Proceedings of the 2014 5th International Conference on Information and Communication Systems (ICICS’14). IEEE, 1--6.", "Rehab M. Duwairi. 2015. Sentiment analysis for dialectical Arabic. In Proceedings of the 2015 6th International Conference on Information and Communication Systems (ICICS’15). IEEE, 166--170.", "Rehab M. Duwairi, Mosab Alfaqeh, Mohammad Wardat, and Areen Alrabadi. 2016. Sentiment analysis for Arabizi text. In Proceedings of the 2016 7th International Conference on Information and Communication Systems (ICICS’16). IEEE, 127--132.", "Rehab M. Duwairi and Mohammad A. Alshboul. 2015. Negation-aware framework for sentiment analysis in Arabic reviews. In Proceedings of the 2015 3rd International Conference on Future Internet of Things and Cloud (FiCloud’15). IEEE, 731--735.", "Rehab M. Duwairi and Islam Qarqaz. 2016. A framework for Arabic sentiment analysis using supervised classification. Int. J. Data Min. Model. Manage. 8, 4 (2016), 369--381.", "A. Eesee and N. Omar. 2016. A hybrid method for Arabic educational sentiment analysis. J. Appl. Sci. 16, 5 (2016), 216--222.", "Samhaa R. El-Beltagy. 2016. Niletmrg at semeval-2016 task 7: Deriving prior polarities for arabic sentiment terms. In Proceedings of the 10th International Workshop on Semantic Evaluation (SemEval’16). 486--490.", "Samhaa R. El-Beltagy. 2016. NileULex: A phrase and word level sentiment lexicon for egyptian and modern standard Arabic. In Proceedings of the International Conference on Language Resources and Evaluation (LREC’16).", "Samhaa R. El-Beltagy. 2017. WeightedNileULex: A scored Arabic sentiment lexicon for improved sentiment analysis. Language Processing, Pattern Recognition and Intelligent Systems. Special Issue on Computational Linguistics, Speech8 Image Processing for Arabic Language. World Scientific Publishing Co.", "Samhaa R. El-Beltagy and Ahmed Ali. 2013. Open issues in the sentiment analysis of Arabic social media: A case study. In Proceedings of the 2013 9th International Conference on Innovations in Information Technology (IIT’13). IEEE, 215--220.", "Samhaa R. El-Beltagy, Mona El Kalamawy, and Abu Bakr Soliman. 2017. NileTMRG at SemEval-2017 task 4: Arabic sentiment analysis. arXiv preprint arXiv:1710.08458 (2017).", "Samhaa R. El-Beltagy, Talaat Khalil, Amal Halaby, and Muhammad Hammad. 2016. Combining lexical features and a supervised learning approach for Arabic sentiment analysis. In Proceedings of the International Conference on Intelligent Text Processing and Computational Linguistics. Springer, 307--319.", "Alaa El-Halees. 2011. Arabic opinion mining using combined classification approach. Naif Arab University for Security Sciences. http://hdl.handle.net/20.500.12358/25202", "Alaa El-Halees. 2014. Mining changes of opinions expressed by students to improve course evaluation. In Proceedings of the International ARAB Conference on Information Technology (ACIT’14), 72--79.", "Alaa El-Halees and Ahmed Al-Asmar. 2017. Ontology based Arabic opinion mining. J. Inf. Knowl. Manage. 16, 03 (2017), 1750028.", "Alaa M. El-Halees. 2017. Arabic opinion mining using distributed representations of documents. In Proceedings of the 2017 Palestinian International Conference on Information and Communication Technology (PICICT’17). IEEE, 28--33.", "Ayman El-Kilany, Amr Azzam, and Samhaa R El-Beltagy. 2018. Using deep neural networks for extracting sentiment targets in Arabic tweets. In Intelligent Natural Language Processing: Trends and Applications. Springer, 3--15.", "Nagwa El-Makky, Khaled Nagi, Alaa El-Ebshihy, Esraa Apady, Omneya Hafez, Samar Mostafa, and Shimaa Ibrahim. 2014. Sentiment analysis of colloquial Arabic tweets. In Proceedings of the ASE BigData/SocialInformatics/PASSAT/BioMedCom 2014 Conference. 1--9.", "Mazen El-Masri, Nabeela Altrabsheh, and Hanady Mansour. 2017. Successes and challenges of Arabic sentiment analysis research: A literature review. Soc. Netw. Anal. Min. 7, 1 (2017), 54.", "Mazen El-Masri, Nabeela Altrabsheh, Hanady Mansour, and Allan Ramsay. 2017. A web-based tool for Arabic sentiment analysis. Proc. Comput. Sci. 117 (2017), 38--45.", "Nadine El-Naggar, Yasser El-Sonbaty, and Mohamad Abou El-Nasr. 2017. Sentiment analysis of modern standard Arabic and Egyptian dialectal Arabic tweets. In Proceedings of the Computing Conference 2017. IEEE, 880--887.", "Mohamed Elarnaoty, Samir AbdelRahman, and Aly Fahmy. 2012. A machine learning approach for opinion holder extraction in Arabic language. arXiv preprint arXiv:1206.1011 (2012).", "R. M. Elawady, S. Barakat, H. M. El-Bakry, and N. Elrashidy. 2015. Sentiment analysis for Arabic and English datasets. Int. J. Innov. Comput. Inf. Contr. 15, 1 (2015).", "Rasheed M. Elawady, Sherif Barakat, and Nora M. Elrashidy. 2014. Different feature selection for sentiment classification. Int. J. Inf. Sci. Intell. Syst. 3, 1 (2014), 137--150.", "Heba Elfardy, Mohamed Al-Badrashiny, and Mona Diab. 2014. AIDA: Identifying code switching in informal Arabic text. In Proceedings of the Conference on Empirical Methods in Natural Language Processing (EMNLP’14). 94.", "Heba Elfardy and Mona T. Diab. 2012. Token level identification of linguistic code switching. In Proceedings of the International Conference on Computational Linguistics (COLING’12). 287--296.", "Tarek Elghazaly, Amal Mahmoud, and Hesham A. Hefny. 2016. Political sentiment analysis using twitter data. In Proceedings of the International Conference on Internet of things and Cloud Computing. ACM, 11.", "Mohamed Elhawary and Mohamed Elfeky. 2010. Mining Arabic business reviews. In Proceedings of the 2010 IEEE International Conference on Data Mining Workshops (ICDMW’10). IEEE, 1108--1113.", "AbdelRahim A. Elmadany and Walid Magdy Hamdy Mubarak. 2018. ArSAS: An Arabic speech-act and sentiment corpus of tweets. In Proceedings of the 3rd Workshop on Open-Source Arabic Corpora and Processing Tools (OSACT 3). 20.", "Ashraf Elnagar. 2016. Investigation on sentiment analysis for Arabic reviews. In Proceedings of the 2016 IEEE/ACS 13th International Conference of Computer Systems and Applications (AICCSA’16). IEEE, 1--7.", "Ashraf Elnagar and Omar Einea. 2016. Brad 1.0: Book reviews in arabic dataset. In Proceedings of the 2016 IEEE/ACS 13th International Conference of Computer Systems and Applications (AICCSA’16). IEEE, 1--8.", "Ashraf Elnagar, Omar Einea, and Leena Lulu. 2017. Comparative study of sentiment classification for automated translated latin reviews into Arabic. In Proceedings of the 2017 IEEE/ACS 14th International Conference on Computer Systems and Applications (AICCSA’17). IEEE, 443--448.", "Ashraf Elnagar, Yasmin S. Khalifa, and Anas Einea. 2018. Hotel Arabic-reviews dataset construction for sentiment analysis applications. In Intelligent Natural Language Processing: Trends and Applications. Springer, 35--52.", "Abdeljalil Elouardighi, Hafdalla Hammia, and Mohcine Maghfour. 2017. Collecting and processing multilingual streaming tweets for sentiment analysis. In Proceedings of the International Conference on Information Technology and Communication Systems. Springer, 10--23.", "Abdeljalil Elouardighi, Mohcine Maghfour, and Hafdalla Hammia. 2017. Collecting and processing arabic facebook comments for sentiment analysis. In Proceedings of the International Conference on Model and Data Engineering. Springer, 262--274.", "Mohammed Elrazzaz, Shady Elbassuoni, Khaled Shaban, and Chadi Helwe. 2017. Methodical evaluation of arabic word embeddings. In Proceedings of the 55th Annual Meeting of the Association for Computational Linguistics (Volume 2: Short Papers), Vol. 2. 454--458.", "Hady ElSahar and Samhaa R. El-Beltagy. 2014. A fully automated approach for arabic slang lexicon extraction from microblogs. In Proceedings of the International Conference on Intelligent Text Processing and Computational Linguistics. Springer, 79--91.", "Hady ElSahar and Samhaa R. El-Beltagy. 2015. Building large arabic multi-domain resources for sentiment analysis. In Proceedings of the International Conference on Computational Linguistics and Intelligent Text Processing (CICLing’15). 23--34.", "Ramy Eskander and Owen Rambow. 2015. SLSA: A sentiment lexicon for standard Arabic. In Proceedings of the Conference on Empirical Methods in Natural Language Processing (EMNLP’15). 2545--2550.", "Andrea Esuli and Fabrizio Sebastiani. 2006. SENTIWORDNET: A high-coverage lexical resource for opinion mining. Institute of Information Science and Technologies (ISTI) of the Italian National Research Council (CNR) (2006).", "Noura Farra, Elie Challita, Rawad Abou Assi, and Hazem Hajj. 2010. Sentence-level and document-level sentiment mining for arabic texts. In Proceedings of the 2010 IEEE International Conference on Data Mining Workshops (ICDMW’10). IEEE, 1114--1119.", "Noura Farra and Kathleen McKeown. 2017. Smarties: Sentiment models for arabic target entities. arXiv preprint arXiv:1701.03434 (2017).", "Noura Farra, Kathy McKeown, and Nizar Habash. 2015. Annotating targets of opinions in arabic using crowdsourcing. In Proceedings of the 2nd Workshop on Arabic Natural Language Processing. 89--98.", "Ronen Feldman. 2013. Techniques and applications for sentiment analysis. Commun. ACM 56, 4 (2013), 82--89.", "Christiane Fellbaum. 1998. WordNet. Wiley Online Library.", "Ramy Georges Baly, Me, Gilbert Badaro, Hazem Hajj, Nizar Habash, Wassim El Hajj, and Khaled Shaban. 2014. Semantic model representation for human’s pre-conceived notions in Arabic text with applications to sentiment mining. In Proceedings of the Qatar Foundation Annual Research Conference. ITPP1075.", "Al-Sukkar Ghadeer, Ibrahim Aljarah, and Hamad Alsawalqah. 2017. Enhancing the Arabic sentiment analysis using different preprocessing operators. In Proceedings of the New Trends Inf. Technol. (NTIT’17), 113.", "Hazem Hajj Wassim El-Hajj Gilbert Badaro, Hussein Jundi and Nizar Habash. 2018. ArSEL: A large scale Arabic sentiment and emotion lexicon. In Proceedings of the 11th International Conference on Language Resources and Evaluation (LREC’18).", "José-Angel González, Ferran Pla, and Lluís-F Hurtado. 2017. ELiRF-UPV at SemEval-2017 task 4: Sentiment analysis using deep learning. In Proceedings of the 11th International Workshop on Semantic Evaluation (SemEval’17). 723--727.", "Mario Graff, Eric S. Tellez, Hugo Jair Escalante, and Sabino Miranda-Jiménez. 2017. Semantic genetic programming for sentiment analysis. In Results of the Numerical and Evolutionary Optimization Workshop (NEO’15). Springer, 43--65.", "Mario Graff, Eric S. Tellez, Sabino Miranda-Jiménez, and Hugo Jair Escalante. 2016. Evodag: A semantic genetic programming python library. In Proceedings of the 2016 IEEE International Autumn Meeting on Power, Electronics and Computing (ROPEC’16). IEEE, 1--6.", "Spence Green and Christopher D. Manning. 2010. Better Arabic parsing: Baselines, evaluations, and analysis. In Proceedings of the 23rd International Conference on Computational Linguistics. Association for Computational Linguistics, 394--402.", "Mourad Gridach, Hatem Haddad, and Hala Mulki. 2017. Empirical evaluation of word representations on Arabic sentiment analysis. In Proceedings of the International Conference on Arabic Language Processing. Springer, 147--158.", "Imane Guellil, Ahsan Adeel, Faical Azouaou, and Amir Hussain. 2018. Sentialg: Automated corpus annotation for algerian sentiment analysis. In Proceedings of the International Conference on Brain Inspired Cognitive Systems. Springer, 557--567.", "Nizar Habash, Ramy Eskander, and Abdelati Hawwari. 2012. A morphological analyzer for Egyptian Arabic. In Proceedings of the 12th Meeting of the Special Interest Group on Computational Morphology and Phonology. Association for Computational Linguistics, 1--9.", "Nizar Habash and Owen Rambow. 2005. Arabic tokenization, part-of-speech tagging and morphological disambiguation in one fell swoop. In Proceedings of the 43rd Annual Meeting on Association for Computational Linguistics. Association for Computational Linguistics, 573--580.", "Nizar Habash, Owen Rambow, and Ryan Roth. 2009. MADA+ TOKAN: A toolkit for Arabic tokenization, diacritization, morphological disambiguation, POS tagging, stemming and lemmatization. In Proceedings of the 2nd International Conference on Arabic Language Resources and Tools (MEDAR’09), Vol. 41. 62.", "Nizar Habash and Ryan M. Roth. 2009. CATiB: The Columbia Arabic treebank. In Proceedings of the ACL-IJCNLP 2009 Conference Short Papers. Association for Computational Linguistics, 221--224.", "Nizar Habash and Fatiha Sadat. 2006. Arabic preprocessing schemes for statistical machine translation. In Proceedings of the Human Language Technology Conference of the NAACL, Companion Volume: Short Papers. Association for Computational Linguistics, 49--52.", "Nizar Habash, Abdelhadi Soudi, and Timothy Buckwalter. 2007. On arabic transliteration. In Arabic Computational Morphology. Springer, 15--22.", "Nizar Y. Habash. 2010. Introduction to Arabic natural language processing. Synth. Lect. Hum. Lang. Technol. 3, 1 (2010), 1--187.", "Ali Hamdi, Khaled Shaban, and Anazida Zainal. 2016. A review on challenging issues in Arabic sentiment analysis. J. Comput. Sci. 12, 9 (2016), 471--481.", "Ali Hamdi, Khaled Shaban, and Anazida Zainal. 2018. Clasenti: A class-specific sentiment analysis framework. ACM Trans. Asian Low-Res. Lang. Inf. Process. 17, 4 (2018), 32.", "AL-Rubaiee Hamed, Renxi Qiu, Khalid Alomar, and Dayou Li. 2018. Techniques for improving the labelling process of sentiment analysis in the Saudi stock market. Int. J. Adv. Comput. Technol. 9, 3 (2018), 34--43.", "AL-Rubaiee Hamed, Renxi Qiu, and Dayou Li. 2015. Analysis of the relationship between Saudi twitter posts and the Saudi stock market. In Proceedings of the 2015 IEEE 7th International Conference on Intelligent Computing and Information Systems (ICICIS’15). IEEE, 660--665.", "Alaa El-Dine Ali Hamouda and Fatma El-zahraa El-taher. 2013. Sentiment analyzer for arabic comments system. Int. J. Adv. Comput. Sci. Appl. 4, 3 (2013).", "Safa Ben Hamouda and Jalel Akaichi. 2013. Social networks text mining for sentiment classification: The case of Facebook statuses updates in the Arabic Spring Era. Int. J. Appl. Innov. Eng. Manage. 2, 5 (2013), 470--478.", "Fouzi Harrag. 2014. Estimating the sentiment of arabic social media contents: A survey. In Proceedings of the 5th International Conference on Arabic Language Processing.", "Ahmed Hassan, Amjad Abu-Jbara, Rahul Jha, and Dragomir Radev. 2011. Identifying the semantic orientation of foreign words. In Proceedings of the 49th Annual Meeting of the Association for Computational Linguistics: Human Language Technologies: Short Papers-Volume 2. Association for Computational Linguistics, 592--597.", "Nourah F. Bin Hathlian and Alaaeldin M. Hafezs. 2016. Sentiment-subjective analysis framework for arabic social media posts. In Proceedings of the Saudi International Conference on Information Technology (Big Data Analysis) (KACSTIT’16). IEEE, 1--6.", "Abdel Rahman Hedar and M. Doss. 2013. Mining social networks arabic slang comments. In Proceedings of the IEEE Symposium on Computational Intelligence and Data Mining (CIDM’13).", "David R. Heise. 2007. Expressive Order: Confirming Sentiments in Social Actions. Springer Science 8 Business Media.", "Orland Hoeber, Larena Hoeber, Maha El Meseery, Kenneth Odoh, and Radhika Gopi. 2016. Visual Twitter analytics (vista) temporally changing sentiment and the discovery of emergent themes within sport event tweets. Online Inf. Rev. 40, 1 (2016), 25--41.", "Amal Htait, Sébastien Fournier, and Patrice Bellot. 2017. LSIS at SemEval-2017 task 4: Using adapted sentiment similarity seed words for English and Arabic tweet polarity classification. In Proceedings of the 11th International Workshop on Semantic Evaluation (SemEval’17). 718--722.", "Minqing Hu and Bing Liu. 2004. Mining and summarizing customer reviews. In Proceedings of the 10th ACM SIGKDD International Conference on Knowledge Discovery and Data Mining. ACM, 168--177.", "Hossam S. Ibrahim, Sherif M. Abdou, and Mervat Gheith. 2015. Automatic expandable large-scale sentiment lexicon of modern standard Arabic and colloquial. In Proceedings of the 2015 First International Conference on Arabic Computational Linguistics (ACLing’15). IEEE, 94--99.", "Hossam S Ibrahim, Sherif M Abdou, and Mervat Gheith. 2015. Idioms-proverbs lexicon for modern standard Arabic and colloquial sentiment analysis. arXiv preprint arXiv:1506.01906 (2015).", "Hossam S. Ibrahim, Sherif M. Abdou, and Mervat Gheith. 2015. MIKA: A tagged corpus for modern standard Arabic and colloquial sentiment analysis. In Proceedings of the 2015 IEEE 2nd International Conference on Recent Trends in Information Systems (ReTIS). IEEE, 353--358.", "Hossam S. Ibrahim, Sherif M. Abdou, and Mervat Gheith. 2015. Sentiment analysis for modern standard Arabic and colloquial. arXiv preprint arXiv:1505.03105 (2015).", "Mnahel A. Ibrahim and Naomie Salim. 2016. Aspect oriented sentiment analysis model of Arabic tweets. Int. J. Comput. Sci. Trends Technol. 4, 4 (2016), 342--353.", "Michael Nawar Ibrahim, Mahmoud N. Mahmoud, and Dina A. El-Reedy. 2016. Bel-Arabi: Advanced Arabic grammar analyzer. Int. J. Soc. Sci. Human. 6, 5 (2016), 341.", "Noah Iliinsky and Julie Steele. 2011. Designing Data Visualizations: Representing Informational Relationships. O’Reilly Media, Inc.", "Shimaa Ismail, Abdelwahab Alsammak, and Tarek Elshishtawy. 2016. A generic approach for extracting aspects and opinions of Arabic reviews. In Proceedings of the 10th International Conference on Informatics and Systems. ACM, 173--179.", "Maher Itani, Chris Roast, and Samir Al-Khayatt. 2017. Corpora for sentiment analysis of Arabic text in social media. In Proceedings of the 2017 8th International Conference on Information and Communication Systems (ICICS’17). IEEE, 64--69.", "Maher Itani, Chris Roast, and Samir Al-Khayatt. 2017. Developing resources for sentiment analysis of informal Arabic text in social media. Proc. Comput. Sci. 117 (2017), 129--136.", "Maher M. Itani, Rached N. Zantout, Lama Hamandi, and Islam Elkabani. 2012. Classifying sentiment in arabic social networks: Naive search versus naive bayes. In Proceedings of the 2012 2nd International Conference on Advances in Computational Tools for Engineering Applications (ACTEA’12). IEEE, 192--197.", "Mohammed Jabreel and Antonio Moreno. 2017. SiTAKA at SemEval-2017 task 4: Sentiment analysis in Twitter based on a rich set of features. In Proceedings of the 11th International Workshop on Semantic Evaluation (SemEval’17). 694--699.", "Brendan Jou, Margaret Yuying Qian, and Shih-Fu Chang. 2016. SentiCart: Cartography and geo-contextualization for multilingual visual sentiment. In Proceedings of the 2016 ACM on International Conference on Multimedia Retrieval. ACM, 389--392.", "Nal Kalchbrenner, Edward Grefenstette, and Phil Blunsom. 2014. A convolutional neural network for modelling sentences. arXiv preprint arXiv:1404.2188 (2014).", "Jihen Karoui, Farah Banamara Zitoune, and Veronique Moriceau. 2017. SOUKHRIA: Towards an irony detection system for arabic in social media. Proc. Comput. Sci. 117 (2017), 161--168.", "Gehad S. Kaseb and Mona F. Ahmed. 2016. Arabic sentiment analysis approaches: An analytical survey. Int. J. Sci. Eng. Res. 7, 10 (2016), 712--723.", "Daniel Keim, Gennady Andrienko, Jean-Daniel Fekete, Carsten Gorg, Jorn Kohlhammer, and Guy Melançon. 2008. Visual analytics: Definition, process, and challenges. Lecture Notes in Computer Science 4950 (2008), 154--176.", "Khalid Khalifa and Nazlia Omar. 2014. A hybrid method using lexicon-based approach and naive Bayes classifier for Arabic opinion question answering. J. Comput. Sci. 10, 10 (2014), 1961--1968.", "Salam Khalifa, Sara Hassan, and Nizar Habash. 2017. A morphological analyzer for gulf Arabic verbs. In Arabic Natural Language Processing Workshop (WANLP’17) (Co-located with EACL 2017). 35.", "Talaat Khalil, Amal Halaby, Muhammad Hammad, and Samhaa R. El-Beltagy. 2015. Which configuration works best? an experimental study on supervised Arabic twitter sentiment analysis. In Proceedings of the 2015 First International Conference on Arabic Computational Linguistics (ACLing’15). IEEE, 86--93.", "Muhammad Taimoor Khan and Shehzad Khalid. 2016. Sentiment analysis for health care. In Big Data: Concepts, Methodologies, Tools, and Applications. IGI Global, 676--689.", "Rawan T. Khasawneh, Heider A. Wahsheh, Mohammed N. Al-Kabi, and Izzat M. Alsmadi. 2013. Sentiment analysis of arabic social media content: A comparative study. In Proceedings of the 2013 8th International Conference for Internet Technology and Secured Transactions (ICITST’13). IEEE, 101--106.", "Rawan T. Khasawneh, Heider A. Wahsheh, Izzat M. Alsmadi, and Mohammed N. AI-Kabi. 2015. Arabic sentiment polarity identification using a hybrid approach. In Proceedings of the 2015 6th International Conference on Information and Communication Systems (ICICS’15). IEEE, 148--153.", "H. Kilany, H. Gadalla, H. Arram, A. Yacoub, A. El-Habashi, and C. McLemore. 2002. Egyptian colloquial Arabic lexicon. LDC Catalog Number LDC99L22 (2002).", "Yoon Kim. 2014. Convolutional neural networks for sentence classification. arXiv preprint arXiv:1408.5882 (2014).", "Yoosin Kim and Seung Ryul Jeong. 2015. Opinion-mining methodology for social media analytics. KSII Trans. Internet Inf. Syst. 9, 1 (2015).", "Svetlana Kiritchenko, Saif Mohammad, and Mohammad Salameh. 2016. Semeval-2016 task 7: Determining sentiment intensity of english and arabic phrases. In Proceedings of the 10th International Workshop on Semantic Evaluation (SemEval’16). 42--51.", "Svetlana Kiritchenko and Saif M. Mohammad. 2017. Capturing reliable fine-grained sentiment associations by crowdsourcing and best-worst scaling. arXiv preprint arXiv:1712.01741 (2017).", "Philipp Koehn, Hieu Hoang, Alexandra Birch, Chris Callison-Burch, Marcello Federico, Nicola Bertoldi, Brooke Cowan, Wade Shen, Christine Moran, Richard Zens, et al. 2007. Moses: Open source toolkit for statistical machine translation. In Proceedings of the 45th Annual Meeting of the ACL on Interactive Poster and Demonstration Sessions. Association for Computational Linguistics, 177--180.", "Moshe Koppel, Navot Akiva, Eli Alshech, and Kfir Bar. 2009. Automatically classifying documents by ideological and organizational affiliation. In Proceedings of the IEEE International Conference on Intelligence and Security Informatics 2009 (ISI’09). IEEE, 176--178.", "Mohammed Korayem, David J. Crandall, and Muhammad Abdul-Mageed. 2012. Subjectivity and sentiment analysis of Arabic: A survey. In Proceedings of the International Conference on Advanced Machine Learning Technologies and Applications (AMLTA’12). Springer, 128--139.", "Ankit Kumar, Ozan Irsoy, Peter Ondruska, Mohit Iyyer, James Bradbury, Ishaan Gulrajani, Victor Zhong, Romain Paulus, and Richard Socher. 2016. Ask me anything: Dynamic memory networks for natural language processing. In Proceedings of the International Conference on Machine Learning. 1378--1387.", "Farek Lazhar and Tlili Guiassa Yamina. 2010. Identification of opinions in Arabic newspapers. In Proceedings of the 2010 International Conference on Machine and Web Intelligence (ICMWI’10). IEEE, 317--319.", "Farek Lazhar and Tlili Guiassa Yamina. 2012. Identification of opinions in arabic texts using ontologies. In Proceedings of the Workshop on Ubiquitous Data Mining. IEEE, 61--64.", "Xiaodong Li, Haoran Xie, Li Chen, Jianping Wang, and Xiaotie Deng. 2014. News impact on stock price return via sentiment analysis. Knowl.-Based Syst. 69 (2014), 14--23.", "Shenghua Liu, Wenjun Zhu, Ning Xu, Fangtao Li, Xue-qi Cheng, Yue Liu, and Yuanzhuo Wang. 2013. Co-training and visualizing sentiment evolvement for tweet events. In Proceedings of the 22nd International Conference on World Wide Web. ACM, 105--106.", "Mohamed Maamouri, Ann Bies, Tim Buckwalter, and Wigdan Mekki. 2004. The penn Arabic treebank: Building a large-scale annotated Arabic corpus. In Proceedings of the NEMLAR Conference on Arabic Language Resources and Tools, Vol. 27. 466--467.", "Mohamed Maamouri, Dave Graff, Basma Bouziri, Sondos Krouna, Ann Bies, and Seth Kulick. 2010. Standard Arabic morphological analyzer (SAMA) version 3.1. Linguistic Data Consortium, Catalog No.: LDC2010L01 (2010).", "Andrew L. Maas, Raymond E. Daly, Peter T. Pham, Dan Huang, Andrew Y. Ng, and Christopher Potts. 2011. Learning word vectors for sentiment analysis. In Proceedings of the 49th Annual Meeting of the Association for Computational Linguistics: Human Language Technologies-Volume 1. Association for Computational Linguistics, 142--150.", "Amal Mahmoud and Tarek Elghazaly. 2018. Using Twitter to monitor political sentiment for Arabic slang. In Intelligent Natural Language Processing: Trends and Applications. Springer, 53--66.", "Fawaz H. H. Mahyoub, Muazzam A. Siddiqui, and Mohamed Y. Dahab. 2014. Building an Arabic sentiment lexicon using semi-supervised learning. J. King Saud Univ. Comput. Inf. Sci. 26, 4 (2014), 417--424.", "Adam Marcus, Michael S. Bernstein, Osama Badar, David R. Karger, Samuel Madden, and Robert C. Miller. 2011. Twitinfo: Aggregating and visualizing microblogs for event exploration. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 227--236.", "Yuval Marton, Nizar Habash, and Owen Rambow. 2013. Dependency parsing of modern standard Arabic with lexical and inflectional features. Comput. Ling. 39, 1 (2013), 161--194.", "M’hamed Mataoui, Tadj Eddine Bendali Hacine, Imad Tellache, Abdelghani Bakhtouchi, and Omar Zelmati. 2018. A new syntax-based aspect detection approach for sentiment analysis in Arabic reviews. In Proceedings of the 2018 2nd International Conference on Natural Language and Speech Processing (ICNLSP’18). IEEE, 1--6.", "M’hamed Mataoui, Omar Zelmati, and Madiha Boumechache. 2016. A proposed lexicon-based sentiment analysis approach for the vernacular Algerian Arabic. Res. Comput. Sci. 110 (2016), 55--70.", "Salima Medhaffar, Fethi Bougares, Yannick Esteve, and Lamia Hadrich-Belguith. 2017. Sentiment analysis of tunisian dialects: Linguistic ressources and experiments. In Proceedings of the 3rd Arabic Natural Language Processing Workshop. 55--61.", "Tomas Mikolov, Ilya Sutskever, Kai Chen, Greg S. Corrado, and Jeff Dean. 2013. Distributed representations of words and phrases and their compositionality. In Advances in Neural Information Processing Systems. 3111--3119.", "Sabino Miranda-Jiménez, Mario Graff, Eric Sadit Tellez, and Daniela Moctezuma. 2017. INGEOTEC at SemEval 2017 task 4: A B4MSA ensemble based on genetic programming for Twitter sentiment analysis. In Proceedings of the 11th International Workshop on Semantic Evaluation (SemEval’17). 771--776.", "Emad Mohamed, Behrang Mohit, and Kemal Oflazer. 2012. Annotating and learning morphological segmentation of egyptian colloquial Arabic. In Proceedings of the International Conference on Language Resources and Evaluation (LREC’12). 873--877.", "Saif Mohammad, Felipe Bravo-Marquez, Mohammad Salameh, and Svetlana Kiritchenko. 2018. Semeval-2018 task 1: Affect in tweets. In Proceedings of the 12th International Workshop on Semantic Evaluation. 1--17.", "Saif Mohammad, Mohammad Salameh, and Svetlana Kiritchenko. 2016. Sentiment lexicons for Arabic social media. In Proceedings of the International Conference on Language Resources and Evaluation (LREC’16).", "Saif M. Mohammad. 2012. From once upon a time to happily ever after: Tracking emotions in mail and books. Decis. Supp. Syst. 53, 4 (2012), 730--741.", "Saif M. Mohammad. 2015. Sentiment analysis: Detecting valence, emotions, and other affectual states from text. Emot. Meas. (2015), 201--238.", "Saif M. Mohammad, Svetlana Kiritchenko, and Xiaodan Zhu. 2013. NRC-Canada: Building the state-of-the-art in sentiment analysis of tweets. arXiv preprint arXiv:1308.6242 (2013).", "Saif M. Mohammad, Mohammad Salameh, and Svetlana Kiritchenko. 2016. How translation alters sentiment.J. Artif. Intell. Res. 55 (2016), 95--130.", "Tagwa Abd Elatif Mohammed. 2016. Review of sentiment analysis for classification Arabic tweets. Int. J. Emerg. Technol. Adv. Eng. 6, 3 (2016), 47--53.", "Behrang Mohit, Alla Rozovskaya, Nizar Habash, Wajdi Zaghouani, and Ossama Obeid. 2014. The first QALB shared task on automatic text correction for Arabic. In Proceedings of the EMNLP 2014 Workshop on Arabic Natural Language Processing (ANLP’14). 39--47.", "Ayman Mohamed Mostafa. 2017. An automatic lexicon with exceptional-negation algorithm for Arabic sentiments using supervised classification.J. Theor. Appl. Inf. Technol. 95, 15 (2017).", "Ayman Mohamed Mostafa. 2017. An evaluation of sentiment analysis and classification algorithms for Arabic textual data. Int. J. Comput. Appl. 158, 3 (2017).", "Asmaa Mountassir, Houda Benbrahim, and Ilham Berrada. 2012. Addressing the problem of unbalanced data sets in sentiment analysis. In Proceedings of the International Conference on Knowledge Discovery and Information Retrieval (KDIR’12). 306--311.", "Asmaa Mountassir, Houda Benbrahim, and Ilham Berrada. 2012. A cross-study of sentiment classification on Arabic corpora. In Research and Development in Intelligent Systems XXIX. Springer, 259--272.", "Asmaa Mountassir, Houda Benbrahim, and Ilham Berrada. 2012. An empirical study to address the problem of unbalanced data sets in sentiment classification. In Proceedings of the 2012 IEEE International Conference onSystems, Man, and Cybernetics (SMC). IEEE, 3298--3303.", "Asmaa Mountassir, Houda Benbrahim, and Ilham Berrada. 2012. Some methods to address the problem of unbalanced sentiment classification in an arabic context. In Proceedings of the 2012 Colloquium in Information Science and Technology (CIST). IEEE, 43--48.", "Ahmed Mourad and Kareem Darwish. 2013. Subjectivity and sentiment analysis of modern standard Arabic and Arabic microblogs. In WASSA and Proceedings of the Annual Conference of the North American Chapter of the Association for Computational Linguistics: Human Language Technologies (WASSA@ NAACL-HLT’13). 55--64.", "Hala Mulki, Hatem Haddad, Mourad Gridach, and Ismail Babaoğlu. 2017. Tw-StAR at SemEval-2017 task 4: Sentiment classification of Arabic tweets. In Proceedings of the 11th International Workshop on Semantic Evaluation (SemEval’17). 664--669.", "Manal Mustafa, A. Shakour AlSamahi, and Alaa Hamouda. 2017. New avenues in Arabic sentiment analysis. Int. J. Sci. Eng. Res. 8, 2 (2017), 907--915.", "Mahmoud Nabil, Mohamed Aly, and Amir Atiya. 2014. LABR: A large scale Arabic sentiment analysis benchmark. arXiv preprint arXiv:1411.6718 (2014).", "Mahmoud Nabil, Mohamed A. Aly, and Amir F. Atiya. 2015. ASTD: Arabic sentiment tweets dataset. In Proceedings of the Conference on Empirical Methods in Natural Language Processing (EMNLP’15). 2515--2519.", "Hassan Najadat, Amnah Al-Abdi, and Yasmeen Sayaheen. 2018. Model-based sentiment analysis of customer satisfaction for the Jordanian telecommunication companies. In Proceedings of the 2018 9th International Conference on Information and Communication Systems (ICICS’18). IEEE, 233--237.", "Dhekra Najar and Slim Mesfar. 2014. Political monitoring and opinion mining for standard Arabis texts. In Proceedings of the International NooJ Conference.", "Dhekra Najar and Slim Mesfar. 2017. Opinion mining and sentiment analysis for Arabic on-line texts: Application on the political domain. Int. J. Speech Technol. 20, 3 (2017), 575--585.", "Vu Dung Nguyen, Blesson Varghese, and Adam Barker. 2013. The royal birth of 2013: Analysing and visualising public sentiment in the uk using twitter. In Proceedings of the 2013 IEEE International Conference on Big Data. IEEE, 46--54.", "Aya Nuseir, Mahmoud Al-Ayyoub, Mohammed Al-Kabi, Ghasan Kanaan, and Riyad Al-Shalabi. 2017. Improved hierarchical classifiers for multi-way sentiment analysis. Int. Arab J. Inf. Technol. 14, 4A (2017), 654--661.", "Islam Obaidat, Rami Mohawesh, Mahmoud Al-Ayyoub, Al-Smadi Mohammad, and Yaser Jararweh. 2015. Enhancing the determination of aspect categories and their polarities in arabic reviews using lexicon-based approaches. In Proceedings of the 2015 IEEE Jordan Conference on Applied Electrical Engineering and Computing Technologies (AEECT’15). IEEE, 1--6.", "Nazlia Omar, Mohammed Albared, Adel Qasem Al-Shabi, and Tareq Al-Moslmi. 2013. Ensemble of classification algorithms for subjectivity and sentiment analysis of Arabic customers’ reviews. Int. J. Advance. Comput. Technol. 5, 14 (2013), 77.", "Shereen Oraby, Yasser El-Sonbaty, and Mohamad Abou El-Nasr. 2013. Exploring the effects of word roots for arabic sentiment analysis. In Proceedings of the 6th International Joint Conference on Natural Language Processing. 471--479.", "Shereen Oraby, Yasser El-Sonbaty, and Mohamad Abou El-Nasr. 2013. Finding opinion strength using rule-based parsing for Arabic sentiment analysis. In Proceedings of the Mexican International Conference on Artificial Intelligence. Springer, 509--520.", "Mai Oudah and Khaled Shaalan. 2017. NERA 2.0: Improving coverage and performance of rule-based named entity recognition for Arabic. Nat. Lang. Eng. 23, 3 (2017), 441--472.", "Bo Pang, Lillian Lee, et al. 2008. Opinion mining and sentiment analysis. Found. Trends Inf. Retriev. 2, 1--2 (2008), 1--135.", "Arfath Pasha, Mohamed Al-Badrashiny, Mona T. Diab, Ahmed El Kholy, Ramy Eskander, Nizar Habash, Manoj Pooleery, Owen Rambow, and Ryan Roth. 2014. MADAMIRA: A fast, comprehensive tool for morphological analysis and disambiguation of Arabic. In Proceedings of the International Conference on Language Resources and Evaluation (LREC’14), Vol. 14. 1094--1101.", "Jeffrey Pennington, Richard Socher, and Christopher D. Manning. 2014. Glove: Global vectors for word representation. In Proceedings of the Conference on Empirical Methods in Natural Language Processing (EMNLP’14), Vol. 14. 1532--1543.", "Maria Pontiki, Dimitris Galanis, Haris Papageorgiou, Ion Androutsopoulos, Suresh Manandhar, Al-Smadi Mohammad, Mahmoud Al-Ayyoub, Yanyan Zhao, Bing Qin, Orphée De Clercq, et al. 2016. SemEval-2016 task 5: Aspect based sentiment analysis. In Proceedings of the 10th International Workshop on Semantic Evaluation (SemEval’16). 19--30.", "Maria Pontiki, Dimitris Galanis, John Pavlopoulos, Haris Papageorgiou, Ion Androutsopoulos, and Suresh Manandhar. 2014. SemEval-2014 task 4: Aspect based sentiment analysis. In Proceedings of the 8th International Workshop on Semantic Evaluation (SemEval’14).", "Martin Popel and Zdenek Zabokrtskỳ. 2010. TectoMT: Modular NLP framework. In proceedings of the international conference on Natural Language Processing (NLP’10), 293--304.", "Ali Mustafa Qamar, Suliman A. Alsuhibany, and Syed Sohail Ahmed. 2017. Sentiment classification of twitter data belonging to saudi arabian telecommunication companies. Int. J. Adv. Comput. Sci. Appl. 1, 8 (2017), 395--401.", "Abdullateef M. Rabab’ah, Mahmoud Al-Ayyoub, Yaser Jararweh, and Mohammed N. Al-Kabi. 2016. Evaluating sentistrength for arabic sentiment analysis. In Proceedings of the 2016 7th International Conference on Computer Science and Information Technology (CSIT’16). IEEE, 1--6.", "Limia Rahamatallah, Eltayeb Abuelyaman, and Wafaa Mukhtar. 2014. Constructing opinion mining model of sudanese telecom products. Master Thesis at Sudan University of Science and Technology (SUST).", "Ashwin Rajadesingan, Reza Zafarani, and Huan Liu. 2015. Sarcasm detection on twitter: A behavioral modeling approach. In Proceedings of the 8th ACM International Conference on Web Search and Data Mining. ACM, 97--106.", "Ramy Baly, Alaa Khaddaj, Hazem Hajj, Wassim El-Hajj, Khaled Bashir Shaban. 2018. ArSentD-LEV: A multi-topic corpus for target-based sentiment analysis in Arabic levantine tweets. In Proceedings of the 11th International Conference on Language Resources and Evaluation (LREC’18).", "Eshrag Refaee. 2017. Sentiment analysis for micro-blogging platforms in Arabic. In Proceedings of the International Conference on Social Computing and Social Media. Springer, 275--294.", "Eshrag Refaee and Verena Rieser. 2014. An Arabic Twitter corpus for subjectivity and sentiment analysis. In Proceedings of the International Conference on Language Resources and Evaluation (LREC’14). 2268--2273.", "Eshrag Refaee and Verena Rieser. 2014. Can we read emotions from a smiley face? Emoticon-based distant supervision for subjectivity and sentiment analysis of arabic twitter feeds. In Proceedings of the 5th International Workshop on Emotion, Social Signals, Sentiment and Linked Open Data (LREC’14).", "Eshrag Refaee and Verena Rieser. 2014. Evaluating distant supervision for subjectivity and sentiment analysis on Arabic twitter feeds. In Proceedings of the EMNLP 2014 Workshop on Arabic Natural Language Processing (ANLP’14). 174--179.", "Eshrag Refaee and Verena Rieser. 2014. Subjectivity and sentiment analysis of Arabic twitter feeds with limited resources. In Proceedings of the Workshop on Free/Open-Source Arabic Corpora and Corpora Processing Tools Workshop Programme. 16.", "Eshrag Refaee and Verena Rieser. 2015. Benchmarking machine translated sentiment analysis for Arabic tweets. In Proceedings of the 2015 Conference of the North American Chapter of the Association for Computational Linguistics: Student Research Workshop. 71--78.", "Eshrag Refaee and Verena Rieser. 2016. iLab-edinburgh at SemEval-2016 task 7: A hybrid approach for determining sentiment intensity of Arabic Twitter phrases. In Proceedings of the 10th International Workshop on Semantic Evaluation (SemEval’16). 474--480.", "Internet ICT Telecommunications Reports. {n. d.}. Internet World Users by Language. Top 10 Languages. retrieved June 30, 2017 from https://www.internetworldstats.com/stats7.htm.", "Elaine Cristina Resende, and Aron Culotta. 2015. A demographic and sentiment analysis of e-cigarette messages on Twitter. In Proceedings of the Computational Health Sciences Workshop at the 6th ACM Conference on Bioinformatics, Computational Biology, and Health Informatics (ACM-BCB’15).", "Sandra Rizkallah, Amir Atiya, Hossam ElDin Mahgoub, and Momen Heragy. 2018. Dialect versus MSA sentiment analysis. In Proceedings of the International Conference on Advanced Machine Learning Technologies and Applications. Springer, 605--613.", "Christian Rohrdantz, Ming C. Hao, Umeshwar Dayal, Lars-Erik Haug, and Daniel A. Keim. 2012. Feature-based visual sentiment analysis of text document streams. ACM Trans. Intell. Syst. Technol. 3, 2 (2012), 26.", "Sara Rosenthal, Noura Farra, and Preslav Nakov. 2017. SemEval-2017 task 4: Sentiment analysis in Twitter. In Proceedings of the 11th International Workshop on Semantic Evaluation (SemEval’17). 502--518.", "Sebastian Ruder, Parsa Ghaffari, and John G. Breslin. 2016. A hierarchical model of reviews for aspect-based sentiment analysis. arXiv preprint arXiv:1609.02745 (2016).", "Sebastian Ruder, Parsa Ghaffari, and John G. Breslin. 2016. Insight-1 at semeval-2016 task 5: Deep learning for multilingual aspect-based sentiment analysis. arXiv preprint arXiv:1609.02748 (2016).", "Mohammed Rushdi-Saleh, M. Teresa Martín-Valdivia, L. Alfonso Ureña-López, and José M. Perea-Ortega. 2011. Bilingual experiments with an arabic-english corpus for opinion mining. In Proceedings of the International Conference Recent Advances in Natural Language Processing 2011. 740--745.", "Mohammed Rushdi-Saleh, M. Teresa Martín-Valdivia, L. Alfonso Ureña-López, and José M. Perea-Ortega. 2011. OCA: Opinion corpus for Arabic. J. Assoc. Inf. Sci. Technol. 62, 10 (2011), 2045--2054.", "Motaz Saad, David Langlois, and Kamel Smaïli. 2013. Comparing multilingual comparable articles based on opinions. In Proceedings of the 6th Workshop on Building and Using Comparable Corpora. 105--111.", "Motaz Saad, David Langlois, and Kamel Smaïli. 2014. Building and modelling multilingual subjective corpora. In Proceedings of the 9th International Conference on Language Resources and Evaluation (LREC’14). European Language Resources Association (ELRA).", "Khaled S. Sabra, Rached N. Zantout, Mohamad A. El Abed, and Lama Hamandi. 2017. Sentiment analysis: Arabic sentiment lexicons. In Proceedings of the Conference on Sensors Networks Smart and Emerging Technologies (SENSET’17), 2017. 1--4.", "Janan Ben Salamah and Aymen Elkhlifi. 2014. Microblogging opinion mining approach for kuwaiti dialect. In Proceedings of the International Conference on Computing Technology and Information Management (ICCTIM’14). The Society of Digital Information and Wireless Communication, 388--396.", "Mohammad Salameh, Saif Mohammad, and Svetlana Kiritchenko. 2015. Sentiment after translation: A case-study on arabic social media posts. In Proceedings of the 2015 Conference of the North American Chapter of the Association for Computational Linguistics: Human Language Technologies. 767--777.", "Said A. Salloum, Ahmad Qasim AlHamad, Mostafa Al-Emran, and Khaled Shaalan. 2018. A survey of Arabic text mining. In Intelligent Natural Language Processing: Trends and Applications. Springer, 417--431.", "Wael Salloum and Nizar Habash. 2011. Dialectal to standard Arabic paraphrasing to improve Arabic-English statistical machine translation. In Proceedings of the 1st Workshop on Algorithms and Resources for Modelling of Dialects and Language Varieties. Association for Computational Linguistics, 10--21.", "Younes Samih, Mohammed Attia, Mohamed Eldesouki, Hamdy Mubarak, Ahmed Abdelali, Laura Kallmeyer, and Kareem Darwish. 2017. A neural architecture for dialectal Arabic segmentation. In Proceedings of the Arabic Natural Language Processing Workshop (WANLP’17). 46.", "Arno Scharl, David Herring, Walter Rafelsberger, Alexander Hubmann-Haidvogel, Ruslan Kamolov, Daniel Fischl, Michael Föls, and Albert Weichselbraun. 2017. Semantic systems and visual tools to support environmental communication. IEEE Syst. J. 11, 2 (2017), 762--771.", "SemEval-2017. {n. d.}. International Workshop on Semantic Evaluation. Retrieved September 9, 2017 from http://alt.qcri.org/semeval2017/index.php?id&equals;tasks.", "Khaled Shaalan and Hafsa Raza. 2009. NERA: Named entity recognition for Arabic. J. Assoc. Inf. Sci. Technol. 60, 8 (2009), 1652--1663.", "Amira Shoukry and Ahmed Rafea. 2012. Sentence-level Arabic sentiment analysis. In Proceedings of the 2012 International Conference on Collaboration Technologies and Systems (CTS). IEEE, 546--550.", "Amira Shoukry and Ahmed Rafea. 2015. A hybrid approach for sentiment classification of Egyptian dialect tweets. In Proceedings of the 2015 First International Conference on Arabic Computational Linguistics (ACLing’15). IEEE, 78--85.", "Amira Magdy Shoukry. 2013. Arabic sentence-level sentiment analysis. Master Thesis at the American University in Cairo. Retrieved from http://dar.aucegypt.edu/handle/10526/3536.", "Muazzam Ahmed Siddiqui, Mohamed Yehia Dahab, and Omar Abdullah Batarfi. 2015. Building a sentiment analysis corpus with multifaceted hierarchical annotation. Int. J. Comput. Ling. 6, 2 (2015), 11--25.", "Sanjeera Siddiqui, Azza Abdel Monem, and Khaled Shaalan. 2017. Towards improving sentiment analysis in Arabic. In Proceedings of the International Conference on Advanced Intelligent Systems and Informatics 2016, Aboul Ella Hassanien, Khaled Shaalan, Tarek Gaber, Ahmad Taher Azar, and M. F. Tolba (Eds.). Springer International Publishing, Cham, 114--123.", "Sanjeera Siddiqui, Azza Abdel Monem, and Khaled Shaalan. 2018. Evaluation and enrichment of Arabic sentiment analysis. In Intelligent Natural Language Processing: Trends and Applications. Springer, 17--34.", "Richard Socher, Jeffrey Pennington, Eric H. Huang, Andrew Y. Ng, and Christopher D. Manning. 2011. Semi-supervised recursive autoencoders for predicting sentiment distributions. In Proceedings of the Conference on Empirical Methods in Natural Language processing. Association for Computational Linguistics, 151--161.", "Richard Socher, Alex Perelygin, Jean Y. Wu, Jason Chuang, Christopher D. Manning, Andrew Y. Ng, Christopher Potts, et al. 2013. Recursive deep models for semantic compositionality over a sentiment treebank. In Proceedings of the Conference on Empirical Methods in Natural Language Processing (EMNLP’13), Vol. 1631. 1642.", "Abu Bakr Soliman, Kareem Eissa, and Samhaa R. El-Beltagy. 2017. Aravec: A set of arabic word embedding models for use in arabic nlp. Proc. Comput. Sci. 117 (2017), 256--265.", "Taysir Hassan Soliman, M. A. Elmasry, A. Hedar, and M. M. Doss. 2014. Sentiment analysis of Arabic slang comments on facebook. Int. J. Comput. Technol. 12, 5 (2014), 3470--3478.", "Robert Speer, Joshua Chin, and Catherine Havasi. 2017. ConceptNet 5.5: An open multilingual graph of general knowledge. In Proceedings of the Conference of the Association for the Advancement of Artificial Intelligence (AAAI’17). 4444--4451.", "F. Steiner-Correa, M. I. Viedma-del Jesus, and A. G. Lopez-Herrera. 2017. A survey of multilingual human-tagged short message datasets for sentiment analysis tasks. Soft Comput. 22, 24 (2017), 8227--8242.", "Aleš Tamchyna and Kateřina Veselovská. 2016. Ufal at semeval-2016 task 5: Recurrent neural networks for sentence classification. In Proceedings of the 10th International Workshop on Semantic Evaluation (SemEval’16). 367--371.", "Duyu Tang, Bing Qin, and Ting Liu. 2015. Document modeling with gated recurrent neural network for sentiment classification. In Proceedings of the Conference on Empirical Methods in Natural Language Processing (EMNLP’15). 1422--1432.", "Samir Tartir and Ibrahim Abdul-Nabi. 2017. Semantic sentiment analysis in Arabic social media. J. King Saud Univ.-Comput. Inf. Sci. 29, 2 (2017), 229--233.", "Eric S. Tellez, Sabino Miranda-Jiménez, Mario Graff, Daniela Moctezuma, Ranyart R. Suárez, and Oscar S. Siordia. 2017. A simple approach to multilingual polarity classification in Twitter. Pattern Recogn. Lett. 94 (2017), 68--74.", "Mike Thelwall. 2013. Heart and soul: Sentiment strength detection in the social web with sentistrength. Proc. CyberEmot. 5 (2013), 1--14.", "Megan K. Torkildson, Kate Starbird, and Cecilia Aragon. 2014. Analysis and visualization of sentiment and emotion on crisis tweets. In Proceedings of the International Conference on Cooperative Design, Visualization and Engineering. Springer, 64--67.", "Imen Touati, Marwa Graja, Mariem Ellouze, and Lamia Hadrich Belguith. 2016. Arabic fine-grained opinion categorization using discriminative machine learning technique. In Proceedings of the International Conference on Advanced Intelligent Systems and Informatics. Springer, 104--113.", "Imen Touati, Marwa Graja, Mariem Ellouze, and Lamia Hadrich Belguith. 2016. Towards Arabic semantic opinion mining: Identifying opinion, polarity and intensity. In Proceedings of the Mediterranean Conference on Pattern Recognition and Artificial Intelligence. ACM, 131--136.", "Peter D. Turney and Michael L. Littman. 2002. Unsupervised learning of semantic orientation from a hundred-billion-word corpus. arXiv preprint cs/0212012 (2002).", "Heider A. Wahsheh, Mohammed N. Al-Kabi, and Izzat M. Alsmadi. 2013. SPAR: A system to detect spam in Arabic opinions. In Proceedings of the 2013 IEEE Jordan Conference on Applied Electrical Engineering and Computing Technologies (AEECT’13). IEEE, 1--6.", "Changbo Wang, Zhao Xiao, Yuhua Liu, Yanru Xu, Aoying Zhou, and Kang Zhang. 2013. SentiView: Sentiment analysis and visualization for internet popular topics. IEEE Trans. Hum.-Mach. Syst. 43, 6 (2013), 620--630.", "Florence Ying Wang, Arnaud Sallaberry, Karsten Klein, Masahiro Takatsuka, and Mathieu Roche. 2015. SentiCompass: Interactive visualization for exploring and comparing the sentiments of time-varying twitter data. In Proceedings of the 2015 IEEE Pacific Visualization Symposium (PacificVis’15). IEEE, 129--133.", "Hao Wang, Ayman Hanafy, Mohamed Bahgat, Sara Noeman, Ossama S. Emam, and Vijay R. Bommireddipalli. 2015. A system for extracting sentiment from large-scale Arabic social data. In Proceedings of the 2015 First International Conference on Arabic Computational Linguistics (ACLing’15). IEEE, 71--77.", "Furu Wei, Shixia Liu, Yangqiu Song, Shimei Pan, Michelle X. Zhou, Weihong Qian, Lei Shi, Li Tan, and Qiang Zhang. 2010. Tiara: A visual exploratory text analytic system. In Proceedings of the 16th ACM SIGKDD International Conference on Knowledge Discovery and Data Mining. ACM, 153--162.", "Andreas Weiler, Michael Grossniklaus, and Marc H. Scholl. 2015. The Stor-e-Motion Visualization for Topic Evolution Tracking in Text Data Streams.", "Theresa Wilson, Janyce Wiebe, and Paul Hoffmann. 2005. Recognizing contextual polarity in phrase-level sentiment analysis. In Proceedings of the Conference on Human Language Technology and Empirical Methods in Natural Language Processing. Association for Computational Linguistics, 347--354.", "Tom Young, Devamanyu Hazarika, Soujanya Poria, and Erik Cambria. 2017. Recent trends in deep learning based natural language processing. arXiv preprint arXiv:1708.02709 (2017).", "La-sheng Yu and Sadeq al Baadani. 2018. A sentiment analysis approach based on Arabic social media platforms. In proceedings of the International Conference on Mechanical, Electronic and Information Technology (ICMEIT’18). 504--510.", "Wajdi Zaghouani, Behrang Mohit, Nizar Habash, Ossama Obeid, Nadi Tomeh, Alla Rozovskaya, Noura Farra, Sarah Alkuhlani, and Kemal Oflazer. 2014. Large scale Arabic error annotation: Guidelines and framework. In Proceedings of the International Conference on Language Resources and Evaluation (LREC’14). 2362--2369.", "Omar F. Zaidan and Chris Callison-Burch. 2014. Arabic dialect identification. Comput. Ling. 40, 1 (2014), 171--202.", "Taoufiq Zarra, Raddouane Chiheb, Rajae Moumen, Rdouan Faizi, and Abdellatif El Afia. 2017. Topic and sentiment model applied to the colloquial Arabic: A case study of maghrebi Arabic. In Proceedings of the 2017 International Conference on Smart Digital Environment. ACM, 174--181.", "Rabih Zbib, Erika Malchiodi, Jacob Devlin, David Stallard, Spyros Matsoukas, Richard Schwartz, John Makhoul, Omar F. Zaidan, and Chris Callison-Burch. 2012. Machine translation of Arabic dialects. In Proceedings of the 2012 Conference of the North American Chapter of the Association for Computational Linguistics: Human Language Technologies. Association for Computational Linguistics, 49--59.", "Imed Zitouni, Jeffrey S. Sorensen, and Ruhi Sarikaya. 2006. Maximum entropy based restoration of Arabic diacritics. In Proceedings of the 21st International Conference on Computational Linguistics and the 44th Annual Meeting of the Association for Computational Linguistics. Association for Computational Linguistics, 577--584."]}, {"title": "Augmenting Data Quality through High-Precision Gender Categorization", "authors": ["Daniel Müller\n,", "Pratiksha Jain\n,", "Yieh-Funk Te"], "publication": "Journal of Data and Information Quality", "abstract": "Abstract\nMappings of first name to gender have been widely recognized as a critical tool for the completion, study, and validation of data records in a range of areas. In this study, we investigate how organizations with large databases of existing entities can create their own mappings between first names and gender and how these mappings can be improved and utilized. Therefore, we first explore a dataset with demographic information on more than 4 million people, which was provided by a car insurance company. Then, we study how naming conventions have changed over time and how they differ by nationality. Next, we build a probabilistic first-name-to-gender mapping and augment the mapping by adding nationality and decade of birth to improve the mapping's performance. We test our mapping in two-label and three-label settings and further validate our mapping by categorizing patent filings by gender of the inventor. We compare the results with previous studies’ outcomes and find that our mapping produces high-precision results. We validate that the additional information of nationality and year of birth improve the precision scores of name-to-gender mappings. Therefore, the proposed approach constitutes an efficient process for improving the data quality of organizations’ records, if the gender attribute is missing or unreliable.", "references": ["Abdulkhaliq Alharthi, Vlad Krotov, and Michael Bowman. 2017. Addressing barriers to big data. Business Horizons 60, 3 (2017), 285--292.", "Shlomo Argamon, Jean Baptiste Goulain, Russel Horton, and Mark Olsen. 2017. DHQ : Digital humanities quarterly - vive la différence! Text Mining Gender Difference in French Literature 3, 2 (2017), 1--11.", "Gustavo Batista and Maria Carolina Monard. 2003. An analysis of four missing data treatment methods for supervised learning. Applied Artificial Intelligence 17, 5--6 (2003), 519--533.", "Cameron Blevins and Lincoln Mullen. 2015. Jane, John … Leslie? A historical method for algorithmic gender prediction. Digital Humanities Quarterly 9, 3 (2015), 1--19.", "Li Cai and Zhu Yangyong. 2015. The challenges of data quality and data quality assessment in the big data Era. Data Science Journal 14 (2015), 2. https://datascience.codata.org/articles/10.5334/dsj-2015-002/", "Murat Celik Alp. 2015. Does the Cream Always Rise to the Top ? The Misallocation of Talent in Innovation. University of Toronto. Working Paper. (2015).", "Hsinchun Chen and Veda C. Storey. 2012. Business intelligence and analytics: From big data to big impact. MIS Quarterly 36, 4 (2012), 1165--1188.", "Injazz Chen and Karen Popovich. 2017. Understanding customer relationship management (CRM): People, process and technology. Business Process Management Journal 21, 2 (2017), 191--206.", "David Colquhoun. 2014. An investigation of the false discovery rate and the misinterpretation of P values. Royal Society Open Science (2014), 1--15.", "Max Coltheart. 1981. MRC psycholinguistic database. Quarterly Journal of Experimental Psychology 33 (1981), 497--505.", "Lisa D. Cook. 2011. Inventing social capital: Evidence from African American inventors from 1843--1930. 48, 4 (2011), 507--518.", "William K. Darley and Robert E. Smith. 1995. Gender differences in information processing strategies: An empirical test of the selectivity model in advertising response. Journal of Advertising 24 1 (1995), 41--56.", "Yair Wand and Richard Y. Wang. 1996. Anchoring data quality dimensions in ontological foundations. Commun. ACM 39, 11 (1996), 86--95.", "William Deitrick, Zachary Miller, Benjamin Valyou, Brian Dickinson, Timothy Munson, and Wei Hu. 2012. Author gender prediction in an email stream using neural networks. Journal of Intelligent Learning Systems and Applications 4 (2012), 169--175.", "Flugzentrale. 2018. Die beliebtesten Schweizer Nachnamen. https://flugzentrale.de/1905/blog/swiss-surnames.", "Charles Duhigg. 2012. How companies learn your secrets. New York Times Magazine (2012), 1--16.", "Federal Statistical Office—Look for Statistics. 2017. https://www.bfs.admin.ch/bfs/en/home/statistics.html. Accessed: 2017-03-02.", "Andrew Goldstone and Ted Underwood. 2014. The quiet transformations of literary studies: What thirteen thousand scholars could tell us. New Literary History 45, 3 (2014), 359--384.", "Lifang Gu, Rohan Baxter, Deanne Vickers, and Chris Rainsford. 2003. Record Linkage: Current Practice and Future Directions. CSIRO Mathematical and Information Sciences. Technical Report (2003).", "Venkat Gudivada, Amy Apon, and Junhua Ding. 2017. Data quality considerations for big data and machine learning: Going beyond data cleaning and transformations. International Journal on Advances in Software 10, 1 (2017), 1--20.", "Hu Jian, Hua-Jun Zeng, Hua Li, Cheng Niu, and Zheng Chen. 2007. Demographic prediction based on user's browsing behavior. WWW 2006, Data Mining (2007), 151--160.", "Jennifer Hunt, Jean-Philippe Garant, Hannah Herman, and David J. Munroe. 2013. Why are women underrepresented amongst patentees? Research Policy 42, 4 (2013), 831--843.", "Benjamin Jones. 2017. The burden of knowledge and the “death of the renaissance man”: Is innovation getting harder? Review of Economic Studies 76 (2017), 283--317.", "Taehyun Jung and Olof Ejermo. 2014. Technological forecasting 8 social change demographic patterns and trends in patenting: Gender, age, and education of inventors. Technological Forecasting 8 Social Change 86 (2014), 110--124.", "Lens patent database. 2017. https://www.lens.org/lens/.", "Catherine Ludwig, Stefanoi Cavalli, and Michel Oris. 2014. “Vivre / Leben / Vivere”: An interdisciplinary survey addressing progress and inequalities of aging over the past 30 years in Switzerland. Archives of Gerontology and Geriatrics 59, 2 (2014), 240--248.", "Jessica Milli, Barbara Gault, Emma Williams-Barron, Jenny Xia, and Meika Berlan. 2016. The gender patenting gap. Briefing Paper, Stem and Innovation. Institute for Women’s Policy Research. Washington, DC. (2016), 1--10.", "Daniel Müller, Te Yieh-Funk, and Pratiksha Jain. 2017. Improving data quality through high precision gender categorization. In Proceedings of the 2017 IEEE International Conference on Big Data (Big Data). 2546--2554.", "Paulo Oliveira, Fátima Henriques, and Pedro Henriques. 2005. A formal definition of data quality problems. In Proceedings of the 2005 International Conference on Information Quality. MIT, Boston, MA, 1--14.", "Ken Orr. 1998. Data quality and systems. Communications of the ACM. 41, 2 (1998).", "Leo Pipino, Yang W. Lee, and Richard Y. Wang. 2002. Data quality assessment. Communications of the ACM 45, 4 (2002), 211.", "Qin Yongsong, Shichao Zhang, Xiaofeng Zhu, Jilian Zhang, and Chengqi Zhang. 2007. Semi-parametric optimization for missing data imputation. Applied Intelligence 27, 1 (2007), 79--88.", "Vijay Raghavan, Peter Bollmann, and Gwang S. Jung. 1989. A critical investigation of recall and precision as measures of retrieval system performance. ACM Transactions on Information Systems 7, 3 (1989), 205--229.", "Barna Saha and Divesh Srivastava. 2014. Data quality: The other face of big data. In Proceedings of the IEEE 30th International Conference on Data Engineering (ICDE’14). Chicago, Illinois, 1294--1297.", "Kai-Uwe Sattler and Eike Schallehn. 2001. A Data Preparation Framework based on a Multidatabase Language. In Proceedings of the International Database Engineering and Applications Symposium. 219--228.", "Helena Galhardas, Daniela Florescu, Dennis Shasha, Eric Simon, and Cristian-Augustin Saita. (2001). Improving data cleaning quality using a data lineage facility. In Proceedings of the 3rd Intl. Workshop on Design and Management of Data Warehouses. (DMDW’01). Interlaken, Switzerland.", "Statista. 2017. Share of Patent Applicants that were Female in Switzerland from 1980 to 2013 Statista Accounts. https://www.statista.com/statistics/422266/share-of-women-inventors-female-patent-applicants-y-on-y-switzerland/.", "Statistiken über das Telefonbuch der Schweiz. 2018. http://www.adp-gmbh.ch/misc/tel_book_ch.html.", "Cassidy R. Sugimoto, Chaoqun Ni, Jevin D. West, and Vincent Larivi. 2015. The Academic Advantage: Gender Disparities in Patentingpatenting. PLoS One 10, 5 (2015), 1--10.", "Muhammad Umar Sultan and Nasir Uddin. 2011. Consumers’ Attitude towards Online Shopping. Master thesis, Department of Business Administration. Högskolan på Gotland VT2011.", "Giri Kumar Tayi and Donald P. Ballou. 1998. Examining data quality. Communications of the ACM 41, 2 (1998), 54--57.", "Richard Y. Wang, Veda C. Storey, and Christopher P. Firth. 1995. A framework for analysis of data quality research. IEEE Transactions on Knowledge and Data Engineering 7, 4 (1995), 623--640.", "Erik B. Weiser. 2000. Gender differences in Internet use patterns and Internet application preferences: A two-sample comparison. CyberPsychology 8 Behavior (2000).", "Swissinfo. 2017. Welches sind die häufigsten Schweizer Nachnamen? https://www.swissinfo.ch/ger/wirtschaft/umstrittene-aliasnamen-in-callcentern_welches-sind-die-haeufigsten-schweizer-nachnamen/43291670.", "Shen Xue-wu, Nie Gui-hua, and Shen Yan Ling. 2006. Gender-based differences in the effect of web advertising in e-business. In Proceedings of the International Conference on Management Science and Engineering. 78--83.", "Lijun Zhou and Tao Wang. 2014. Socialmedia: A new vehicle for citymarketing in China. Cities 37 (2014), 27--32."]}, {"title": "A Supplementary Feature Set for Sentiment Analysis in Japanese Dialogues", "authors": ["Peter Lajos Ihasz\n,", "Mate Kovacs\n,", "Ian Piumarta\n,", "Victor V. Kryssanov"], "publication": "ACM Transactions on Asian and Low-Resource Language Information Processing", "abstract": "Abstract\nRecently, real-time affect-awareness has been applied in several commercial systems, such as dialogue systems and computer games. Real-time recognition of affective states, however, requires the application of costly feature extraction methods and/or labor-intensive annotation of large datasets, especially in the case of Asian languages where large annotated datasets are seldom available. To improve recognition accuracy, we propose the use of cognitive context in the form of “emotion-sensitive” intentions. Intentions are often represented through dialogue acts and, as an emotion-sensitive model of dialogue acts, a tagset of interpersonal-relations-directing interpersonal acts (the IA model) is proposed. The model's adequacy is assessed using a sentiment classification task in comparison with two well-known dialogue act models, the SWBD-DAMSL and the DIT++. For the assessment, five Japanese in-game dialogues were annotated with labels of sentiments and the tags of all three dialogue act models which were used to enhance a baseline sentiment classifier system. The adequacy of the IA tagset is demonstrated by a 9% improvement to the baseline sentiment classifier's recognition accuracy, outperforming the other two models by more than 5%.", "references": ["O. Abdel-Hamid, L. Deng, and D. Yu. 2013. Exploring convolutional neural network structures and optimization techniques for speech recognition. In Proceedings of 14th Annual Conference of the International Speech Communication Association (INTERSPEECH'13).", "J. Ang, R. Dhillon, A. Krupski, E. Shriberg, and A. Stolcke. 2002. Prosody-based automatic detection of annoyance and frustration in human-computer dialog. In Proceedings of the 7th International Conference on Spoken Language Processing (INTERSPEECH'02).", "Y. Arimoto and H. Mori. 2017. Emotion category mapping to emotional space by cross-corpus emotion labeling. In Proceedings of the International Conference on Situated Interaction (INTERSPEECH'17).", "A. Batliner, K. Fischer, R. Huber, J. Spilker, and E. Noth. 2003. How to find trouble in communication. Speech Communication 40, 1 117--143.", "P. Brown and S. C. Levinson. 1987. Politeness: Some Universals in Language Usage (Vol. 4), Cambridge University Press, Cambridge.", "H. Bunt. 2009. The DIT++ taxonomy for functional dialogue markup. In Proceedings of AAMAS 2009 Work. 13--24.", "H. Bunt. 2011. Multifunctionality in dialogue. Comput. Speech Lang. 25 222--245.", "H. Bunt, J. Alexandersson, J. Choe, A. C. Fang, K. Hasida, V. Petukhova, A. Popescu-Belis, and D. Traum. 2012. ISO 24617-2: A semantically-based standard for dialogue annotation. In Proceedings of LREC 2012. 430--437.", "H. Bunt, V. Petukhova, D. Traum, and J. Alexandersson. 2017. Dialogue Act Annotation with the ISO 24617-2 Standard. Multimodal Interaction with W3C Standards: Towards Natural User Interfaces to Everything, Deborah Dahl (Ed.). Springer, Berlin, 109--135.", "J. Chung, C. Gulcehre, K. Cho, and Y. Bengio. 2014. Empirical evaluation of gated recurrent neural networks on sequence modeling. ArXiv1--9.", "D. Duncan, G. Shine, and C. English. 2016. Facial Emotion Recognition in Real Time. Report, Stanford.", "F. Eyben, M. Wolmiller, and B. Schuller. 2009. OpenEAR—Introducing the Munich open-source emotion and affect recognition toolkit. In Proceedings of the International Conference on Affective Computing and Intelligent Interaction. IEEE, 1--6.", "H. M. Fayek, M. Lech, and L. Cavedon. 2015. Towards real-time speech emotion recognition using deep neural networks. In Proceedings of the Conference on Signal Processing and Communication Systems (ICSPCS). IEEE, 1--5.", "N. H. Frijda. 1987. Emotion, cognitive structure, and action tendency. Cogn. Emot. 1 115--143.", "P. L. Ihasz, T. H. Van, and V. V. Kryssanov. 2015. A computational model for conversational Japanese. In Proceedings of 2015 International Conference on Culture and Computing. 64--71.", "D. Jurafsky, E. Shriberg, and D. Biasca. 1997. Switchboard SWBD-DAMSL Shallow Discourse-Function Annotation (Coders Manual, Draft 13). Technical Report 97-02. University of Colorado, Institute of Cognitive Science, Colorado.", "D. P. Kingma and J. Ba. 2014. Adam: A Method for Stochastic Optimization. ArXiv Preprint ArXiv:1412.6980.", "C. M. Lee and S. S. Narayanan. 2005. Toward detecting emotions in spoken dialogs. IEEE Transactions on Speech and Audio Processing 13, 2, 293--303.", "J. Liscombe, G. Riccardi, and D. Hakkani-Tur. 2005. Using context to improve emotion detection in spoken dialog systems. In Proceedings of the 9th European Conference on Speech Communication and Technology (INTERSPEECH'05).", "M. Mateas and A. Stern. 2005. Structuring content in the façade interactive drama architecture. In Proceedings of the 1st Artificial Intelligence and Interactive Digital Entertainment Conference. 93--98.", "Y. Matsumoto. 1988. Reexamination of the universality of face: Politeness phenomena in Japanese. Journal of Pragmatics 12, 4 (1988), 403--426.", "M. Obaid, C. Han, and M. Billinghurst. 2008. Feed the fish: An affect-aware game. In Proceedings of the 5th Australasian Conference on Interactive Entertainment. ACM.", "D. W. Opitz and R. Maclin. 1999. Popular ensemble methods: An empirical study. Journal of Artificial Intelligence Resources 11, 169--198.", "J. Pennington, R. Socher, and C. D. Manning. 2014. GloVe: Global vectors for word representation. In Proceedings of the 2014 Conference on Empirical Methods of Natural Language Processes. 532--543.", "S. Planet and I. Iriondo. 2012. Comparison between decision-level and feature-level fusion of acoustic and linguistic features for spontaneous emotion recognition. In Proceedings of the 7th Iberian Conference on Information Systems and Technologies (CISTI). IEEE, 1--6.", "R. Plutchik. 2001. The nature of emotions. American Scientist 89, 4, 344--350.", "A. Popescu-Belis. 2008. Dimensionality of dialogue act tagsets: An empirical analysis of large corpora. Language Res. Eval. 42, 99--107.", "J. A. Russel. 1980. A circumplex model of affect. Journal of Personality and Social Psychology 39, 6, 1161.", "M. Szwoch and W. Szwoch. 2014. Emotion recognition for affect aware video games. Image Processing 8 Communications Challenges 6, 313, 227.", "L. Tian, J. D. Moore, and C. Lai. 2015. Emotion recognition in spontaneous and acted dialogues. In Proceedings of the 2015 International Conference on Affective Computing and Intelligent Interaction. IEEE, 698--704.", "T. Vogt, E. Andre, and N. Bee. 2008. Emovoice—A framework for online recognition of emotions from voice. In Proceedings of the 4th Tutorial and Research Workshop on Perception in Multimodal Dialogue Systems. IEEE, 188--199.", "Wikimedia Project Editors. 2017. Wikimedia database dump of the Japanese Wikipedia on July 20, 2016, https://archive.org/details/jawiki-20160720, Last accessed: 2017/09/04.", "H. Yoon, S. Park, Y. K. Lee, and J. H. Jang. 2013. Emotion recognition of serious game players using a simple brain computer interface. In Proceedings of ICT Convergence (ICTC). IEEE, 783--786."]}, {"title": "Integrating Multi-level Tag Recommendation with External Knowledge Bases for Automatic Question Answering", "authors": ["Eduardo Lima\n,", "Weishi Shi\n,", "Xumin Liu\n,", "Qi Yu"], "publication": "ACM Transactions on Internet Technology", "abstract": "Abstract\nWe focus on using natural language unstructured textual Knowledge Bases (KBs) to answer questions from community-based Question-and-Answer (Q8A) websites. We propose a novel framework that integrates multi-level tag recommendation with external KBs to retrieve the most relevant KB articles to answer user posted questions. Different from many existing efforts that primarily rely on the Q8A sites’ own historical data (e.g., user answers), retrieving answers from authoritative external KBs (e.g., online programming documentation repositories) has the potential to provide rich information to help users better understand the problem, acquire the knowledge, and hence avoid asking similar questions in future. The proposed multi-level tag recommendation best leverages the rich tag information by first categorizing them into different semantic levels based on their usage frequencies. A post-tag co-clustering model, augmented by a two-step tag recommender, is used to predict tags at different levels for a given user posted question. A KB article retrieval component leverages the recommended multi-level tags to select the appropriate KBs and search/rank the matching articles thereof. We conduct extensive experiments using real-world data from a Q8A site and multiple external KBs to demonstrate the effectiveness of the proposed question-answering framework.", "references": ["Junwei Bao, Nan Duan, Ming Zhou, and Tiejun Zhao. 2014. Knowledge-based question answering as machine translation. Cell 2, 6 (2014).", "David M. Blei, Andrew Y. Ng, and Michael I. Jordan. 2003. Latent dirichlet allocation. J. Mach.-Learn. Res. 3 (2003), 993--1022.", "Yanhua Chen, Manjeet Rege, Ming Dong, and Jing Hua. 2008. Non-negative matrix factorization for semi-supervised data clustering. Knowl. Info. Syst. 17, 3 (2008), 355--379.", "Philipp Cimiano, Michael Erdmann, and Günter Ladwig. 2007. Corpus-based pattern induction for a knowledge-based question answering approach. In Proceedings of the IEEE International Conference on Semantic Computing (ICSC’07). IEEE, 671--678.", "Peter Clark, John Thompson, and Bruce Porter. 1999. A knowledge-based approach to question-answering. In Proceedings of the AAAI Conference on Artificial Intelligence (AAAI’99), Vol. 99. Citeseer, 43--51.", "Oracle Corporation. {n.d.}. The Java Language Specification, Java SE 8th Edition. Retrieved from http://docs.oracle.com/javase/specs/jls/se8/html/index.html.", "Oracle Corporation. {n.d.}. Java Platform, Standard Edition 8 API Specification. Retrieved from https://docs.oracle.com/javase/8/docs/api/index.html.", "Daniel Hasan Dalip, Marcos André Gonçalves, Marco Cristo, and Pavel Calado. 2013. Exploiting user feedback to learn to rank answers in Q8A forums: A case study with stack overflow. In Proceedings of the International ACM SIGIR Conference on Research and Development in Information Retrieval. ACM, 543--552.", "Inderjit S. Dhillon. 2001. Co-clustering documents and words using bipartite spectral graph partitioning. In Proceedings of the Conference on Knowledge Discovery and Data Mining (KDD’01). ACM, 269--274.", "Stack Exchange. {n.d.}. Stack Exchange Data Dump. Retrieved from https://archive.org/details/stackexchange.", "Anthony Fader, Luke Zettlemoyer, and Oren Etzioni. 2014. Open question answering over curated and extracted knowledge bases. In Proceedings of the Knowledge Discovery and Data Mining (KDD’14). ACM, 1156--1165.", "Django Software Foundation. {n.d.}. Django Documentation. Retrieved from https://docs.djangoproject.com/en/1.9/.", "Python Software Foundation. {n.d.}. The Python Language Reference. Retrieved from https://docs.python.org/3/reference/index.html.", "Python Software Foundation. {n.d.}. The Python Standard Library. Retrieved from https://docs.python.org/3/library/index.html.", "The Mozilla Foundation. {n.d.}. JavaScript Reference. Retrieved from https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference.", "The PHP Group. {n.d.}. PHP Documentation, PHP 7. Retrieved from http://php.net/docs.php.", "Ulf Hermjakob, Eduard H. Hovy, and Chin-Yew Lin. 2002. Knowledge-based question answering. In Proceedings of the SCI Conference.", "Google Incorporated. {n.d.}. Android Reference. Retrieved from http://developer.android.com/reference/packages.html.", "Jin Liu, Pingyi Zhou, Zijiang Yang, Xiao Liu, and John Grundy. 2018. FastTagRec: Fast tag recommendation for software information sites. Auto. Softw. Eng. (2018), 1--27.", "Stefania Mariano and Andrea Casey. 2007. The process of knowledge retrieval: A case study of an American high-technology research, engineering and consulting company. VINE 37, 3 (2007), 314--330.", "Avigit K. Saha, Ripon K. Saha, and Kevin A. Schneider. 2013. A discriminative model approach for suggesting tags automatically for stack overflow questions. In Proceedings of the Mining Software Repositories Conference (MSR’13). IEEE Press, 73--76.", "A. K. Singh, N. K. Nagwani, and S. Pandey. 2017. TAGme: A topical folksonomy based collaborative filtering for tag recommendation in community sites. In Proceedings of the 4th Multidisciplinary International Social Networks Conference. ACM, 27.", "Parikshit Sondhi and ChengXiang Zhai. 2014. Mining semi-structured online knowledge bases to answer natural language questions on community QA websites. In Proceedings of the ACM International Conference on Information and Knowledge Management (CIKM’14). ACM, 341--350.", "Huan Sun, Hao Ma, Xiaodong He, Wen-tau Yih, Yu Su, and Xifeng Yan. 2016. Table cell search for question answering. In Proceedings of the World Wide Web Conference (WWW’16). 771--782.", "Robert West, Evgeniy Gabrilovich, Kevin Murphy, Shaohua Sun, Rahul Gupta, and Dekang Lin. 2014. Knowledge base completion via search-based question answering. In Proceedings of the World Wide Web Conference (WWW’14). ACM, 515--526.", "Yiyu Yao, Yi Zeng, Ning Zhong, and Xiangji Huang. 2007. Knowledge retrieval (KR). In Proceedings of the Web Intelligence Consortium (WIC’07). IEEE, 729--735.", "Zhiping Zheng. 2003. Question answering using web news as knowledge base. In Proceedings of the Conference of the European Chapter of the Association for Computational Linguistics (EACL’03). ACL, 251--254.", "Zhou Zhibin, Shi Shuicai, Li Yuqin, and Lv Xueqiang. 2010. An answer extraction method of simple question based on web knowledge library. In Proceedings of the Workshop on Education Technology and Computer Science (ETCS’10), Vol. 1. IEEE, 308--311.", "P. Zhou, J. Liu, Z. Yang, and G. Zhou. 2017. Scalable tag recommendation for software information sites. In Proceedings of the IEEE 24th International Conference on Software Analysis, Evolution and Reengineering (SANER’17). 272--282."]}, {"title": "Spectral Clustering-based Matrix Completion Method for Top-n Recommendation", "authors": ["Qingmei Zhou\n,", "Xin Chen\n,", "Jiuya Zhang"], "publication": "ICCDE' 19: Proceedings of the 2019 5th International Conference on Computing and Data Engineering", "abstract": "ABSTRACT\nIn the era of big data on the Internet, top-N recommender systems constitute a mission-critical technology in e-commerce applications. However, sparse data is one of the key factors leading to poor performance of the recommendation algorithm. In this paper, we propose a low-rank matrix completion recommendation scheme based on spectral clustering. The underlying idea is that spectral clustering based on rating and item classification information is used to achieve the division of the similar user group. Furthermore, we use low-rank matrix completion to effectively predict the unrated items in the sub-matrix of the spectral clustering. The real dataset experimental results show that our proposed scheme often outperform other state-of-the-art algorithms in top-N recommendation.", "references": ["Pornpit Wongthongtham and Bilal Abu Salih. Ontology-based approach for identifying the credibility domain in social big data. Journal of Organizational Computing and Electronic Commerce, 28(4):354--377, 2018.", "Yuheng Wang, Xiang Zhao, Yifan Chen, Wenjie Zhang, and Weidong Xiao. Local top-n recommendation via refined item-user biclustering.2017.", "Ning Xia and George Karypis. Slim: Sparse linear methods for top-n recommender systems. pages 497--506, 2011.", "Enrico Palumbo, Giuseppe Rizzo, and Raphael Troncy. entity2rec: Learning user-item relatedness from knowledge graphs for top-n item recommendation. In Eleventh ACM Conference on Recommender Systems, pages 32--36, 2017.", "Paolo Cremonesi, Yehuda Koren, and Roberto Turrin. Performance of recommender algorithms on top-n recommendation tasks. In ACM Conference on Recommender Systems, pages 39--46, 2010.", "Linyuan Lv, Matus Medo, Ho Yeung Chi, Yi Cheng Zhang, Zi Ke Zhang, and Tao Zhou. Recommender systems. Physics Reports, 519(1):1--49, 2012.", "Jun Wang, Arjen P De Vries, and Marcel J. T Reinders. Unifying user-based and item-based collaborative filtering approaches by similarity fusion. pages 501--508, 2006.", "Nathan N. Liu and Qiang Yang. Eigenrank: a ranking-oriented approach to collaborative filtering. In International ACM SIGIR Conference on Research and Development in Information Retrieval, pages 83--90, 2008.", "M. Partridge and M. Jabri. Robust principal component analysis. In Neural Networks for Signal Processing X, 2000. Proceedings of the 2000 IEEE Signal Processing Society Workshop, pages 289--298 vol.1, 2002.", "Guang Fu Sun, W. U. Le, Qi Liu, Zhu Chen, and En Hong Chen. Recommendations based on collaborative filtering by exploiting sequential behaviors. Journal of Software, 24(11):2721--2733, 2013.", "Badrul Sarwar, George Karypis, Joseph Konstan, and John Riedl. Item-based collaborative filtering recommendation algorithms. In International Conference on World Wide Web, pages 285--295, 2001.", "Bilal Abu-Salih, PornpitWongthongtham, Kit Yan Chan, and Dengya Zhu. Credsat: Credibility ranking of users in big social data incorporating semantic analysis and temporal factor. Journal of Information Science, page 0165551518790424, 2018.", "Xin Liu and Karl Aberer. Soco:a social network aided context-aware recommender system. pages 781--802, 2013.", "Alexandros Karatzoglou, Xavier Amatriain, Linas Baltrunas, and Nuria Oliver. Multiverse recommendation:n-dimensional tensor factorization for context-aware collaborative filtering. In ACM Conference on Recommender Systems, Recsys 2010, Barcelona, Spain, September, pages 79--86, 2010.", "Xin Wang, Weike Pan, and Congfu Xu. Hgmf: Hierarchical group matrix factorization for collaborative recommendation. In ACM International Conference on Conference on Information and Knowledge Management, pages 769--778, 2014.", "Emmanuel J. Candes and Yaniv Plan. Matrix completion with noise. Proceedings of the IEEE, 98(6):925--936, 2010.", "John Wright, Arvind Ganesh, Shankar Rao, and Yi Ma. Robust principal component analysis: Exact recovery of corrupted low rank matrices. Advances in Neural Information Processing Systems, 87(4):20:3--20:56, 2009.", "Benjamin Recht. Exact matrix completion via convex optimization.ACM, 2012.", "Yong Wang, Yuan Jiang, Yi Wu, and Zhi Hua Zhou. Spectral clustering on multiple manifolds. IEEE Transactions on Neural Networks, 22(7):1149--1161, 2011.", "Jonathan L Herlocker, Joseph A Konstan, and John Riedl. Explaining collaborative filtering recommendations. In Proceedings of the 2000 ACM conference on Computer supported cooperative work, pages 241--250. ACM, 2000.", "Luxburg and Ulrike. A tutorial on spectral clustering. Statistics, Computing, 17(4):395--416, 2007.", "R. K. Chung Fan. Spectral graph theory. Published for the Conference Board of the mathematical sciences by the American Mathematical Society, 1997.", "Aditya Grover and Jure Leskovec. node2vec:scalable feature learning for networks. In Acm Sigkdd International Conference on Knowledge Discovery, Data Mining, pages 855--864, 2016.", "T. U. Dan-Dan, Cheng Chun Shu, and Y. U. Hai-Yan. Using unified probabilistic matrix factorization for contextual advertisement recommendation. Journal of Software, 24(3):454--464, 2013.", "Yehuda Koren, Robert Bell, and Chris Volinsky. Matrix factorization techniques for recommender systems. Computer, 42(8):30--37, 2009.", "Yehuda Koren and Robert Bell. Advances in Collaborative Filtering. Springer US, 2011.", "J. Bobadilla, F. Ortega, and A. Hernando. Recommender systems survey. Knowledge-Based Systems, 46(1):109--132, 2013.", "A. Eriksson and A. Van Den Hengel. Efficient computation of robust weighted low-rank matrix approximations using the l1 norm. IEEE Transactions on Pattern Analysis and Machine Intelligence, 34(9):1681, 2012."]}]